[{"objectId":"twvPm59wsI","title":"テスト","summary":"テスト","description":"テスト","type":"talk","category":"devrel","level":"beginner","reason":"テスト","coc":true,"record":true,"no_support":true,"user":"FLveXtyHS5","lang":"ja","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2024-11-14T13:10:41.513Z","updatedAt":"2025-05-24T12:35:21.600Z","is_enabled":true,"rating":2,"review":true,"ACL":"{\"FLveXtyHS5\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/","interview_youtube":""},{"objectId":"dD6E2Xb19W","title":"Bridging the Gap: Why Developer Relations and Product Management Must Work Together","summary":"Discover how tight collaboration between Developer Relations and Product Management can turn community insights into product impact. This session explores why DevRel is not just an external-facing role—but a strategic partner in shaping what gets built and why it matters.","description":"Developer Relations (DevRel) is often seen as a community-facing role focused on evangelism, education, and engagement. But what happens when DevRel is deeply integrated with Product Management (PM)? Magic.\n\nThis session will explore:\n\t•\tHow DevRel acts as a “real-time feedback loop” for product teams\n\t•\tWhy developer empathy is a strategic asset, not a soft skill\n\t•\tPractical collaboration models between DevRel and PM\n\t•\tReal-world examples of how developer feedback influenced product direction\n\t•\tHow to measure the joint impact of DevRel and PM initiatives\n\nBy the end, you’ll walk away with actionable ways to bring your DevRel and PM teams closer together—and make your products not only more developer-friendly, but more successful overall.","type":"talk","category":"business","level":"Intermediate","reason":"Taiji Hagino brings a unique perspective to the intersection of Developer Relations and Product Management, drawn from his extensive experience in both technical and strategic roles. As a developer advocacy expert, and a former product developer, he has worked closely with product teams to translate real-world developer needs into actionable product feedback.\n\nHis background spans product development, technical evangelism, and developer education. In addition to his industry roles, he teaches university courses on cloud architecture and developer experience, giving him a systems-level understanding of what developers value—and what products must deliver.\n\nTaiji is also a founder and board member of multiple industry associations in Japan. This blend of grassroots developer insight, product collaboration, and strategic community leadership makes him especially qualified to speak about how DevRel and PM can—and must—work hand in hand to drive developer-first innovation.\n","coc":true,"record":true,"no_support":true,"user":"LkpahEPGU7","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-29T23:48:19.740Z","updatedAt":"2025-06-17T05:30:26.140Z","is_enabled":true,"rating":5,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","first_event":"I have spoken a similar story at ProductTank Kyoto, but this session is slightly difference story what modified to the DevRelKaigi. ","co_speaker":"","deadline":"2025-06-24T02:29:40.244Z","key":"null","responseStatus":true,"slug":"taiji","name":"Taiji Hagino","x_account":"taiponrock","organization":"HERE Technologies","speaker_url":"https://devrelkaigi.org/en/speakers/taiji","interview_youtube":"https://www.youtube.com/watch?v=ralIIzNeSQs"},{"objectId":"iyhWks8VxH","title":"Engineering the AI Experience: Making Developer Resources AI-Ready","summary":"Developers use AI tools daily for coding, debugging, and building applications. These tools frequently generate incorrect solutions due to outdated or poorly structured developer resources. With developers adapting AI tools in their day-to-day, it is crucial that these resources should be AI ready. Join me in this talk to dive deeper into what AI Experience is, and why you should focus on it.","description":"Most of the developers today are using AI to be more productive. Whether it be code editors like Cursor, or online tools/platforms like v0, bolt, etc. developers are using them everyday. However, these tools often misinterpret developer resources, leading to incorrect suggestions and developer frustration.\nIn this talk, I will share why it is important to think AI first, and what are the best practices to follow.\nThe talk will have the following outline:\n- Introduction to the problem\n- Importance of AI experience\n- Techniques and best-practices to be AI ready\n- Demo of MCP (stretch goal)\n- Conclusion\n","type":"talk","category":"devrel","level":"Intermediate","reason":"As a developer myself, I use AI for coding, debugging, and building applications. Often times, I have been the victim of incorrect responses from AI, leading to frustration. Fortunately, I am a part of the team that is working for the developer community making sure that developers interacting our products don't face the same issues. Hence, my experience both as a the frustrated developer, and a part of team that is working on a solution makes me a right fit for this talk.","coc":true,"record":true,"no_support":true,"user":"QS0gyUGCnQ","lang":"en","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-01-07T14:55:21.681Z","updatedAt":"2025-05-24T07:47:23.083Z","is_enabled":true,"rating":2.7142857142857144,"review":true,"ACL":"{\"QS0gyUGCnQ\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:admin\":{\"read\":true,\"write\":true}}","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"harshil1712","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/harshil1712","interview_youtube":""},{"objectId":"uR46pMpSpv","title":"リレーションからマーケティングへ。継続するDevRelのために行うべきこと","summary":"DevRelは「関係構築」「認知拡大」に重きが置かれがちですが、ビジネス視点が欠けると、継続的な投資は難しくなります。本セッションでは、活動初期からビジネスゴールを意識し、DevRelを“マーケティング”として捉える重要性と、その実践方法について考察します。","description":"DevRelは、開発者との信頼関係を築き、製品やサービスへの理解と好感を深める役割として重要視されています。しかしその一方で、「関係構築」や「技術発信」に偏りすぎた活動は、ビジネスインパクトが見えにくくなり、結果として予算縮小や組織からの切り離しにつながるケースも少なくありません。\n\n本セッションでは、DevRel活動を長期的かつ安定的に継続するために欠かせない「ビジネスの視点」を取り上げます。売上や利益といった明確なKPIとの接続、DevRelのアウトプットとビジネスゴールの接続、他部門との連携、ROI（投資対効果）の可視化といった要素を通じて、DevRelの存在価値を社内に示す必要性を論じます。\n\n1. DevRelにおける「よくある誤解」：リレーション重視の限界  \n2. DevRelの活動とビジネスゴールのズレがもたらすリスク  \n3. 継続的な活動のための“マーケティング思考”の導入  \n4. 成果を示す指標設計と、他部門との連携方法  \n5. DevRelの「戦略的再定義」に向けた提案\n\n本セッションは、現場でDevRelに携わるエバンジェリストやアドボケイト、マーケター、またはマネジメント層の方に向けてお話しします。日々の活動をビジネスインパクトへと昇華させ、DevRelの継続可能性を高めるための視点とヒントを提供します。","type":"talk","category":"business","level":"All","reason":"中津川篤司は、2014年からDevRelのアウトソースサービスを提供し、これまで50社以上のDevRelをサポートしてきました。その活動を通じて見えてきたDevRelの限界と継続性を含んだお話ができるはずです。","coc":true,"record":true,"no_support":true,"user":"KE5MznFkl8","lang":"ja","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-01-04T00:51:51.512Z","updatedAt":"2025-05-24T06:56:09.838Z","is_enabled":true,"rating":4.666666666666667,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-05-31T06:55:33.304Z","key":"","responseStatus":true,"slug":"goofmint","name":"Atsushi","x_account":"goofmint","organization":"MOONGIFT Inc.","speaker_url":"https://devrelkaigi.org/ja/speakers/goofmint","interview_youtube":""},{"objectId":"HiTMtGpMET","title":"技術イベント運営者からみた、技術広報への寄与について語る","summary":"タイトルの通り、技術イベントを主催する立場から、技術イベントがどのように技術広報に寄与するかを語ります。\n","description":"このDevRelKaigiのような技術カンファレンスが、どのように技術広報やDevRelに寄与するかを、\n* TSKaigi 代表理事\n* ScalaMatsuri、関数型まつり 理事\n* レバレジーズ株式会社 テクノロジー戦略室室長\nの立場から語ります。\n\nどこまで語れるかはそれぞれのコミュニティで相談が必要なので、ここでは明言できないです。すみません。\nどんな内容になるかは私もわからないです。それでも良ければ、採択お願いします。","type":"talk","category":"business","level":"Intermediate","reason":"TSKaigi (一般社団法人TSKaigi Association 代表理事)\nScalaMatsuri,関数型まつり(一般社団法人Japan Scala Association)\nレバレジーズ株式会社 テクノロジー戦略室として技術広報にも関与","coc":true,"record":true,"no_support":true,"user":"0aSZCJrOTc","lang":"ja","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-02-26T12:15:39.727Z","updatedAt":"2025-05-24T07:47:20.105Z","is_enabled":true,"rating":2.7142857142857144,"review":true,"ACL":"{\"0aSZCJrOTc\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:admin\":{\"read\":true,\"write\":true}}","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"yoshiteru","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/yoshiteru","interview_youtube":""},{"objectId":"CJAlmg5Quh","title":"越境するテック情熱：AI ツールとの出会いが導いた海外スタートアップとの協働","summary":"業務でのアプリ開発中に出会った海外AIツールとの偶然の縁。単なるユーザーフィードバックから始まったCEOとの対話が、いつしか日本市場進出の架け橋役へと発展しました。\n大手企業との商談機会創出、自発的な技術啓蒙活動を経て、正式な日本地域デベロッパーアドボケイトに。好きな技術を語るだけだった活動が、国際的な企業と日本市場を繋ぐキャリアへと変化した実体験をお話しします。\nテクノロジーへの純粋な情熱が、予想外のキャリアパスを切り拓くことがある—そんな可能性と学びを共有します。","description":"このセッションでは、デザインからコードを生成する革新的なAIツールとの出会いから始まり、海外スタートアップの日本市場展開の一翼を担うまでの軌跡を具体的に解説します。\n\n### お話しする内容\n1. **出会いのきっかけ**\n   - 業務でのモバイルアプリ開発における課題と海外AIツールの発見\n   - 技術的な興味から始まったフィードバックとCEOとの対話プロセス\n2. **関係性の変化と深化**\n   - 単なるユーザーから潜在顧客紹介者へのシフト\n   - 東証プライム上場企業を含む商談機会の創出手法\n   - 代理店契約から地域デベロッパーアドボケイトへの進化\n3. **実践的活動と成果**\n   - 技術セッションでの自発的なプロダクト紹介とその効果\n   - CEOの来日講演サポートの裏側\n   - 顧客ミーティングでの技術デモと通訳における工夫\n4. **得られた知見と教訓**\n   - 技術コミュニティ活動が国際的なビジネス機会につながるメカニズム\n   - 本業のスキル（Microsoftから現職までの20年のエバンジェリスト経験）を活かした副業展開の秘訣\n   - 海外スタートアップと日本企業の文化ギャップを埋める際の実践的アプローチ\n5. **これからの可能性**\n   - テクノロジストが「国際的な架け橋」となる新しいキャリアパスの展望\n   - 副業として技術アドボカシーを展開するための具体的なステップ\n### このセッションから得られるもの\n- 技術への情熱を副業やキャリア拡張につなげる実践的なヒント\n- 海外テックスタートアップとの関係構築における日本特有の課題と解決策\n- テクノロジストが持つ「説明力」「翻訳力」の新たな価値創造の可能性\n- 本業で培ったスキルを別の文脈で活かすためのマインドセットと行動パターン\n\n個人的な実体験に基づく具体的なストーリーを通じて、聴講者自身も自分の技術的関心から新たなキャリアチャンスを見出すきっかけとなるセッションを目指します。技術と人、国と国を「越境」することで生まれる新たな可能性について、共に考える場としたいと思います。","type":"talk","category":"devrel","level":"All","reason":"実体験として自分自身がこの1年リアルタイムに経験していることであり、副業という意味でも新しい形だと思います。","coc":true,"record":true,"no_support":true,"user":"yKIQDHxj1L","lang":"ja","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-31T08:15:54.847Z","updatedAt":"2025-07-03T06:53:05.537Z","is_enabled":true,"rating":4.666666666666667,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-06-24T02:31:47.079Z","key":"null","responseStatus":true,"slug":"shotaro","name":"Shotaro Suzuki","x_account":"shosuz","organization":"FPT Japan Holdings","speaker_url":"https://devrelkaigi.org/ja/speakers/shotaro","interview_youtube":"https://youtu.be/bfPapfZrgEQ"},{"objectId":"sPDoytQ7vj","title":"Effective Documentation: The key to shortest time to hello world (TTHW)","summary":"The easiest way to a developer’s bookmark is through good documentation, and great developer experience. If you are working at a B2D+ company or a dev tool company founder, your biggest struggle at this point is to attract and retain developers. In this talk we will tackle the commonly asked question “how do we make a developer fall in love with us?”\n","description":"Developer Experience is the key behind community led growth, the more tailored your experience is, the more developers you can onboard.\nIn this talk, we will cover:\n- Tips on how to build an effective developer journey.\n- Gain insight on how to assess your audience and the kind of documentation to write.\n- How to build a good developer experience with examples of companies like Vercel, Resend and learnings from TypeScript.\n- How to reduce friction between the developer and the product and eventually build community-led growth.\n\n","type":"talk","category":"devrel","level":"Intermediate","reason":"Haimantika Mitra has been a DevRel professional for 4+ years now. She worked at various startups where she led DevEx initiatives, including building documentation from scratch for companies like Hashnode, and is also an author of the eBook \"How to DevRel for Startups (https://learn.haimantika.com/)\", her experience will be key in helping other DevRel professionals build and lead Developer Experience initiatives and bring impact.","coc":true,"record":true,"no_support":true,"user":"24fCUxhrvj","lang":"en","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-12T13:17:21.163Z","updatedAt":"2025-05-24T07:47:38.805Z","is_enabled":true,"rating":3.4285714285714284,"review":true,"ACL":"{\"24fCUxhrvj\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:admin\":{\"read\":true,\"write\":true}}","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"haimantika","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/haimantika","interview_youtube":""},{"objectId":"ZDzKXx5via","title":"クラウド推進企業間コミュニティ「re:light local」が紡ぐ、地域を越えたDevRelとその未来","summary":"株式会社ヘプタゴン(青森)、エイチビーソフトスタジオ株式会社(愛媛)、株式会社Fusic(福岡)、株式会社クエイル(鹿児島)の4社は、地方のクラウド活用推進を加速する企業間コミュニティ「re:light local」を通じて、地方でのクラウド活用拡大に向けた活動を行っています。本セッションではこれまでの re:light local の活動を紹介しつつ、re:light local がなぜ開発者 (エンジニア) を巻き込むのか、地域を越えて開発者同士の関係性を強化することでどんな未来が待っているのかを紹介します。","description":"# タイトル\nクラウド推進企業間コミュニティ「re:light local」が紡ぐ、地域を越えたDevRelとその未来\n# 講演者\nTakahito KIKUCHI (heptagon inc.)\n# セッションアウトライン\n1. クラウド推進企業間コミュニティ「re:light local」の紹介\n  * 「re:light local」とは何か\n  * イベント開催時点での参画企業\n  * re:light local が参加者に提供する「4つのC」\n  * re:light local が目指す世界\n2. re:light local 参画企業の事例から見る「地方でクラウドビジネスを推進するポイント」\n  * アプローチ1 : お客様と目線を合わせる\n  * アプローチ2 : テクノロジーのことは全て任せてもらう関係をつくる\n  * アプローチ3 : クラウドネイティブで課題を捉え直す\n  * アプローチ4 : 公開事例を “正しく” ローカライズする\n3. re:light local を立ち上げた意義と地域を越えたDevRel\n  * 地方のITビジネスやデジタル化、DXの課題\n  * re:light local活動拡大の鍵となる「地域のCCoE企業」\n  * 地域のCCoE企業が作る新しい商慣習とエコシステム\n  * 地方エンジニアが抱える悩みをなぜ re:light local (コミュニティ) が打破できるのか\n  * コミュニティの力で地方はまだまだ盛り上がれる","type":"talk","category":"community","level":"All","reason":"参画企業(ヘプタゴン)の立場から当該コミュニティのイベント企画や運営に加え、東北地方が中心ですが個人のつながりによる地域エンジニアとのハブとして活躍して参りました。当該コミュニティに限らず、現在の役割 (エンジニア企業の経営管理リード) の活動において、DevRelが果たす目的の一つである「よき開発者体験の提供」はミッションとして共通しています。また、エンジニア出身のためコミュニティの熱量など、関わった方の人生を変えるかもしれないポテンシャルは認識しており、立場が変わった今もなお貢献を続けるほど魅力的な存在だと認識しております。re:light localへの貢献、自身のミッション、対象への理解を備えた私は、本提案の内容を参加された皆様へお話しし、よき学びを提供できるのに適した者だと考えます。","coc":true,"record":true,"no_support":true,"user":"RUmxWwLOdi","lang":"ja","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-13T10:02:17.164Z","updatedAt":"2025-05-24T07:47:30.258Z","is_enabled":true,"rating":3.2857142857142856,"review":true,"ACL":"{\"RUmxWwLOdi\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:admin\":{\"read\":true,\"write\":true}}","first_event":"DevRel/Tokyo #95〜アンカンファレンス〜、JAWS DAYS 2025 - connecting the dots","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"takahito","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/takahito","interview_youtube":""},{"objectId":"RApcsqldBo","title":"What if Your DevRel Could Also Write? PS: The Secret Weapon in DevRel","summary":"DevRel teams love their demos, talks, and Twitter threads, but often overlook the most clicked, most trusted, and most silently powerful piece of the puzzle: The Docs.\n\nBehind every great developer experience is a great document, but we rarely talk about WHO wrote it. \nIn this talk, I’ll explore how combining writing skills with DevRel responsibilities supercharges everything from onboarding and API adoption to community trust and content strategy. I’ll share the lessons I have learned from my own journey of growing into a Developer Advocate, working across open-source ecosystems and developer tools, and outline how DevRel teams can better recognize, collaborate with, and grow from technical writing. If you're still treating writing as “support work,” you're leaving developer success behind. Let’s rethink DevRel, not just as a speaker’s role, but as a writer’s platform too.\n","description":"**What if your DevRel Engineer wasn’t just a speaker, demo builder, or community face, but also your strongest communicator on paper? **\n\nFor many developers, documentation is their first, and sometimes the only touchpoint with your product. It conveys your tone, your values, and your attention to detail. If your docs aren’t clear, accessible, and globally relevant, your community won’t be either. And yet, the people who craft this experience—the technical writers, are rarely acknowledged as part of the DevRel equation. \n\nThis talk shines a light on the overlooked role of technical writers in Developer Success. From first-touch onboarding to long-tail adoption, I’ll show how good docs are doing DevRel’s most critical work, quietly and at scale. I will also share how my experience as a technical writer organically led me to take on DevRel responsibilities, and why this hybrid model is more powerful (and sustainable) than most teams realise. \n\nThrough out this talk, we will dig into:\n* How technical writing impacts onboarding, adoption, and community health\n* Where and How DevRel teams are losing efficiency by not investing in writing\n* How to elevate technical writers as contributors in DevRel strategy, within the existing workflows, without changing your org chart.\n","type":"talk","category":"devrel","level":"Intermediate","reason":"I’ve been a technical writer at ONLYOFFICE for the past two years, but in reality, I’ve also been quietly doing the work of a DevRel all along. From speaking at conferences to helping community developers troubleshoot integrations and improve onboarding flows, I’ve been sitting at the intersection of writing, developer support, and community engagement.\n\nThis undercover, hybrid DevRel X Technical Writer role has worked us wonders and this approach has allowed us to scale support, reduce onboarding friction, and build a global community of contributors without relying heavily on traditional evangelism.\n\nAs the first technical writer on our team to step into the shoes of a DevRel Engineer, I’m in a unique position to share not just the “why,” but also the “how” with practical examples, workflows, and lessons from a team that’s been doing DevRel through technical writing for long.","coc":true,"record":true,"no_support":true,"user":"mtAxEaTpkP","lang":"en","status":"Sent","cfp":"FVkLmDT7az","createdAt":"2025-07-02T13:14:00.113Z","updatedAt":"2025-07-13T05:08:39.144Z","is_enabled":true,"rating":4.666666666666667,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-07-20T01:43:02.677Z","key":"null","responseStatus":true,"slug":"sawanteeshaan","name":"Eeshaan Sawant","x_account":"","organization":"ONLYOFFICE","speaker_url":"https://devrelkaigi.org/en/speakers/sawanteeshaan","interview_youtube":""},{"objectId":"fDa0wIb3f3","title":"成長フェーズで変わるDevRelの最適解 〜企業営利活動としてのDevRel戦略〜","summary":"DevRelは万能ではなく、企業の成長段階によって効果と実施すべき方法が大きく異なります。本セッションでは、スタートアップから成熟した企業まで各フェーズにおけるDevRelの位置づけと最適なアプローチを解説します。\n特に企業の営利活動としてのDevRelに焦点を当て、トップダウン・ボトムアップの使い分け、リソース配分、外部とのコラボレーション戦略などの現場で培った知見を共有します。成功するDevRelを始める「最適なタイミング」を見極める視点を提供します。","description":"DevRelは市場や企業の成長に合わせて変化する営利活動の一部であることは疑いようがありません。本セッションでは、企業規模別の最適なDevRel戦略を実践知に基づき解説します。\n\n小規模(特にスタートアップ)企業では、限られたリソースを考慮し、トップダウンセールスを優先すべき理由と、DevRelが不向きとなる状況を説明します。現場の技術者が製品の良さを理解しても、決裁権がなければ採用につながらない現実も踏まえ、例外的にDevRelが有効となるケースも紹介します。\n中規模企業においては、初期営業活動後の市場開拓フェーズで、トップダウンとボトムアップのハイブリッドアプローチが効果を発揮する仕組みを解説します。特に、意思決定者と現場のギャップを埋めるDevRelの役割と、既存顧客のノウハウを活用した複数チャネルでの情報発信の有効性について具体例を交えて紹介します。\n成熟企業では、深いユーザーコミュニティとの関係構築、チャンピオンプログラムの設計や外部とのコラボレーションによる活動の更なる促進など、エコシステム形成に向けた高度化するDevRel活動について解説します。\n\n各フェーズでの成功や失敗事例を交えながら、効果的にDevRelを開始・拡大するための実践的なフレームワークを提供します。","type":"talk","category":"devrel","level":"All","reason":"日系システムインテグレータに所属していた時からDevRelに関わりを持ち、大規模外資ITツールベンダ、スタートアップ外資ITツールベンダとDevRelを中心に添えてキャリアを変遷してきました。様々な視点でDevRelを捉える機会に恵まれ、思考しながら都度トライアンドエラーを繰り返しています。その間にはDevRel以外の企業活動を行うことも多くありました。それらのノウハウをまとめ、企業活動全体におけるDevRelの立ち位置やその最適化について、過去の経験やTipsを共有することができます。","coc":true,"record":true,"no_support":true,"user":"HaxzGHkVJr","lang":"ja","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-31T07:46:36.102Z","updatedAt":"2025-05-24T10:03:05.945Z","is_enabled":true,"rating":4.6,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-05-31T10:01:44.117Z","key":"null","responseStatus":true,"slug":"odasho","name":"小田 祥平","x_account":"odashoDotCom","organization":"mabl K.K.","speaker_url":"https://devrelkaigi.org/ja/speakers/odasho","interview_youtube":""},{"objectId":"UUSftDFfal","title":"Boosting DevRel: Simple SEO, Scalable Programs, and Community Power","summary":"In this session, I will outline three actionable pillars - SEO optimization, modular program frameworks, and community engagement tactics, that enable DevRel teams to amplify their impact without proportionally increasing headcount or budget. Attendees will walk away with a clear, step-by-step playbook they can implement immediately to generate more organic reach, launch repeatable programs, and foster a vibrant developer community.","description":"Developer Relations doesn’t have to require massive resources or overengineered initiatives. In this talk, I will break down how any team can:\n\n1. Leverage SEO to Attract Developers\n - Identify high-value keywords that align with real developer search behavior\n - Structure blog posts, tutorials, and documentation so search engines—and developers—can find your content effortlessly\n - Apply a simple SEO checklist to increase organic traffic within months\n\n2. Build Programs That Scale Like Lego\n - Design a “template” for hackathons, office hours, webinars, and workshops that can be reused globally\n - Automate invitation workflows, slide decks, and follow-up surveys so you can spin up new events in days rather than weeks\n- Optimize resource allocation so you don’t need to hire additional headcount to run a growing slate of DevRel initiatives\n\n3. Empower and Grow Your Community\n - Establish clear contribution guidelines, mentorship pairings, and small recognition programs (e.g., “Contributor of the Month”)\n - Align with local meetup organizers and open-source maintainers to co-create content and events\n - Leverage feedback loops—surveys, GitHub metrics, and direct outreach—to continuously refine programs and keep contributors engaged\n\n4. Measure, Iterate, and Improve\n - Track core metrics such as Monthly Active Developers (MAD), Pull-Request Velocity (PRV), and Event Feedback Scores (EFS)\n - Set up lightweight dashboards to monitor progress and identify bottlenecks\n - Iterate on program components (e.g., cadence, format, rewards) based on data, not intuition\n\nBy the end of this session, you will have a straightforward, repeatable playbook that leverages SEO, modular program design, and community collaboration to multiply your DevRel impact while maintaining operational efficiency.","type":"talk","category":"experience","level":"All","reason":"I’ll explain how clear contribution guides, mentorship matchups, and small rewards (like “Contributor of the Month”) keep people engaged. These simple tactics have helped me run over 40 events across India, and bring in audiences from across APAC, EU. I also  regularly track key DevRel KPIs  and iterate on program components based on data. This discipline has enabled continuous improvement and demonstrable ROI for my DevRel initiatives.","coc":true,"record":true,"no_support":true,"user":"DG4aCsSYI2","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-31T09:41:04.897Z","updatedAt":"2025-06-17T08:57:20.612Z","is_enabled":true,"rating":4.333333333333333,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-06-24T02:46:14.755Z","key":"null","responseStatus":true,"slug":"sonichigo","name":"Animesh Pathak","x_account":"sonichigo1219","organization":"Harness Inc","speaker_url":"https://devrelkaigi.org/en/speakers/sonichigo","interview_youtube":""},{"objectId":"KIBdNH3tXz","title":"The Essential Fix for Your Developer Marketing","summary":"In this talk, I will cover how to improve developer marketing strategies and some best practices for making your tactics standing ovation-worthy.\n","description":"You've built the perfect product for your developer audience. It covers onboarding pathways and offers a smoother development experience. But there's just one problem: no one's using it.\n\nHow do we build awareness, drive adoption, and turn early users into loyal customers? You've likely already identified your target dev audience, but knowing who they are isn't enough. This is where developer marking comes in, as 84% of the developers(according to Evans Data) influence their companies' decisions. With the right strategies and good technical content, you can do that. However, developers are a unique audience; they don't have any patience for marketing fluff and can quickly tell if you have genuine expertise in the product.\n\nIn my talk, I will cover how to think from a developers' perspective, what developers are looking for, and how to make your existing developer marketing tactics one of the best by implementing strategies that my colleagues and I use at a Developer Marketing agency.","type":"talk","category":"marketing","level":"All","reason":"As a professional with nearly three years of experience in Developer Relations, focusing on Developer Marketing, I have gained valuable insights while working with various companies. I firmly understand Developer Marketing, including aspects often overlooked or not readily available yet that can have a significant long-term impact.\n\nI am currently working as a DevRel Manager for a developer marketing company, Hackmamba, which has significantly improved my skills in developer marketing and technical content, and I am also educating people by writing highly SEO focused developer marketing content. If given a chance, I would show you my skills and knowledge and provide insightful tips to everyone.\n\nHere are my social profiles for cross-verification: \n\nLinkedIn: https://www.linkedin.com/in/akshatvirmani/\nX: https://x.com/VirmaniAkshat\nGitHub: https://github.com/akshatvirmani","coc":true,"record":true,"no_support":true,"user":"voBDzuc2jC","lang":"en","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-30T13:47:22.777Z","updatedAt":"2025-05-24T07:47:42.755Z","is_enabled":true,"rating":3.3333333333333335,"review":true,"ACL":"{\"voBDzuc2jC\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:admin\":{\"read\":true,\"write\":true}}","first_event":"I have given this talk at GDG Dehradun and GDG Brunswick event.","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"akshat","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/akshat","interview_youtube":""},{"objectId":"h50apSumgr","title":"Creating the Human Face of Your Community","summary":"A true community isn’t built on announcements and support tickets—it’s built on genuine connections. Too often, engagement is reduced to numbers, while the real challenge is making people feel like they belong.  \n\nThis session is about making your community feel human, turning passive users into active contributors. We’ll explore open development, real conversations, and celebrating the people who shape your ecosystem. Walk away with actionable strategies to  build trust, foster meaningful participation, and create a space where developers aren’t just users—they’re part of the journey.\n","description":"A community isn’t just about users interacting with your product —it’s about real people forming real connections. Too often, community engagement is reduced to metrics, feature requests, support tickets, and announcements, leaving little room for genuine relationships. In Community Management, the real challenge isn’t just attracting users but turning them into active, invested participants who feel like they belong.  \n\nThis session is about humanizing your community—making it a space where people don’t just follow updates but engage, contribute, and grow together. We’ll explore practical, actionable strategies to build transparency, encourage meaningful discussions, and foster a sense of ownership among your users. From open development roadmaps and interactive Q&A sessions to celebrating community contributions and sharing both wins and failures, this session will cover how to build trust, strengthen engagement, and create an ecosystem where developers feel valued.  \n\nWhat Attendees Will Learn: \n✅ Building Transparency & Trust – How sharing your product’s journey, challenges, and priorities makes users feel like true stakeholders.  \n✅Beyond Feature Requests– Moving past one-way feedback loops and fostering co-creation by involving users in product evolution.  \n✅ Engaging Developers Authentically – How to structure Q&A sessions, post-release discussions, and technical deep dives that go beyond just updates.  \n✅  Celebrating Community Contributions – Practical ways to highlight active members, showcase community-driven projects, and recognize meaningful engagement.  \n✅ Learning From Your Users – Encouraging discussions on workflows, tools, and challenges beyond your product to build a culture of shared knowledge.  \n✅ Building Real Conversations – Why open-ended discussions, thought-provoking questions, and transparent conversations help build lasting connections.  \n✅ The Role of Storytelling in Community Building – How to make your community feel more personal and relatable by sharing the human side of development.  \n\n","type":"talk","category":"community","level":"All","reason":"With over four years of hands-on experience in community building in EdTech and AI Industry and my role as a chapter moderator for CMX Connect Delhi, I’ve spent years working closely with developers, open-source contributors, and tech communities—figuring out what truly makes people stay, engage, and feel like they belong.  \n\nThis talk comes from real, lived experience, not just theory. I’ve seen communities thrive when they feel human, and I’ve also seen them struggle when engagement is reduced to just numbers and updates. Through trial, error, and countless conversations, I’ve learned what actually works—how to build trust, create spaces where people genuinely want to participate, and turn passive users into active collaborators.  \n\nThis session is about sharing those hard-earned lessons so that you can build a community that isn’t just active, but deeply connected and invested in what you’re creating.","coc":true,"record":true,"no_support":true,"user":"X2mAwBcx8H","lang":"en","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-26T19:40:30.045Z","updatedAt":"2025-05-24T08:54:53.692Z","is_enabled":true,"rating":4.285714285714286,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"I’ve spoken on community leadership and engagement at events like CMX Connect Delhi : https://events.cmxhub.com/events/details/cmx-delhi-presents-inspire-amp-connect-stories-of-community-leadership/ ","co_speaker":"","deadline":"2025-05-31T07:29:18.953Z","key":"null","responseStatus":true,"slug":"awantika","name":"Awantika Nigam","x_account":"NigamAwantika","organization":"Refact.ai","speaker_url":"https://devrelkaigi.org/en/speakers/awantika","interview_youtube":"https://youtu.be/mwFwb04vytY"},{"objectId":"MFliCb3HM1","title":"Bridging the Culture Gap: Enabling Japan and Global Dev Teams to Thrive Together","summary":"How can Japanese companies and international dev teams collaborate without cultural friction? This session explores real practices and mindsets to bridge communication gaps, foster mutual understanding, and create truly productive cross-cultural developer teams.","description":"Japan’s development culture values formality, hierarchy, and long-term trust. Global teams often prioritize speed, transparency, and async collaboration. These differences can cause tension, but they can also create opportunity.\n\nAs a Bridge Software Engineer and Internal Dev Advocate, I work closely with Japanese clients, managers, and offshore dev teams. I also mentor engineering managers and team leaders, supporting them in navigating and aligning with Japanese-style work practices to improve cross-cultural collaboration and team productivity.\n\nThrough this experience, I’ve learned how to translate not just language, but also expectations, priorities, and working styles—helping teams reduce friction and work more effectively together.\n\nIn this talk, I’ll share:\n\n- Real examples of where cultural gaps caused delays—or breakthroughs\n- How I support leaders in adapting to Japanese workflows without sacrificing their leadership style\n- Strategies to build psychological safety across borders\n- Communication tips for Japanese stakeholders and international developers\n-  Frameworks to align product, team, and customer goals despite cultural gaps\n\nIf you're involved in or planning cross-border dev projects, this session will offer practical strategies for making them work smoothly.","type":"talk","category":"team","level":"All","reason":"I’ve lived in Japan for over 15 years and currently serve as a Bridge Software Engineer and Internal Dev Advocate, facilitating collaboration between Japanese clients and offshore teams in the Philippines. I mentor engineering managers and team leaders, helping them align their leadership and workflow with the expectations of Japanese businesses.\n\nMy role puts me at the intersection of engineering, communication, and culture, making me well-positioned to speak on how to bridge these gaps productively.","coc":true,"record":true,"no_support":true,"user":"o0pqZMYSPo","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-24T16:43:51.065Z","updatedAt":"2025-06-17T03:35:48.632Z","is_enabled":true,"rating":4.25,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-06-24T02:31:52.181Z","key":"null","responseStatus":true,"slug":"avie","name":"Avie Fukai","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/speakers/avie","interview_youtube":"https://youtu.be/5zxVwH2sfZw"},{"objectId":"uIGC1bt9Xt","title":"アクセシビリティをもっと身近に：効果的な伝え方と実践例","summary":"アクセシビリティはすべての人にとって重要なテーマですが、適切に伝えないと「難しそう」「後回しでいい」と思われがちです。本セッションでは、開発者・デザイナー・ビジネス層それぞれに響く伝え方のコツを紹介し、アクセシビリティを「特別なもの」ではなく「当たり前のこと」として浸透させる方法を考えます。","description":"1. まずは簡単にアクセシビリティとは？\nアクセシビリティの基本的な概念を、専門知識がない人でも理解しやすい形で整理します。\n\n2. アクセシビリティが「伝わらない」理由とは？\nなぜアクセシビリティの必要性が正しく伝わらないのか、よくある誤解や課題を分析します。\n\n3. ターゲット別の伝え方\n関係者によって関心や優先度が異なるため、相手に合わせた伝え方が重要です。\n\nエンジニア：技術的な課題や実装のしやすさにフォーカスした伝え方\n\nデザイナー：デザインプロセスに組み込む方法や、ユーザー体験の向上につながる話し方\n\nビジネス層：ROIや法的リスク、ブランド価値向上といったビジネスメリットを強調","type":"talk","category":"devrel","level":"All","reason":"私は、10年ほどデザイナーとエンジニアの橋渡しをしながらアクセシビリティを推進してきました。現在はGoodpatchでアクセシビリティの診断・改善・支援・啓発を行い、社内外でのトークや記事などを通じて、エンジニア・デザイナー・ビジネス層それぞれに響くコミュニケーションを実践しています。\n\n前職でも社内デザインシステムのDevRelを担当しました。\n\nなお、本セッションは日本語でも英語でも実施可能であり、Q&Aも両言語に対応できます。","coc":true,"record":true,"no_support":true,"user":"cHXaDO4qCk","lang":"ja","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-31T10:11:23.358Z","updatedAt":"2025-05-24T07:47:17.574Z","is_enabled":true,"rating":2.5,"review":true,"ACL":"{\"cHXaDO4qCk\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:admin\":{\"read\":true,\"write\":true}}","first_event":"ない","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"maddyscodes","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/maddyscodes","interview_youtube":""},{"objectId":"uEtxGhi4c0","title":"Developer marketing doesn't exist without Developer Experience","summary":"In this talk, I will cover how developer marketing is incomplete without Developer Experience ","description":"Developers appreciate marketing that doesn’t feel like marketing, but even the most brilliant developer marketing strategy will crumble without a solid developer experience plan. Developers are overloaded with options. They're not impressed by popularity or flashy features. They care about authenticity, efficiency, and software tools that fit smoothly into their workflow.\n\nIn this talk, I will cover why developer experience is the backbone of developer marketing and how we can improve it.","type":"talk","category":"devrel","level":"All","reason":"As a professional with nearly three years of experience in Developer Relations, focusing on Developer Marketing and Developer experience, I have gained valuable insights while working with various companies.\n\nI am currently working as a DevRel Manager for a developer relations agency, Hackmamba, which has significantly improved my skills in developer marketing, developer experience, and technical content. I have been giving talks for almost 4 years, covering topics like communities, technologies and developer relations. I have good experience working with the audience and helping them and myself achieve various goals.\n\nMy social Media profiles: \n\nLinkedIn: https://www.linkedin.com/in/akshatvirmani/\nX: https://x.com/VirmaniAkshat\nGitHub: https://github.com/akshatvirmani","coc":true,"record":true,"no_support":true,"user":"voBDzuc2jC","lang":"en","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-31T10:39:50.893Z","updatedAt":"2025-05-24T07:47:25.221Z","is_enabled":true,"rating":3,"review":true,"ACL":"{\"voBDzuc2jC\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:admin\":{\"read\":true,\"write\":true}}","first_event":"I have done this talk at Doon Technical Community (DTC by Aditya Oberai) event and also have written SEO optimized article on the topics which are ranking at Top 10. ","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"akshat","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/akshat","interview_youtube":""},{"objectId":"3cnCg96LRr","title":"勉強会から始まった僕のDevRel~新卒エンジニアがつないだ2年間の軌跡~","summary":"新卒で入社してからの約2年、私は開発者としての成長と並行して、勉強会を起点に社内外の関係構築に取り組んできました。本セッションでは、チームや組織を越えたつながりを築きながら、DevRel的な価値をどう実践してきたのかを、現場エンジニアの視点からお話しします。","description":"2023年に新卒で入社し、フルリモート・複数チーム所属という環境の中で、私は孤独感と向き合っていました。自分の存在や価値をどうやってチームに示していけばいいのか。その問いの答えとしてたどり着いたのが、「自分が場をつくること」でした。\n\n私は社内勉強会を立ち上げ、社内での技術交流の場を増やし、少しずつ仲間とのつながりを築いていきました。やがてそれは社外勉強会への登壇、他社エンジニアとの交流へと発展していきます。\n\n活動を続ける中で、周囲のメンバーにも変化が現れました。「登壇してみたい」「他社の人と話してみたい」といった声が増え、私自身が直接つながるだけでなく、他のメンバーが社外との関係を築く後押しにもつながっていきました。\n\nこのセッションでは、\n\n- 入社直後に直面したコミュニケーションの壁\n- 社内勉強会をどのように立ち上げ、継続してきたか\n- 勉強会を通じて得られた関係性とその広がり\n- 社外発信へつながったきっかけと工夫\n- 現場エンジニア視点で見たDevRelの実践\n\nを、具体的なエピソードを交えてお話しします。","type":"talk","category":"community","level":"beginner","reason":"私は株式会社ゆめみに新卒で入社し、サーバーサイドエンジニアとして約2年半にわたり、勉強会を軸に社内外の開発者との関係構築に取り組んできました。\n\nDevRelを専門とする職種ではない立場から、自然発生的に関係を築いてきた経験は、「自分もやってみよう」と思えるリアルな実例として、参加者に勇気と具体的なヒントを提供できると考えています。","coc":true,"record":true,"no_support":true,"user":"DGn6Uu62kU","lang":"ja","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-26T18:10:12.913Z","updatedAt":"2025-07-03T06:53:13.731Z","is_enabled":true,"rating":4.25,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-06-24T02:31:53.916Z","key":"null","responseStatus":true,"slug":"uutan1108","name":"Yusuke Ohmori","x_account":"","organization":"YUMEMI Inc.","speaker_url":"https://devrelkaigi.org/ja/speakers/uutan1108","interview_youtube":""},{"objectId":"fKzurzPHWW","title":"職種別ミートアップで社内から盛り上げる　アウトプット文化の醸成と関係強化","summary":"「職種別ミートアップ」とは、異なる部門に所属する同じ職種のエンジニアが集まり、LT発表や情報交換、意見交換を行う場である。このミートアップの目的は、エンジニア同士の関係を深め、知見を共有することだ。筆者は職種別ミートアップを定期的に開催し、フロントエンドやデザイナー、セキュリティなどのミートアップを展開している。発表内容は技術的な内容やプロジェクトで得られた経験など多岐にわたり、アウトプット文化が醸成されている。\n\n運営面ではプロデューサー的な立場で企画し、運営メンバーを募り、自走できるよう働きかけている。社内コミュニティも形成されつつあり、副次的な効果として、社内のミートアップで発表した内容を社外向けに話すメンバーも現れ始めた。社内でのアウトプットや関係強化がベースとなり、外部発信やエンジニアの成長機会創出に発展している。","description":"「職種別ミートアップ」とは、社内で異なる部門に所属する同じ職種のエンジニアが集まり、LT発表や情報交換、意見交換を行う場である。このミートアップの目的は、社内のエンジニア同士の関係を深め、知見の共有を行うことだ。\n\n50〜100人規模のエンジニアを抱える企業では、事業や職種単位に組織が形成されエンジニア同士の横の繋がりや関係性が希薄になる傾向がある。コロナ禍で在宅勤務が進み、対面で会う機会や集まる機会が失われたため、積極的な関わりが必要になった。そこで、筆者は職種別ミートアップを社内で定期的に開催、職種を変えフロントエンドやデザイナー、データサイエンス、セキュリティなどのミートアップを展開している。\n\n発表内容は、技術的な内容や開発、プロジェクトで得られた経験、チームの取り組みまで多様だ。個々の社員が自分の知識や経験を積極的に共有し、組織全体の成長を促進するアウトプット文化が醸成されてきている。\nまた、運営面でも最初はプロデューサー的な立場で企画し、運営メンバーを募り自走できるよう働きかけてきた。社内コミュニティも形成されつつある。\n\n副次的な効果として、社内のミートアップで発表したことを社外向けに話すメンバーも現れ始めた。社内でのアウトプットや関係強化が盛り上がりに繋がり、回り回って外部への発信やエンジニアの成長機会創出に発展している点を解説したい。","type":"talk","category":"community","level":"beginner","reason":"私は西馬一郎と申します。Developer Relations の考え方を学び実践するDevRel/Tokyo に継続的に参加しDevRelについて学んできた。参加回数は220回以上。自身の発表を通じたアウトプットやミートアップ参加者と積極的に意見交換を行っている。","coc":true,"record":true,"no_support":true,"user":"RrcCRQzGw2","lang":"ja","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-30T08:20:51.708Z","updatedAt":"2025-05-24T07:36:51.832Z","is_enabled":true,"rating":4.166666666666667,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-05-31T07:06:53.928Z","key":"null","responseStatus":true,"slug":"beppu01en","name":"Ichiro Nishiuma","x_account":"beppu01","organization":"NIKKEI","speaker_url":"https://devrelkaigi.org/en/speakers/beppu01en","interview_youtube":"https://youtu.be/6_On_4CaBmk"},{"objectId":"v641rlnSvt","title":"Testing AI is the First Step to Using AI - A Guide for Marketing Teams","summary":"Sales and marketing professionals in high tech are being told—daily, loudly, and from every direction—that they should be using AI. And while it's absolutely true that AI has real potential to boost productivity and unlock new insights, there's a crucial first step that often gets skipped: testing.\n\nTesting AI means understanding what you're working with, how to evaluate its output, and knowing when to set it aside. Without that foundational step, you risk wasting time, drawing bad conclusions, or simply being wowed by a tool that's confident but wrong. Let’s break down what to look for when evaluating tools like ChatGPT, and how to determine when it can help—and when it can’t.\n","description":"This talk is the result of testing AI with data from a large developer community with over 2,800 registered users, almost 800 unique organizations, 9 years of cumulative data, from 41 countries. It's simply too much data for a marketing team to realistically try to analyze. Too much information for working in a spreadsheet or a series of spreadsheets.\n\nThe talk will cover 3 main areas:\n\n1. The Natural Language Interface and the LLM Are Not the Same Thing\n2. AI and Spreadsheets Do Not Mix Well, Currently\n3. Based on Tests by Oppkey, AI Is Not Good at Scrubbing Data\n\n","type":"talk","category":"marketing","level":"All","reason":"Direct experience managing the technology community that provides the base case study for the talk.","coc":true,"record":true,"no_support":true,"user":"EDGMFiqML4","lang":"en","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-31T16:46:34.056Z","updatedAt":"2025-05-24T07:47:14.802Z","is_enabled":true,"rating":2.1666666666666665,"review":true,"ACL":"{\"EDGMFiqML4\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:admin\":{\"read\":true,\"write\":true}}","first_event":"--","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"jcasman","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/jcasman","interview_youtube":""},{"objectId":"R1zHmCWRTm","title":"Docs for the AI age","summary":"Like most aspects of our lives, AI is also transforming how developers consume docs. My talk will focus on how dev-tool companies can leverage this transition to ensure that their target customers (developers) use their products effectively.\n\nI'll touch upon the following:\n- Key areas where AI delivers well\n- The human factor (Make AI work for you while maintaining the human touch)\n- What to do when AI struggles (how to deal with problems like misinformation, context loss, hallucinations etc)\n\nAll in all, I feel like this talk can deliver tremendous value to my fellow devrel professionals who will create documentation that technocrats around the world will use, in an AI-assisted fashion, of course!","description":"AI is transforming how developers discover, consume and use technical knowledge. \n\nGone are the days:\n- When developers would discover a niche tool on some Stack Overflow answer or a Reddit post,\n- When developers would spend hours going through your documentation to understand your product,\n- When developers would use your product even if the documentation wasn't good enough! (although it was never really the case anyway)\n\nMy talk focuses on how dev-tool companies must adapt to this changed landscape - one in which AI is an intermediary (between your product and developers) and a constant companion (of developers).\n\nI'll focus on strategies, tools and practical tips that I've used over the course of the past couple of years to ensure that your products remain discoverable, understandable, and effectively utilized in the AI age.\n\nI'll focus on the following key areas:\n1. Discoverability: Cut the noise, get to the point - Practical strategies to make tools and documentation findable among all the AI noise.\n2. Content optimization: Consumable by AI, understandable by devs - Your docs have to be accurately interpretable by AI as well as easily comprehensible by humans. Here's how you do that.\n3. AI sweet spots: Leave it to AI (if it does it well) - Opportunities for you to let AI do its thing.\n4. AI limitations: AI isn't magic. What now? - Handling the gaps created when AI struggles\n\nMy talk will deliver actionable insights for DevRel professionals, technical writers and product teams who want to ensure that their docs remain effective - even in the age of AI","type":"talk","category":"devrel","level":"Intermediate","reason":"In my career of 3 years as a DevRel professional, documentation has been one of my core areas of expertise!\n\nI've worked at 3 startups so far and have crafted documentation for two of them - once as a contributor and once as the project leader.\n\nThe documentation I've created has been read by hundreds of thousands of technocrats, not to mention the AI agents who have been trained on these resources to deliver contextual results to user queries.\n\nIn my unique experience in both the pre-AI documentation era and the current transition phase, gives me firsthand insight into this transformation, and how to make the most of it.\n\nI've witnessed how developer journeys have evolved from manual searching through docs to AI-assisted knowledge acquisition and armed with this knowledge, I've created docs that have been praised by our customers, our CTO, various engineering teams and our sales teams (Pro tip: Good docs make the lives of sales team easier).\n\nI've also previously collaborated with the minds behind some popular AI agent teams to understand how content is processed, indexed and served, giving me practical knowledge of what works and what's fluff.\n\nThis blend of practical experiences at the intersection of documentation and AI, gives me a unique vantage point to guide my fellow DevRel professionals through this pivotal transition, helping them navigate and harness the transformative potential of AI-enhanced documentation!","coc":true,"record":true,"no_support":true,"user":"e4pzCffXit","lang":"en","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-31T16:41:00.083Z","updatedAt":"2025-05-26T11:20:56.235Z","is_enabled":true,"rating":4.166666666666667,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","first_event":"No","co_speaker":"","deadline":"2025-05-31T07:25:25.055Z","key":"null","responseStatus":true,"slug":"sumit","name":"Sumit Saurabh","x_account":"","organization":"Lingo.dev","speaker_url":"https://devrelkaigi.org/en/speakers/sumit","interview_youtube":""},{"objectId":"OiYUoXsOc9","title":"Community Guide 2.0 - How communities are redefining DevRel and beyond.","summary":"This talk explores the 'why' and 'how' of developer communities and why they are crucial for DevRel success. From dealing with the challenges that comes with managing the communities to bridging the gap between companies and developers through DevRel, a community builder often has to wear multiple hats, juggling between planning, execution and management in-between.\n\nWe will talk about the micro-details that culminate to form a bigger picture of community and some actionable strategies to cultivate inclusive, engaged, and diverse communities. By the end, the attendees will get key takeaways, along with the tools and confidence to build, or rebuild a community that thrives—not just survives. ","description":"Written from the lens of a community builder who has build and scaled some of the India's top tech communities, I've been a part of many coveted Tech programs that deal with student communities through DevRel with companies like The Hack Club, GitHub, Google and Microsoft. \n\nThis is a beginner friendly talk that will cover -\n\n• Why communities play an integral role in DevRel?\n\n• How to build a Inclusive and Diverse community.\n\n• Building a community from scratch and leading it.\n\n• Impact of communities on DevRel and Business success.\n\n• Accessibility and why it isn't just a buzzword.\n\n• The roadmap to become a community manager in DevRel \n\nKey takeaways from this talk -\n\n• How to build a community from scratch and scaling it further.\n\n• The shared interests and pain points of a community that defines its goals.\n\n• Challenges that arise while managing a community and how to deal with it\n\n• How to find resources to help your community.\n\n• How you define your community is how it defines you.\n\n• How to build trust and reliability in the community.\n\n• How to make your community a safe space for everyone.\n\n• Code of conduct and why it's necessary.\n\n• Are you a community Ninja? - Career options as a DevRel advocate and Community Manager.\n\n• Testimonials of some community builders and how communities shaped their life and careers.\n\nSo, whether you're a seasoned community builder or just starting out, this talk will give you a perspective of redefining communities through DevRel and some actionable tips to turn your community into a inclusive space for harbouring growth, creativity and innovation.","type":"talk","category":"community","level":"All","reason":"I'm a community builder with 4+ years of experience in community management and I've build and scaled some of the India's top tech communities, I've been a part of many coveted Tech programs that deal with student communities through DevRel with companies like The Hack Club, GitHub, Google and Microsoft. I aim to make technology more accessible for under-represented communities and working towards building diverse and inclusive communities.","coc":true,"record":true,"no_support":true,"user":"5wc6otH8XJ","lang":"en","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-31T20:30:55.997Z","updatedAt":"2025-08-01T13:23:46.949Z","is_enabled":true,"rating":3.8,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-05-31T07:46:48.121Z","key":"null","responseStatus":"","slug":"saloniankita","name":"","x_account":"saloniankita_","organization":"","speaker_url":"https://devrelkaigi.org/en/speakers/saloniankita","interview_youtube":""},{"objectId":"REE54xpbN2","title":"コミュニティ初心者になって飛び込んでみたWeb3 DAOの世界","summary":"製品ベンダーのコミュニティ運営担当を辞め、一参加者として飛び込んだのは、「クラフトビール」のコミュニティ。ITとは関係ないと思いきや、その名も「Crypto Beer Punks」でWeb3のDAOを目指して運営されている。コミュニティ運営も10年くらいやって来ているけど、この分野は全くの初心者。DAO（分散自立型組織）がこれからのコミュニティ運営としてどうなっていくのか、自ら飛び込んでいった体験記を語ります。","description":"製品ベンダーのコミュニティ運営担当として「濃い参加者がなかなか増えない」とか「自走化しない」というのが悩みでした。そんな悩みが解決しないまま、縁あってIT製品ベンダーから離れ、別業界へ。\n\nプライベートで一参加者として飛び込んだのは、「クラフトビール」のコミュニティ。ITとは関係ないと思いきや、その名も「Crypto Beer Punks」でWeb3のDAOを目指して運営されている。コミュニティ運営も10年くらいやって来ているけど、この分野は全くの初心者。このDAO（分散自立型組織）というのがかつて抱えていたコミュニティの悩みの解決に繋がるのでは？と思い、NFTとか買ったことなかったけど、無謀にも運営にも飛び込んでみた。Decentralizedとか、Autonomousとか、これからのコミュニティ運営としてどう効果的な手法になっていくのか、自ら飛び込んでいった体験記を語ります。","type":"talk","category":"community","level":"Intermediate","reason":"製品ベンダーのコミュニティ運営担当としてWeb 2.0的なコミュニティ運営を10年近くやって来て、新たに転職した先はWeb3のテクノロジーをベースとする会社。そして、プライベートでもWeb3ベースのコミュニティ運営を「初心者」として参加。この初心者としての経験が新しい気付きを提供できるので。","coc":true,"record":true,"no_support":true,"user":"XPTDWeIGI9","lang":"ja","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-31T23:59:15.874Z","updatedAt":"2025-05-24T07:47:27.633Z","is_enabled":true,"rating":3.1666666666666665,"review":true,"ACL":"{\"XPTDWeIGI9\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:admin\":{\"read\":true,\"write\":true}}","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"wataru","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/wataru","interview_youtube":""},{"objectId":"FOsAEMOcCa","title":"Community Guide 2.0 - How communities are redefining DevRel and beyond.","summary":"This talk explores the 'why' and 'how' of developer communities and why they are crucial for DevRel success. From dealing with the challenges that comes with managing the communities to bridging the gap between companies and developers through DevRel, a community builder often has to wear multiple hats, juggling between planning, execution and management in-between.\nWe will talk about the micro-details that culminate to form a bigger picture of community and some actionable strategies to cultivate inclusive, engaged, and diverse communities. By the end of the talk, the attendees will get key takeaways, along with the tools and confidence to build, or rebuild a community that thrives—not just survives. ","description":"Written from the lens of a community builder who has build and scaled some of the India's top tech communities, I've been a part of many coveted Tech programs that deal with student communities through DevRel with companies like The Hack Club, GitHub, Google and Microsoft. \n\nThis is a beginner friendly talk that will cover -\n• Why communities play an integral role in DevRel?\n• How to build a Inclusive and Diverse community.\n• Building a community from scratch and leading it.\n• Bridging the gap between companies and communities.\n• Impact of communities in DevRel and buisness success.\n• Accessibility and why it isn't just a buzzword.\n• The roadmap to become a community manager in DevRel.\n\nKey takeaways from this talk -\n• How to build a community from scratch and scaling it further.\n• The shared interests and pain points of a community that defines its goals.\n• Challenges that arise while managing a community and how to deal with it.\n• How to find resources to help your community.\n• How you define your community is how it defines you.\n• How to build trust and reliability in the community.\n• How to make your community a safe space for everyone.\n• Code of conduct and why it's necessary.\n• Are you a community Ninja? - Career options as a DevRel advocate and Community Manager.\n• Testimonials of some community builders and how communities shaped their life and careers.\n\nSo, whether you're a seasoned community builder or just starting out, this talk will give you a perspective of redefining communities through DevRel and some actionable tips to turn your community into a inclusive space for harbouring growth, creativity and innovation.","type":"talk","category":"community","level":"All","reason":"I have been a part of community based student partner programs of multiple tech giants including Microsoft, GitHub, Google, The Hack Club and a few others. I have 4+ years of experience building and managing communities, and I've mentored more than 10k+ students and professionals so far, be it through hackathons, workshops, webinars or hands-on sessions. I've managed and scaled some of the most popular tech communities in India and I'm constantly working towards building inclusive and diverse communities. I've also worked with some NGOs in my city that work for the upliftment and empowerment of under-represented communities, with an aim to make technology more accessible for them. With a diverse experience in building and scaling multiple tech and non-tech communities, I am willing to share my journey and learnings as a community builder with other members of the DevRel ecosystem through this session and I feel that it could be useful for people who are willing to step into community building and management as DevRel enthusiasts.","coc":true,"record":true,"no_support":true,"user":"5wc6otH8XJ","lang":"en","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-31T20:26:11.800Z","updatedAt":"2025-05-24T07:40:11.743Z","is_enabled":true,"rating":4.166666666666667,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-05-31T07:26:24.211Z","key":"null","responseStatus":true,"slug":"saloniankita","name":"Ankita Saloni","x_account":"saloniankita_","organization":"Chegg","speaker_url":"https://devrelkaigi.org/en/speakers/saloniankita","interview_youtube":"https://youtu.be/GjemcLYTaV0"},{"objectId":"lOCv4s0yOU","title":"Future Skills for the Developer: navigating the shift to agentic devops","summary":"In this session, we will explore the evolving role of developers as they transition from traditional coding to creators of intelligent systems. Where rapid application development, managing agentic DevOps and AI agents makes the developer a strategic partner to the business. The focus will be on the skills required for this transformation, the benefits of adopting agentic DevOps practices, and real-world examples of how these changes are impacting developer productivity and career growth. Attendees will gain insights into the  evolving future of software development and learn how to stay ahead in a rapidly changing technological landscape.","description":"As the software development landscape evolves, developers are increasingly shifting from building code to managing sophisticated AI agents and agentic DevOps practices, and what this entails.  This session delves into the skills and knowledge required for this transformation, highlighting the benefits of adopting agentic DevOps. We will discuss how AI-powered agents can automate and optimise every stage of the software lifecycle, allowing developers to focus on high-impact work and innovation.\nThrough real-world examples and case studies, including insights from successful implementation of agentic DevOps, attendees will learn how to navigate this shift and enhance their careers. The session will cover the integration of AI agents in development workflows, the impact on productivity, and the future skills developers need to thrive in this new environment. Join us to discover how to transform your career and embrace the future of software development.\n","type":"talk","category":"education","level":"All","reason":"I have worked in the developer ecosystem for 2 decades and currently manage the business of developer productivity at Microsoft Asia including Japan.","coc":true,"record":true,"no_support":true,"user":"8CaGF1JLYJ","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-24T04:05:32.872Z","updatedAt":"2025-06-17T02:42:37.079Z","is_enabled":true,"rating":2.25,"review":true,"ACL":"{\"8CaGF1JLYJ\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"No","co_speaker":true,"deadline":"","key":"","responseStatus":"","slug":"annie","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/annie","interview_youtube":""},{"objectId":"yxH2MLGs8m","title":"Beyond Hello World: Designing DevRel for Real-World Impact","summary":"Many DevRel programs succeed at capturing attention—but struggle to deliver long-term value. In this talk, we’ll explore how to evolve DevRel from surface-level engagement to impactful developer experiences that drive real adoption, feedback, and community-led momentum.","description":"Too often, developer relations efforts stop at “Hello World”—introductory tutorials, launch blogs, and slick demos. While these are important entry points, they don’t guarantee lasting engagement or meaningful product adoption. So how do we move beyond the basics and design DevRel strategies that actually create impact?\n\nIn this talk, I’ll share practical frameworks and real-world stories on how to take developers from casual users to power contributors. From building feedback loops that influence product decisions, to running campaigns that spark sustained community involvement, we’ll walk through what it takes to build DevRel that’s not just visible—but valuable.\n\nWe’ll also explore the less glamorous but essential elements: internal advocacy, cross-functional alignment, and measuring the right outcomes. Whether you're part of a growing startup or a global org, this talk will equip you with strategies to create a DevRel flywheel that scales beyond swag and surface metrics—and starts delivering long-term developer success.","type":"talk","category":"devrel","level":"beginner","reason":"I’ve spent over a decade building and scaling developer communities—from student ecosystems to global developer programs across APAC. In my current role, I lead Developer Relations for a graph database company where I’ve transformed DevRel from a support function into a growth engine. I’ve designed and executed initiatives that go beyond surface-level engagement—like content-driven campaigns, community contests, technical workshops, and field marketing partnerships that have generated thousands of opt-in leads and real product feedback.\n\nHaving spoken at global conferences like DevRelCon Bengaluru, The Fifth Elephant, and DataHack Summit, I bring both hands-on tactical knowledge and strategic clarity. My work spans diverse markets, so I understand how to drive real-world impact while adapting DevRel strategies to varied developer cultures and maturity levels. This session is rooted in real experiments, real wins—and real lessons learned.","coc":true,"record":true,"no_support":true,"user":"LIbhUIhC31","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-04-01T08:58:08.431Z","updatedAt":"2025-05-24T12:37:35.729Z","is_enabled":true,"rating":4.166666666666667,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"read\":true,\"write\":true},\"role:admin\":{\"read\":true,\"write\":true}}","first_event":"Not the same but was Keynote Speaker at DevRelCon Bengaluru - https://blr24.devrelcon.dev/speaker/siddhant-agarwal/","co_speaker":"","deadline":"2025-05-31T07:27:54.405Z","key":"","responseStatus":true,"slug":"sidagarwal04","name":"Siddhant Agarwal","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/speakers/sidagarwal04","interview_youtube":"https://youtu.be/xG3-b-v176Q"},{"objectId":"jsraBiDheG","title":"Building API Experiences Your Developers Love","summary":"Developer Relations field is not like a software engineering where everything is pretty standard and consistent. DevRel has to be tailored for each type of technology. My session will focus on API Developer Relations and how to do it well. ","description":"I have been in the API Developer Relations space since 2021. It's one of the most toughest Developer Relations field to manage. If you are a new React framework company, your DevRel efforts might be minial as everyone in the tech is general excited about the new frameworks or front-end technology. But API Developer Relations is hard to manage as API is the most boring technology. In this session, I want to present what are the some offerings along with the documentation that can help providing a standout API DX. This includes sandboxing, SDKs, Playground, clearer error messages, and beyond.\n\nI test a lot of API products so I want to show different API companies and how they are excelling in API DX space. Trust me, I am not going to be focused on my company for free promotion. I want this talk to be 100% organic and open.","type":"talk","category":"devrel","level":"Intermediate","reason":"Because ever since I started working professionally, I have been around APIs. ","coc":true,"record":true,"no_support":true,"user":"NyiE99KvnI","lang":"en","status":"Sent","cfp":"FVkLmDT7az","createdAt":"2025-06-17T13:56:46.976Z","updatedAt":"2025-07-14T11:26:49.113Z","is_enabled":true,"rating":4.166666666666667,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-07-21T01:42:14.373Z","key":"null","responseStatus":true,"slug":"pratham","name":"Pratham Kumar","x_account":"prathkum","organization":"APILayer","speaker_url":"https://devrelkaigi.org/en/speakers/pratham","interview_youtube":"https://youtu.be/z-E5CVM5GZA"},{"objectId":"0GlJlAPMaL","title":"Scaling DevRel with AI: Smarter Workflows Using n8n & Open-Source Tools","summary":"As DevRel scales, so does the workload. In this session, we’ll dive into practical ways AI and automation can help—from handling community queries with AI chatbots to automating personalized responses for developer outreach. See how open-source solutions like n8n can supercharge your DevRel strategy.","description":"Developer Relations is a dynamic field that requires managing content, engaging with communities, and providing support—all at scale. But as DevRel teams grow, so does the workload. How can we work smarter, not harder?  \n\nIn this session, we’ll explore how AI-powered automation can help DevRel professionals enhance their workflows using **n8n** and other open-source tools. You’ll learn how to:  \n\n- Automate community engagement with AI-driven responses  \n- Generate and repurpose content across platforms effortlessly  \n- Manage developer support with intelligent workflows  \n- Integrate AI tools seamlessly into your existing DevRel strategy  \n\nWhether you're a solo advocate or part of a growing DevRel team, this talk will equip you with practical automation techniques to **scale your impact without scaling your workload**. ","type":"talk","category":"devrel","level":"Intermediate","reason":"I'm actively using automation, AI, and n8n to improve my DevRel work, from managing community engagement to automating content distribution and support tasks. I’ve built real-world workflows that help scale interactions and reduce repetitive work using open-source tools.\n\nFor Elestio I run a weekly open-source platform overview on YouTube, where I introduce new technologies to developers. Made it grow into 19,000 subscribers, giving me experience in explaining technical topics in an engaging and practical way.\n\nWith my hands-on experience, I can show DevRel professionals how to use AI and automation to save time, boost efficiency, and focus on what really matters—engaging with developers.","coc":true,"record":true,"no_support":true,"user":"a0dkE7vaBu","lang":"en","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-24T11:08:24.289Z","updatedAt":"2025-05-26T07:31:23.764Z","is_enabled":true,"rating":4,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-05-31T07:46:46.261Z","key":"null","responseStatus":true,"slug":"wawa-sensei","name":"Wassim SAMAD","x_account":"wawasensei","organization":"Elestio","speaker_url":"https://devrelkaigi.org/en/speakers/wawa-sensei","interview_youtube":"https://youtu.be/mqVRg5CwBwk"},{"objectId":"LS2kqNKs5J","title":"ゼロから始めるOSSプロダクト――国産ノーコード開発ツール『プリザンター』の共創と拡張","summary":"国産OSSのノーコード開発ツール「プリザンター」は、ゼロから開発を始め、企業とのパートナーシップやユーザコミュニティの力によって事業化に成功しました。本セッションでは、OSSとしての展開、DevRelによる共創の形、そして今後の海外展開に向けたチャレンジを紹介します。","description":"OSSとして公開された国産ノーコード・ローコード開発ツール「プリザンター」は、当初は一人の開発者の手によって始まりました。多くの国産OSSが趣味や副業レベルにとどまるなかで、プリザンターは事業化に成功し、現在では120社を超える企業とのパートナー契約を持つ商用サービスへと成長しています。\n\n本セッションでは、OSSプロダクトを立ち上げてマネタイズを実現するまでの道のり、コミュニティの支援を得るための工夫、そしてユーザがファンとなって開発チームに加わるというDevRelの理想的な形について紹介します。\n\nまた、プリザンターの特徴である「ノーコード・ローコード」による開発体験が、ユーザの拡張性やコミュニティ貢献をどのように後押ししたのかにも触れ、プロダクトを通じたエンジニアとユーザの共創の可能性を共有します。\n\n今後は、多言語化対応や海外ユーザへの普及も見据えており、DevRelの視点からグローバル展開に向けた戦略や課題についてもあわせてお話しします。","type":"talk","category":"business","level":"beginner","reason":"私は、一人の開発者として国産OSS「プリザンター」を立ち上げ、少しずつ仲間やユーザの共感を得ながら、ここまで育ててきました。開発・公開・普及・マネタイズといった一連の経験を通じて、DevRelの重要性を実感しています。同じように何かを広げようとしている方の参考になればと思い、この場でお話しさせていただきます。","coc":true,"record":true,"no_support":true,"user":"mVxEUaSX3W","lang":"ja","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-26T00:34:02.083Z","updatedAt":"2025-07-03T06:53:09.857Z","is_enabled":true,"rating":4,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-06-24T02:31:57.043Z","key":"null","responseStatus":true,"slug":"t-uchida","name":"Taiji Uchida","x_account":"implem_","organization":"Implem Inc.","speaker_url":"https://devrelkaigi.org/ja/speakers/t-uchida","interview_youtube":"https://youtu.be/ENsPhu35aUU"},{"objectId":"vQkdjF8IBC","title":"Agentic DevOps: The Next Evolution of Developer Experience","summary":"DevOps is evolving and AI agents are leading the charge. This talk explores how Agentic DevOps is transforming traditional pipelines into intelligent, adaptive systems. We’ll look at how AI agents can autonomously manage CI/CD workflows, triage incidents, and even collaborate with developers. Whether you're a DevRel pro or a platform engineer, you'll walk away with a fresh perspective on how to build, deploy, and advocate in a world where your next teammate might be an AI.","description":"The DevOps landscape is shifting. As AI agents become more capable, we're entering a new era: Agentic DevOps. In this talk, we’ll explore what happens when autonomous AI agents are embedded into the software delivery lifecycle not just as tools, but as collaborators.\n\nWe’ll begin by defining what \"agentic\" means in the context of DevOps: agents that can reason, act, and adapt based on goals, feedback, and context. From there, we’ll dive into real-world scenarios where AI agents are already making an impact like automating release gates, managing incident response, and even generating documentation or test cases on the fly.\n\nBut, this isn’t just about automation, it’s about collaboration. We’ll explore how these agents can be designed to work alongside developers, SREs, and DevRel teams learning from interactions, adapting to team norms, and even advocating for best practices.\n\nYou’ll leave with:\n\n* A clear understanding of Agentic DevOps and how it differs from traditional automation.\n* Practical examples of how AI agents can be integrated into your workflows.\n* Insights into the cultural and ethical considerations of working with autonomous systems.\n\nWhether you're building platforms, supporting developers, or shaping community experiences, this talk will help you prepare for a future where your DevOps teammate might not be human, but will definitely be helpful.","type":"talk","category":"education","level":"Intermediate","reason":"As part of my role, I help provide assistance and guide companies adopting and improving their development processes, and the next big topic in the area is Agentic DevOps that my company is at the forefront of technology.","coc":true,"record":true,"no_support":true,"user":"D9oG8IfBjp","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-27T00:50:09.678Z","updatedAt":"2025-06-17T02:42:23.680Z","is_enabled":true,"rating":3.25,"review":true,"ACL":"{\"D9oG8IfBjp\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"No","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"lescoggi","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/lescoggi","interview_youtube":""},{"objectId":"nRGDlHhHsO","title":"Badge by Badge: A Journey to Developer Education That Scales","summary":"Discover how bite-sized \"skill badge\" programs—designed to be completed in 60 minutes or less—can transform developer education. In this session, we’ll explore how this initiative has standardized enablement processes, elevated developer experience, bolstered brand identity, and strengthened community engagement across our organization. Dive into the design process, learn how we overcame scaling challenges, and see how aligning internal teams with external audiences delivers measurable outcomes. Join us for actionable insights on creating impactful education programs that drive global learning and lasting results.","description":"How do you design developer education programs that drive meaningful outcomes—not just for learners, but for your entire organization? In this session, we’ll walk through how we developed a skill badge program: bite-sized, focused learning experiences designed to be completed in 60 minutes or less. Discover how this initiative reshaped our approach to developer enablement and elevated our brand, our team, and our community.\n\nFrom technical support and customer success to sales, marketing, and developer relations champions, this program has standardized how we empower learners while strengthening our organization’s developer experience, brand identity, and community connections. Together, we’ll unpack the design process, navigate the challenges of scaling educational programs, and examine how aligning internal teams with external audiences can deliver measurable results for developer relations efforts.\n\nLooking for actionable strategies to build learning tools that enhance developer experience, extend your brand, and inspire learners worldwide? Join us as we explore how focusing on small, achievable \"60-minute learning moments\" creates lasting change for developer education—step by step.","type":"talk","category":"education","level":"All","reason":"I implemented this skill badge program and have extensive experience running developer relations initiatives, including public speaking, technical writing, community-building, and team leadership. My firsthand knowledge enables me to share practical insights and actionable strategies to help others create impactful education programs.","coc":true,"record":true,"no_support":true,"user":"NmhfVWqyVG","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-27T14:20:02.908Z","updatedAt":"2025-06-17T02:32:06.868Z","is_enabled":true,"rating":3.75,"review":true,"ACL":"{\"NmhfVWqyVG\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"I spoke at DevRelCon Yokohama 2023: https://www.youtube.com/watch?v=N8LkCj6Ws5k","co_speaker":"","deadline":"2025-06-24T02:32:06.867Z","key":"0c51boeqacg","responseStatus":"","slug":"joellord","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/joellord","interview_youtube":""},{"objectId":"B5BFGjBT5n","title":"Managing Hybrid Communities: Balancing Local & Global Engagement","summary":"Building hybrid communities—blending local meetups with global online engagement—is a key challenge in Developer Relations. Drawing from my work at Freshworks, BrowserStack, and Kong, I’ll share strategies to support local leaders, scale programs globally, and measure success. Real examples and takeaways will help you build a thriving, connected hybrid community.\n\n","description":"Building and managing a hybrid community—where some members meet in person while others engage online—is a big challenge in Developer Relations. The key is to ensure that both groups feel equally valued and connected.\nAt Freshworks, BrowserStack, and now Kong, I have worked on growing communities that are active both locally and globally. Through these experiences, I’ve learned:\nHow to support local community leaders while keeping a global approach.\nThe best mix of in-person events and online activities to keep engagement high.\nWays to scale community programs across different regions without losing authenticity.\nHow to measure success and keep improving the hybrid model.\nI’ll share real examples, including:\nBrowserStack's Testing Community – Running meetups while keeping a strong online presence.\nKong’s Global Community Strategy – Expanding local meetups in APAC while staying connected to the global developer network.\nFreshworks Developer Community – Engaging local developer advocates while ensuring a unified global experience.\n\nHow to support local communities while keeping them connected globally.\nThe right balance between in-person and online engagement.\nHow to measure and improve hybrid community strategies over time.","type":"talk","category":"community","level":"All","reason":"That’s a tough one to answer, so I’ll let you be the judge of that! But here’s why I want to to deliver this talk: I’ve had the unique opportunity to work in Developer Relations roles across three very different companies—Developer Plus (Freshworks), a Developer-first B2B company (BrowserStack), and an open-source developer first with a B2B offering (Kong).\nIn these roles, I’ve been  involved in supporting and enabling developers to use our platforms effectively. But my work didn’t stop there—I also collaborated closely with various stakeholders to demonstrate how DevRel contributes to business success. Whether it was helping beginners get started by attracting enterprise end users. bringing valuable user feedback to the product team, or tracking community activities at the account level to guide business decisions, I’ve seen and experienced how DevRel can build stronger relationships with developers and drive business growth.\nI want to share these experiences and insights with others in the hope that they can apply them to their own work and see the real impact that DevRel can have on a company’s success.\n","coc":true,"record":true,"no_support":true,"user":"LTw6TCG6Fl","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-31T05:27:13.967Z","updatedAt":"2025-07-03T06:52:38.597Z","is_enabled":true,"rating":4,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"No","co_speaker":"","deadline":"2025-07-07T12:20:39.622Z","key":"null","responseStatus":true,"slug":"juhi","name":"Juhi Singh","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/speakers/juhi","interview_youtube":"https://youtu.be/ralIIzNeSQs"},{"objectId":"iMR7CbUFui","title":"アウトプットを気軽に日常にしたい！ 社内勉強会の機会を増やし、登壇のハードルを下げる運用への転換。","summary":"・他チーム・社員同士の繋がり強化により、組織力UP\n・オープンフラットなアウトプットの場づくり\n・みんなで学ぶ文化づくり\nこれらを目標に、半年に1度の社内勉強会の運用を大きく転換しました。これまで開催してきた勉強会は、一度に開催するため時間も空気も「長い・重い・一方通行」。そんな一世一代のウォーターフォール型勉強会を、ライトなアジャイル型イベントへの転換を試みました。","description":"1．元々の社内勉強会の実態\n　1）長い：半期に一回なので、半日くらいかけて開催\n　2）重い：時間は固定で、「選ばれし者」感が強く、準備も発表時の空気もとても厳粛な感じ。\n　3）一方通行：QAがほとんど出ず、一方通行の発表。\n2．実現したいと思った理想の状態\n　1）他チーム・社員同士の繋がり強化により、組織力UP\n　2）オープンフラットなアウトプットの場づくり\n　3）みんなで学ぶ文化づくり\n3．実際にやってみたこと\n4．やる前の懸念点と、やってみた結果\n5．更に実現したい組織像・カルチャー","type":"talk","category":"devrel","level":"beginner","reason":"2023年3月まで、チームでの開発業務に携わってきた私は、プロジェクトを推進する上で様々な障壁を経験してきました。技術的課題、案件特有の障壁、事務手続きによる問題など、色々です。\nTOPPANは、母体が大きく、開発部門だけをとっても非常にたくさん存在します。横を向けば、同じような課題にぶつかっているチームがあり、反対側を向けば、解決方法を導き出し、乗り越えているチームもあることに、当時は気づくことができませんでした。\n\n社内においては、2023年4月よりDevRel分野を活動の主軸とし、開発の経験をしてきた私だからこそ実行に移すことができたテーマであり、\nスタートアップ企業や、ベンチャー企業のようなスピード感やフレキシブルさに乏しい大企業ならではの、理想と現実のギャップを語ることができます。","coc":true,"record":true,"no_support":true,"user":"jzzOnTS1gP","lang":"ja","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-30T12:08:56.127Z","updatedAt":"2025-06-17T02:42:26.419Z","is_enabled":true,"rating":3.25,"review":true,"ACL":"{\"jzzOnTS1gP\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"紗代子","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/紗代子","interview_youtube":""},{"objectId":"nCUVs27nsb","title":"Beyond Documentation: Creating Immersive Learning Journeys for Developer Success","summary":"Despite a thriving Kubernetes ecosystem, one challenge continues to undermine developer onboarding and proficiency: static documentation doesn’t teach context. Most developers don’t fail because they can’t read docs they fail because docs don’t match how people actually learn. \n\nSo how do we fix this?\n\nDrawing from our experience building and curating learning platforms within the CNCF community, we’ll explore how cognitive flow design, audience-journey mapping, and metrics-driven sandboxing can dramatically accelerate learning. We’ll walk through real-world patterns like “Kubernetes escape rooms,” failure-forward environments, and scaffolded labs that have improved time-to-proficiency by up to 40%—all while reinforcing better security practices and increasing adoption rates.\n\nAttendees will leave with blueprints to build playful, progressive, and purpose-built learning experiences in their own ecosystems whether for internal teams, open source contributors, or external customers.\n\nThis talk isn’t about docs. It’s about changing the way we teach, learn, and thrive our developers in our ecosystem with immersive education. ","description":"Static documentation isn’t broken, but it’s not enough. Developers don’t struggle because they can’t read docs; they struggle because docs don’t reflect how people actually learn.\n\nThis session is for DevRel professionals ready to rethink developer education through immersive, context-rich experiences. Drawing from real-world experience building learning environments in the CNCF community, we’ll explore how techniques like cognitive flow design, audience-journey mapping, and sandbox-based training can significantly improve how developers onboard, explore, and master complex technologies.\n\nWe’ll share patterns that go far beyond traditional tutorials: Kubernetes escape rooms, failure-forward labs, and scaffolded hands-on environments that have improved time to proficiency by up to 40 percent. These methods also help reinforce secure development practices and increase certification success. The result is learning that feels like play, builds confidence, and drives real adoption.\n\nThis talk is more than a case study. It offers a vision for how DevRel teams can lead the shift from passive documentation to active, measurable education. Attendees will learn how to design for developer flow, map learning journeys, and track outcomes that matter.\n\nYou’ll leave with practical blueprints and examples to make developer education more engaging, effective, and accessible so your docs don’t just explain, they truly teach.","type":"talk","category":"education","level":"All","reason":"As a CNCF Ambassador with a strong focus on developer education, I’ve spent the past few years designing and delivering highly rated technical workshops at conferences like NDC Oslo, AWS Community Days Singapore, and others (see [Sessionize](https://sessionize.com/hrittikhere)). These sessions consistently receive positive feedback for being practical, hands-on, and thoughtfully structured.\n\nBeyond conferences, I’ve led workshops tailored to both the community and enterprise customers, working closely with solution engineering teams. This dual perspective has helped me understand what resonates with open source contributors versus what drives adoption and confidence in customer settings.\n\nThrough my ongoing mentorship and contributions in the CNCF ecosystem (see [Credly](https://credly.com/users/hrittikhere)), I’ve helped developers go from feeling overwhelmed to certification-ready by focusing on what truly works in real learning environments.\n\nI also write regularly to refine and share my approach to structuring educational content (see [GitHub blogs](https://github.com/hrittikhere/blogs)). These writings are not just tutorials—they’re frameworks to help others teach better and learn faster.\n\nThis session draws directly from these experiences and lessons. I’ve seen firsthand how immersive, play-driven, and cognitively aligned education makes a measurable difference and I’m passionate about helping others bring that transformation to their own developer communities with targeted education. ","coc":true,"record":true,"no_support":true,"user":"Hml6XJCdZH","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-31T10:15:08.586Z","updatedAt":"2025-06-17T04:29:17.214Z","is_enabled":true,"rating":4,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","first_event":"n/a","co_speaker":true,"deadline":"2025-06-24T02:32:00.918Z","key":"null","responseStatus":true,"slug":"hrittikhere","name":"Hrittik Roy","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/speakers/hrittikhere","interview_youtube":""},{"objectId":"KtMVXG9EC9","title":"Making DevRel Real Again","summary":"In today's tech world, DevRel often feels mixed up with other roles like marketing, product, support, and solutions engineering. I might start my day writing a marketing blog and end it fixing a customer's problem. All day long I'm trying to show why DevRel is different and important. That made me ask myself: do we even need DevRel as a separate thing? For example, one afternoon I might be planning new product features with product managers, and by the evening I'm running a workshop for developers. I saw how much DevRel duties were overlapping with other roles. In that moment, I realized DevRel’s clear purpose was fading away. It felt like DevRel had lost its clear identity.\n","description":"This talk is an honest look at my journey in DevRel. I'll share personal stories about how focusing only on numbers and trying to prove our value can make DevRel feel like part of other teams. That can push our real purpose aside. We'll talk about DevRel's true mission helping and supporting developer communities and compare that with how companies measure our impact. I'll share mistakes I made and what I learned from them, and I'll explain why getting back to DevRel's true mission is more important now than ever. \n\nWhether you're new to DevRel, an experienced pro, or leading a team, this session will get you thinking. We'll have a real conversation about how to make DevRel truly needed again. Think of it as an invitation to take back the parts of DevRel that only we can bring.\n\nKey Takeaways\nWhat DevRel is really about and how it's different from marketing, product, or support teams\nHow DevRel duties can overlap with other teams and why that can blur our impact\nQuestions to help everyone, from newbies to leaders, think and talk honestly about DevRel\nTips on focusing DevRel work on real community needs and helping developers, instead of copying other teams or chasing pointless metrics\n","type":"talk","category":"experience","level":"All","reason":"That’s a tough one to answer, so I’ll let you be the judge of that! But here’s why I want to to deliver this talk: I’ve had the unique opportunity to work in Developer Relations roles across three very different companies—Developer Plus (Freshworks), a Developer-first B2B company (BrowserStack), and an open-source developer first with a B2B offering (Kong).\nIn these roles, I’ve been  involved in supporting and enabling developers to use our platforms effectively. But my work didn’t stop there—I also collaborated closely with various stakeholders to demonstrate how DevRel contributes to business success. Whether it was helping beginners get started by attracting enterprise end users. bringing valuable user feedback to the product team, or tracking community activities at the account level to guide business decisions, I’ve seen and experienced how DevRel can build stronger relationships with developers and drive business growth.\nI want to share these experiences and insights with others in the hope that they can apply them to their own work and see the real impact that DevRel can have on a company’s success.\n","coc":true,"record":true,"no_support":true,"user":"LTw6TCG6Fl","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-31T05:24:56.836Z","updatedAt":"2025-06-17T02:42:29.498Z","is_enabled":true,"rating":3,"review":true,"ACL":"{\"LTw6TCG6Fl\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"No","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"juhi","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/juhi","interview_youtube":""},{"objectId":"Uam5mCpqih","title":"Scaling Impact, Not Burnout: Building Sustainable DevRel Programs that Empower Communities","summary":"How do you grow a DevRel program without burning out your team or community? In this session, I’ll share real-world strategies for designing scalable, ambassador-led DevRel initiatives that are empowering, measurable, and sustainable across regions.","description":"As DevRel programs grow, many teams hit a wall—limited bandwidth, unclear KPIs, community fatigue, or internal misalignment. How can you design a DevRel strategy that scales with your community instead of on your community?\n\nIn this session, I’ll unpack:\n- How to design scalable ambassador and contributor programs\n- The systems and automations that support onboarding, engagement, and recognition\n- Aligning internal teams while keeping external community needs at the center\n- Practical frameworks for measuring success beyond vanity metrics\n- Real examples from managing Storyblok’s global ambassador program and DevRel campaigns\n\nI’ll share my learnings from building DevRel strategies for startups, open-source communities, and international programs—especially in APAC, India, and global ecosystems. Attendees will walk away with proven, repeatable frameworks they can immediately apply—whether they’re a solo DevRel or part of a growing team.","type":"talk","category":"devrel","level":"Intermediate","reason":"I’ve been deeply involved in building and scaling DevRel programs that prioritize sustainability, empowerment, and measurable community impact. As the Developer Community Specialist at Storyblok, I lead many ambassador programs across different companies, organize large-scale hackathons, and drive developer campaigns that scale with limited internal resources.\n\nI’ve spoken at multiple DevRelCon events, including DevRelCon Tokyo, DevRelCon Yokohama, DevRelCon Bangalore, DevRelCon Online, and various community-led DevRel meetups worldwide. These experiences have given me a cross-cultural and cross-functional perspective on what makes DevRel sustainable at scale. This talk distills those learnings into an actionable playbook.","coc":true,"record":true,"no_support":true,"user":"2Ih59qxbx1","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-31T18:04:57.439Z","updatedAt":"2025-06-19T10:42:49.080Z","is_enabled":true,"rating":4,"review":true,"ACL":"{\"2Ih59qxbx1\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"This is a brand-new talk created specifically for DevRelKaigi, though it draws from my experiences and learnings shared informally at events like DevRelCon Tokyo, Yokohama, Online, Bangalore, and other DevRel meetups.","co_speaker":"","deadline":"2025-06-24T02:32:04.151Z","key":"skogoiqmuko","responseStatus":true,"slug":"siddharth-dayalwal","name":"Siddharth Dayalwal","x_account":"siddharth_hacks/","organization":"Storyblok","speaker_url":"https://devrelkaigi.org/en/speakers/siddharth-dayalwal","interview_youtube":""},{"objectId":"PAUiFNTlj6","title":"なぜあの開発者はDevRelに伴走し続けるのか――5年超の兼務経験からひも解く求められる環境と資質","summary":"DevRelチームにとって、技術的な深さと信頼性を担保するため開発者との協力は不可欠です。\nしかし多くの場合、開発者の協力は一時的なものに留まり、継続的な関係を築くことが困難となっています。\n\n本セッションでは５年以上に渡って開発者としてDevRelを兼務してきた経験から、長期的にDevRelに関わり続けることができた要因について解説します。\nセッションでは大きく２つの事柄を取り扱います。\n\nひとつ目は組織が整備すべき環境面についてです。\nDevRelに協力する開発者に対してどのような支援が必要であったか、またどのような困難に直面するかについてをお話します。\n\nふたつ目は開発者自身の資質です。\n長期的な協力関係を築くためには、開発者自身の意識や取り組みも重要です。\nDevRelに関わる開発者に求められる資質やマインド、そしてスターになりうる開発者の要素についてお話します。\n\nDevRelチームと開発者との間に持続可能な協力関係を構築したい方、あるいは開発者の協力を得られてもすぐに関係が途切れてしまう、という課題を抱える方にとって、実践的な示唆を提供します。","description":"# DevRelKaigi\n\n- はじめに\n    - 略歴\n        - 5年超のDevRel兼務\n        - 具体的なロール\n    - セッション趣旨\n        - 開発者の協力の重要性\n        - 求められる環境と本人の資質\n- 環境\n    - 組織の理解\n    - 業務調整\n    - 評価\n- 資質\n    - マインド\n    - スターになりうる要素\n- まとめ\n\n# はじめに\n\n開発者としてのDevRel兼務経験と、それを通じて見えてきた課題について説明します。\nまた、本セッションで取り上げる「組織が整備すべき環境」と「求められる開発者の資質」という2つの重要な要素について概説します。\n\n# 環境\n\n開発者がDevRel活動を継続するために必要な環境要件について、実体験を基に解説します。\n組織の理解、業務時間の確保、評価制度など、5年以上の兼務を通じて重要だと実感した組織的なサポートについて説明します。\n\n# 資質\n\n私自身の経験や、周囲の開発者の例を基に、DevRel活動を長期的に続けられる開発者の特徴について掘り下げます。\n技術的な深さやマインドセットはもちろん、活動を継続するために必要な考え方や行動様式について、具体例を交えながら解説します\n\n# まとめ\n\n本セッションで取り上げた環境面と資質面の両方の要素を踏まえ、DevRelチームと開発者の持続可能な協力関係を構築するためのポイントを整理します。","type":"talk","category":"experience","level":"beginner","reason":"GMOインターネットグループのDevRelチーム立ち上げ時から参画し、5年以上に渡って開発者としての職務と両立しながらDevRel活動を継続してきました。\nその間、企業のDevRel戦略立案から実行まで幅広く関与し、特にカンファレンスにおけるプレゼンスの構築では中心的な役割を担ってきました。\n\n単なる登壇者としてだけでなく、コミュニティスタッフとしての活動や、カンファレンスの企画・運営まで手がけることで、DevRelの送り手と受け手の双方の視点を持っています。\nさらに、現役の開発者としての技術的な深さを保ちながら、これだけの期間DevRelに深く関わり続けている事例は極めて稀少です。\n\nこのような多面的な経験を通じて得られた知見は、開発者との継続的な協力関係を模索するDevRelチームにとって、実践的で具体的な示唆となるはずです。","coc":true,"record":true,"no_support":true,"user":"SQb19MCemo","lang":"ja","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-02-10T13:28:38.797Z","updatedAt":"2025-05-24T08:55:33.755Z","is_enabled":true,"rating":3.8333333333333335,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-05-31T07:24:13.258Z","key":"null","responseStatus":true,"slug":"msnb","name":"nrs","x_account":"nrslib","organization":"CoDMON, Inc.","speaker_url":"https://devrelkaigi.org/ja/speakers/msnb","interview_youtube":""},{"objectId":"3WkxkgYkD4","title":"東京育ちの移住者が地域支部を飛び回ってコミュニティ過疎県で地元コミュニティを立ち上げた話し","summary":"都会育ちの移住者がコミュニティに出会ってから、地域支部を飛び回って学び繋がりながら、コミュニティ過疎県の地元で、一念発起してコミュニティを立ち上げた話しとこれからについてお話しします。","description":"東京育ちで東京勤務している中で、東京から2時間の郊外に移住しました。そんな中、コミュニティとの出会いが日本全国の各地域との繋がりを作るきっかけになりました。そんな日本全国の地域を飛び回る中、地元での繋がれる世界を夢見るようになりました。一方、地元は東京に比べると100分の1の規模のITコミュニティしかない砂漠のような「コミュニティ過疎県」でした。「なければ自分で作る」しかありません。覚悟、仲間との奇跡的な出会い、立ち上げ、そして、運営して見えたリアルな課題をお話しし、みなさんと地域コミュニティの未来について考えたいと思います。(日本語での登壇を予定しています)","type":"talk","category":"community","level":"beginner","reason":"広い日本の中でも数少ないITコミュニティ過疎県で、勉強会を立ち上げ継続し、満員御礼の参加登録をいただき運営できているノウハウがあるから。","coc":true,"record":true,"no_support":true,"user":"imJxVDHEB7","lang":"ja","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-31T01:42:06.401Z","updatedAt":"2025-06-17T03:18:31.510Z","is_enabled":true,"rating":3.75,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-06-24T02:32:10.079Z","key":"null","responseStatus":true,"slug":"journeyman","name":"Journeyman","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/speakers/journeyman","interview_youtube":""},{"objectId":"C3zRd7gwCS","title":"エンタープライズエンジニアを変革する！マーケターが支えるDevRelの実践","summary":"新しい技術やトレンドを追い求めることは、エンジニアにとって必要不可欠です。また自社の技術力をアピールするために、エンジニアが情報発信することは効果的な方法です。そのためにエンジニアが情報収集や発信を自ら行なっていくのは、日常業務だけでは得られない刺激が必要だと考えます。\n本セッションでは、エンタープライズ企業のエンジニアがいかにして社外の情報を効果的にキャッチアップし、自ら情報発信を行ってもらうために、社内での啓蒙活動以外に効果的な施策とマーケターが支援できるDevRel活動を具体的に紹介します。エンジニアがイベントでの登壇や情報発信を積極的に行うための実践的なアプローチを学び、企業内のDevRel活動を次のレベルへと引き上げましょう。","description":"社内で長年エンジニアとして専門性を発揮してきたメンバーが、最新技術に積極的に触れることなく業務を続けている中で、レガシーシステムの脱却やクラウド・AIの活用を求められると、何から始めればよいか戸惑うことや必要性を感じないことがあります。こうした状況において、社内で変革を推進する従業員や外部からの中途入社者が担う役割は非常に重要です。\n本セッションでは、社内での啓蒙活動を社内だけに留めず、外部に向けて発信することで、外部から自分たちの活動を知ってもらい、社外との関心や交流を生み出す方法をご説明します。また、社内外から変革を促すマーケターの役割についても紹介します。","type":"talk","category":"marketing","level":"All","reason":"家具屋からエンジニアに転身し、その後マーケティング・広報に従事。前職では、クラウド利用をユーザーに推進するトレーニング部門拡大として業務を行なっておりましたが、社内社外を関わらず自社のサービスを知ってもらうために自らエンジニアとして再始動し、マーケティングに加えてAWSの資格取得や技術本の執筆などチームのブランディングを向上した経験を合わせてお話ししたいと考えております。","coc":true,"record":true,"no_support":true,"user":"U3xB07K3OA","lang":"ja","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-31T00:38:33.211Z","updatedAt":"2025-05-26T04:36:27.865Z","is_enabled":true,"rating":3.6666666666666665,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-05-31T07:06:48.042Z","key":"null","responseStatus":true,"slug":"tetsuya","name":"Tetsuya Nakamura","x_account":"S_O_F_Science","organization":"TOPPANデジタル株式会社","speaker_url":"https://devrelkaigi.org/ja/speakers/tetsuya","interview_youtube":"https://youtu.be/W9Y0af6opag"},{"objectId":"CFanICoNLL","title":"Code, Community, and Credibility: How Technical Should DevRel Be?","summary":"Developer Relations (DevRel) roles vary widely, but one key question remains: how technical should a DevRel professional be? In this session, we will explores the balance between technical expertise and community engagement skills. Participants will learn when deep technical knowledge is essential and when communication and empathy take priority. Through discussions and case studies, attendees will understand how to tailor their technical skills to their specific DevRel role and audience, improving their effectiveness and career growth.","description":"DevRel professionals often face the challenge of defining the right level of technical knowledge required for their role. Some positions demand deep coding skills and product expertise, while others focus more on community building and advocacy. In this session, we will help attendees identify the technical competencies needed based on their objectives and target audience. We will examine real-world examples and share best practices for balancing high-fidelity technical depth with empathetic communication. By the end of the session, participants will have a clear framework for developing technical capabilities that directly enhance their impact as DevRel practitioners.","type":"talk","category":"devrel","level":"beginner","reason":"With over three years of my experience in DevRel, I have consistently demonstrated a deep understanding of complex technologies such as API testing, eBPF, and cloud-native observability. I have being actively engaged in community building and mentorship. and has organized and spoken at various developer events, authored technical content that simplifies complex DevOps concepts, and mentored aspiring DevRel professionals through programs like Keploy's DevRel Cohort.","coc":true,"record":true,"no_support":true,"user":"DG4aCsSYI2","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-31T10:14:08.315Z","updatedAt":"2025-07-13T01:42:56.104Z","is_enabled":true,"rating":3.625,"review":"","ACL":"{\"DG4aCsSYI2\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"","co_speaker":true,"deadline":"","key":"","responseStatus":"","slug":"sonichigo","name":"","x_account":"sonichigo","organization":"","speaker_url":"https://devrelkaigi.org/en/sonichigo","interview_youtube":""},{"objectId":"wbgvvV4VXJ","title":"テックブランディング戦略と実践","summary":"DMMのプラットフォーム開発本部ではコミュニティ運営や発信活動を積極的に実施するメンバーが少なく、専任でもないため個人のやる気や業務状況に大きく依存しているという問題がありました。\nその状況の中、テックブランディング強化の必要性を感じたメンバーでpf-techbranding組織が結成されました。\n本セッションでは、pf-techbrandingの立ち上げ時の目標・目的整理から実際にテックブランディング強化を目的とした取り組み、それらの取り組みによる効果と今後の展望を紹介します。","description":"# セッション内容\n\n本セッションでは次の内容を含む予定です。\n1. テックブランディング強化を目的とした組織の立ち上げ\n2. 目標・目的管理\n3. 実施している取り組み\n4. 現時点での効果共有\n5. 今後の展望\n\n## 実施取り組み\n\n実施している取り組みとして、以下のような内容があります。\n- 並走の仕組み\n- 各チームの発信状況ヒアリング\n- ヒアリング結果を元にした発信催促\n- カンファレンス情報展開\n- 登壇ガイドラインまとめ\n\n## 並走の仕組み\n\nこの中でも並走の仕組みに力を入れています。\n「登壇に興味があるけど準備に不安を感じる人」「初めて登壇する人」「登壇準備にあたって他の人からの意見が欲しい人」などを中心にpf-techbrandingメンバーが登壇内容の案出しから登壇内容方針策定、資料レビューといった内容を登壇者と一緒になって実施します。  \n並走する中で、登壇する上でのアドバイスや諸注意を随時共有することで、登壇者の不安を取り除き登壇をより良いものにする一助になっています。  \n\n# 得られる学び\n\n本セッションで以下のような学びが得られるように努めます。\n1. テックブランディング戦略を立てるために必要な活動の一例\n2. 外部発信を促進するために必要なこと\n3. 発信慣れていない人がスムーズな外部発信をするためのサポート","type":"talk","category":"community","level":"All","reason":"pf-techbrandingの立ち上げ者の一人であり、以前から発信者を増やすにはどうしたら良いかを考えていました。\nテックブランディング強化に向けて必要なことを考え、実施してきたからこそ話せる内容があると考えています。","coc":true,"record":true,"no_support":true,"user":"jrGfBpA0qG","lang":"ja","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-31T12:44:20.726Z","updatedAt":"2025-08-18T14:15:55.184Z","is_enabled":true,"rating":3.6666666666666665,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"","co_speaker":true,"deadline":"2025-05-31T07:23:02.778Z","key":"null","responseStatus":true,"slug":"hayato","name":"Hayato Miyazato","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/speakers/hayato","interview_youtube":"https://youtu.be/UXHb3LL6SyI"},{"objectId":"V0WoratQQL","title":"チームで行うDevRel活動 - 事業貢献をしながらユーザーに価値を届けるために","summary":"DevRel活動は、イベント、メディア、コミュニティ活動、ワークショップと多岐にわたります。\nそれらを一人でまかない切るのではなく、プロフェッショナルとして個人の力を活かした方が、より大きな効果が期待できます。\nそして、それは事業やプロダクトの思想や目標、数字と紐づいてなければなりません。\n本セッションでは、ファインディが立ち上げから20名規模の組織になり、事業価値とユーザーへの価値を両立している考え方や取り組みを紹介します","description":"1.FindyのDevRelの取り組み \n- 組織規模 \n- 立ち上げの苦悩と課題\n- ミッション\n2.DevRelとMKの棲み分けと考え方\n-  海外と日本のDevRelの違いを、DevRelConferene NY参加から考える\n-  MKとの共同の仕方、CSやSalesとのつなぎ込み\n3. 個々人の特性を考えて組織マネジメントする\n- DevRelは総合力が求められる\n- プロフェッショナルな力を活かすことと、それをマネジメントすること\n- 開発組織の考え方と同じ組織づくり（チームトポロジーから考える）\n4. Findyのイベントやカンファレンスの取り組み\n5.まとめ","type":"talk","category":"business","level":"Intermediate","reason":"ファインディ株式会社で、DevRelの立ち上げから20名まで組織を拡大し、事業にとってなくてはならない存在にしたため","coc":true,"record":true,"no_support":true,"user":"SCL6YoPqvX","lang":"ja","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-31T07:48:02.840Z","updatedAt":"2025-07-14T08:39:38.266Z","is_enabled":true,"rating":3.6666666666666665,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","first_event":"なし","co_speaker":"","deadline":"2025-07-20T01:50:12.988Z","key":"null","responseStatus":true,"slug":"masashible","name":"Kitagawa Masashi","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/speakers/masashible","interview_youtube":""},{"objectId":"XBeUm7yra7","title":"Teach, Don’t Preach: Developer Education That Actually Works","summary":"Developer education isn’t just about talking at developers—it’s about creating environments where they can learn, build, and grow. This talk shares hands-on, scalable strategies that move beyond tutorials and docs to create truly impactful learning experiences.","description":"How do developers really learn? It’s not just through documentation or conference talks—it’s through building, exploring, and connecting with others. And yet, many developer education efforts focus only on creating more content.\n\nIn this talk, I’ll share practical, community-powered strategies for developer education, based on my experience supporting 150+ hackathons, building ambassador programs, and mentoring global developer communities.\n\nWe’ll dive into:\n- Why hackathons are one of the most effective (and underrated) learning platforms\n- How to co-create education with your community (ambassadors, contributors, advocates)\n- Scaling content through layered formats: workshops, live sessions, docs, and self-paced tracks\n- Mistakes DevRel teams make in education—and how to avoid them\n\nThis session includes lessons from Hack This Fall, a community-first hackathon initiative, and from my work at Storyblok and Major League Hacking, helping thousands of developers learn by doing.\n\nYou’ll leave with actionable ideas to create engaging, scalable, and inclusive developer education—without needing a massive team or budget.","type":"talk","category":"education","level":"Intermediate","reason":"Developer education has been central to my work for years. I'm the founder of Hack This Fall, a developer community and hackathon series that’s helped thousands of students and professionals grow through peer-led learning.\n\nAs a Developer Community Specialist at Storyblok and a Major League Hacking Coach, I’ve organized and supported over 150+ hackathons, built global ambassador programs, and created education strategies that scale across regions and learning levels.\n\nI've previously spoken at DevRelCon Tokyo, DevRelCon Yokohama, DevRelCon Bangalore, DevRelCon Online, and numerous DevRel and developer education meetups. This talk is a culmination of my practical experience in building engaging, scalable learning ecosystems.","coc":true,"record":true,"no_support":true,"user":"2Ih59qxbx1","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-31T18:15:10.898Z","updatedAt":"2025-07-13T01:42:56.109Z","is_enabled":true,"rating":4,"review":"","ACL":"{\"2Ih59qxbx1\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"This is a brand-new talk created specifically for DevRelKaigi, drawing from my ongoing work in developer education, community events, and ambassador enablement.","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"siddharth-dayalwal","name":"","x_account":"siddharthdayalwal","organization":"","speaker_url":"https://devrelkaigi.org/en/siddharth-dayalwal","interview_youtube":""},{"objectId":"FO7nuwDX59","title":"Practical AI Safety","summary":"No jargon—just practical strategies you can implement immediately to protect your organisation while leveraging AI's benefits.\n\nThis is session is open to anyone building, using, or regulating AI.\n\nHere are some slides I've used for this talk in April this year: https://docs.google.com/presentation/d/1bwB1Pcyx_M-lE_PjuoGn0_5FNX-lU6bZ\n\nI've also done a version of this talk just for engineering leaders: https://docs.google.com/presentation/d/15yDbvx3KGihdUgNya7WT3Sfpv84432mk/\n\nFlexible Duration & Format.","description":"Practical AI Safety: What Every Developer Needs to Know\n\nA practical guide to real-world AI risks—like bias, hallucinations, and data leaks—and what developers can do about them. Learn simple, actionable steps to build safer, more trustworthy AI systems. No jargon, just practical advice you can use today.","type":"workshop","category":"education","level":"All","reason":"I'm an AI Safety focused engineer with a proven track record in Developer Relations. My experience spans Developer Relations at IBM, Lightning AI, and SurrealDB, plus hands-on research on AI safety challenges like reducing medical hallucinations.\n\nRecently completed Center for AI Safety's AI Safety, Ethics & Society course (Spring 2025) and co-authored an IEEE paper on math word problems for low-resource languages like Hindi and Sinhala (http://ieeexplore.ieee.org/document/10933586/similar).\n\nRecognized with UAE 10-Year Golden Visa for Outstanding Specialised Talents in Software Engineering. Serving as Gold Ambassador for CodersHQ (https://ai.gov.ae/codershq/).","coc":true,"record":true,"no_support":true,"user":"djrNuwzCLI","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-06-02T07:50:49.181Z","updatedAt":"2025-06-17T02:42:42.888Z","is_enabled":true,"rating":1,"review":true,"ACL":"{\"djrNuwzCLI\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"I've done an older version of a similar talk at 2023 DevRelCon London, where I was the closing speaker for in this track: https://youtu.be/Jb1UzorJMcI?si=C0QiPf7oZuoz-9EF","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"naiyarah","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/naiyarah","interview_youtube":""},{"objectId":"JizZdENHh0","title":"Considering Better Accessibility with AI When Localising Technical Documents","summary":"I'm going to share my experience to proactively adopt the AI capability to localise technical documents for better accessibility","description":"Let's say your company or organisation provides technical documents only in English. Now, you're about to expand your customer demographics to global - non-English speakers. How would you like to localise your tech documents - hiring professional translators or AI?\n\nThroughout this session, I'd like to share my experience about the localisation using AI for better accessibility from all around the globe. And of course what we need to consider when adopting AI capability for this localisation efforts.","type":"talk","category":"devrel","level":"beginner","reason":"As a DevRel person, I build technical contents everyday, in English. I'm now living in a country where English is not the primary language, and there are whole lot of developers who need those contents in their own languages. I've gone through this challenge for about a year, and it's time to share my experience.","coc":true,"record":true,"no_support":true,"user":"puiitzmuMD","lang":"en","status":"Sent","cfp":"FVkLmDT7az","createdAt":"2025-06-03T06:15:53.065Z","updatedAt":"2025-06-17T02:42:31.274Z","is_enabled":true,"rating":3,"review":true,"ACL":"{\"puiitzmuMD\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"No","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"justin","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/justin","interview_youtube":""},{"objectId":"qzn5vHnw5J","title":"What Community Leadership Taught Me About DevRel","summary":"This session would be my personal reflection on the journey from building SheBuilds , one of India’s largest women-led developer communities to stepping into my first Developer Relations role. Leading SheBuilds wasn’t just about organizing events or growing numbers; it was about creating safe spaces, amplifying unheard voices, and showing up even when burnout crept in. Through it all, I discovered that community leadership isn’t just a stepping stone to DevRel, it’s the heart of it.\n\nIf you’re someone who’s building communities, dreaming of a DevRel career, or simply trying to make a real impact, this talk offers honest lessons, emotional highs and lows, and a look at the human side of developer advocacy.","description":"I founded the SheBuilds community with a simple yet deeply personal vision, to ensure that no woman faces the same struggles I did while trying to break into tech from a non-technical background. What began as a support system quickly grew into one of India’s largest women-led developer communities - powered by empathy, shared learning, and a drive to create real change.\n\nThrough SheBuilds(https://www.shebuilds.tech/) , I wasn’t just organizing events. I was creating safe spaces, building trust, amplifying unheard voices, and learning how to connect deeply with developers. These grassroots experiences, shaped by vulnerability and purpose, laid the foundation for my journey into Developer Relations.\n\nIn this talk, I’ll share how leading with empathy, navigating burnout, and building community from scratch equipped me for my first DevRel role. This is a session for anyone trying to turn impact into opportunity - whether you’re a community leader, a DevRel hopeful, or just figuring out where you belong in tech.","type":"talk","category":"community","level":"All","reason":"With over 3 years of hands-on community experience as the founder of SheBuilds, one of India’s most impactful women-led developer communities, I bring both leadership and lived experience to the table. I’ve personally navigated the challenges of entering tech from a non-technical background challenges that inspired me to create SheBuilds so others wouldn’t have to walk the same path alone.\n\nIn addition to my community work, I’ve been actively involved in technical programs like LFX, Google Summer of Code (GSoC), and others, which helped me build a strong foundation in tech. I now work in Developer Relations, where I apply everything I’ve learned from grassroots community building to developer advocacy on a global scale.\n\nThis session isn’t just theoretical it’s personal, practical, and rooted in experience. I’m excited to share honest lessons, real stories, and actionable takeaways with an audience that might be walking a similar journey.","coc":true,"record":true,"no_support":true,"user":"n5jg5XPgxh","lang":"en","status":"Sent","cfp":"FVkLmDT7az","createdAt":"2025-06-17T07:00:21.195Z","updatedAt":"2025-07-13T01:47:40.527Z","is_enabled":true,"rating":3.3333333333333335,"review":true,"ACL":"{\"n5jg5XPgxh\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"Yes, I’ve had the opportunity to speak at over 20 events globally, including notable conferences such as Solana Summit, KubeDay Singapore, GNOME Asia (Nepal), and DevFest New Delhi, among others. You can explore more of my speaking engagements on my LinkedIn profile ( https://www.linkedin.com/in/connectbhawna/ ) ","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"bhawna","name":"","x_account":"ConnectBhawna","organization":"","speaker_url":"https://devrelkaigi.org/en/bhawna","interview_youtube":""},{"objectId":"QLeCWXwJPd","title":"The Uphill Battle: How Developer-Plus Companies Are Learning to Build Trust Through Education and Community","summary":"Developer relations has traditionally thrived in companies building developer-first products, but what happens when B2B companies without direct developer tools want to engage the developer community? This session explores the unique challenges and opportunities of developer evangelism in B2B environments, where traditional metrics fall short and stakeholder buy-in requires creative approaches. Through real-world case studies and practical frameworks, we'll demonstrate how developer advocates can create measurable impact and build sustainable programs in companies where developers aren't the primary customer - but are crucial influencers in the buying process.","description":"This session addresses the critical gap between traditional developer relations approaches and the realities of B2B business models. We'll explore how enterprise SaaS have successfully built developer communities and measured their impact on business growth.\n\nWhat Attendees Will Learn:\n\nFrameworks for measuring indirect developer influence on B2B sales cycles\n- How education is the pillar of a community \n- How to make developer trust your product with your developer community\n- Tactical approaches for content creation, event planning, and community building in B2B contexts\n- How to position developer evangelism as a strategic business function rather than a \"nice-to-have\"\n- How to leverage the community to become a continuous feedback for better developer experience of your product","type":"talk","category":"devrel","level":"Intermediate","reason":"I've lived the exact challenge this talk addresses. As a developer advocate across DevRev, DevAssure, and DevRel Squad, I've experienced firsthand how dramatically different DevRel success looks when you're not building developer tools directly.\n\nThe transition to developer-plus companies forced me to completely rethink how we measure success. When GitHub stars and API adoption metrics became irrelevant, I had to develop new frameworks for demonstrating value. I leaned heavily on the DevRel community during this learning process, collaborating with other practitioners facing similar challenges, testing different approaches, and documenting what actually worked versus what sounded good in theory.\n\nThis session isn't based on theoretical frameworks, it's built from real experiments, failed attempts, breakthrough moments, and the collective wisdom I've gathered from both my own experience and the broader DevRel community.","coc":true,"record":true,"no_support":true,"user":"2IknnIHoVF","lang":"en","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-05-26T17:57:27.695Z","updatedAt":"2025-07-03T06:52:51.133Z","is_enabled":true,"rating":3.5,"review":true,"ACL":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true}}","first_event":"NA","co_speaker":"","deadline":"2025-07-04T09:32:20.426Z","key":"null","responseStatus":true,"slug":"nimitsavant","name":"Nimit Savant","x_account":"SavantNimit","organization":"DevRev","speaker_url":"https://devrelkaigi.org/en/speakers/nimitsavant","interview_youtube":""},{"objectId":"jVqanGM4IJ","title":"Building a Video-First PLG Strategy That Outperforms","summary":"Video comprises 90% of the world's data, yet most DevRel teams treat it as an afterthought. After producing 700+ developer videos and 15+ years in tech leadership, I've discovered how to use video as a growth engine that simultaneously drives developer education, marketing impact, and product adoption.\n\nI'll share the exact framework and real metrics from what worked (and failed spectacularly) when creating content for technical audiences. You'll learn actionable techniques to transform your video strategy—regardless of budget—and walk away with methods you can implement immediately.\n\nKey takeaways: The Video-First PLG Framework, which metrics actually predict developer adoption and real case studies of $0 budget videos outperforming $50K productions.","description":"After producing 700+ developer-focused videos and leading engineering teams for 15+ years, I've cracked the code on using video to simultaneously drive developer education, marketing impact, and product-led growth. This session is not about making pretty videos, rather about building a systematic video strategy that transforms how developers discover, understand, and adopt your product.\n\nI'll share the exact framework and golden rules that took me years to develop, plus real metrics from what surprisingly worked (and what spectacularly failed) when creating content for technical audiences. You'll discover how to weirdly combine developer education with GTM strategy using video as your secret weapon, regardless of your budget or team size.\n\nWhat You'll Learn:\n\n- The \"Video-First PLG Framework\" that turns technical content into growth fuel\n- Why traditional video metrics lie to you (and which ones actually predict developer adoption)\n- How to create one piece of video content that serves 5 different funnel stages\n- Real case studies: $0 budget videos that outperformed $50K productions\n\nFor: DevRel professionals, product marketers, and technical content creators who want to stop guessing about video strategy and start seeing measurable results.","type":"talk","category":"marketing","level":"All","reason":"I'm uniquely positioned to deliver this session as one of the few professionals who bridges deep technical expertise with cinematic storytelling mastery. With 15+ years in tech leadership and 700+ developer videos produced, I've validated this framework across multiple markets and technical audiences.\n\nSpeaking Credentials:\n\n- Keynote Speaker: Google I/O 2023, All Things Open AI 2025, DrupalCon 2016\n- Featured at Developer Conferences across USA, Canada, and LATAM (more than 60 sessions delivered) \n- DevRel Uni Mentor \n- Certified Blackmagic Trainer for DaVinci Resolve\n- Google Developer Expert, MongoDB Champion, Google Certified Trainer and Educator. \n\nAs a former film graduate, I've extensively studied Japanese cinema, composition, and aesthetics, investing significant time understanding Japan's unique cultural and market dynamics. In 2024, I spent considerable time physically in Tokyo, Kyoto, Kanazawa, and Osaka specifically to deepen this understanding.\n\nThis combination of technical depth, proven video production expertise, and genuine cultural investment in Japan makes me uniquely qualified to deliver insights that will resonate with DevRelIkigai's audience. I understand both the universal principles of developer engagement through video and the specific cultural nuances that make content effective in the Japanese and/or Asian market.\n\nThe framework I'll share isn't theoretical, it's battle-tested across global developer communities, with particular attention to cultural adaptation and localized engagement strategies.","coc":true,"record":true,"no_support":true,"user":"xqODFv2H0J","lang":"en","status":"Sent","cfp":"FVkLmDT7az","createdAt":"2025-06-17T15:43:09.673Z","updatedAt":"2025-07-13T01:42:56.131Z","is_enabled":true,"rating":3.6666666666666665,"review":"","ACL":"{\"xqODFv2H0J\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"DevRelCon 2025","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"kevinblanco","name":"","x_account":"kevinblanco","organization":"","speaker_url":"https://devrelkaigi.org/en/kevinblanco","interview_youtube":""},{"objectId":"C6lmlUv0Ss","title":"Building Developer Communities: A 15-Year Journey in 20 Minutes","summary":"In this high-energy session, I'll compress 15 years of global community building (from organizing local Drupal meetups to scaling Appsmith's community from 3K to 20K+ developers worldwide) - into actionable insights you can implement immediately.\n\nDrawing from hands-on experience across diverse ecosystems (Google, MongoDB, Appsmith) and traveling globally to understand what makes developer communities thrive, I'll reveal the counterintuitive strategies that actually work versus the ones everyone talks about but fail consistently.","description":"65% of developers consider a strong community critical when choosing technology. Yet most companies still treat community building as a \"nice-to-have\" rather than a strategic growth driver.\n\nIn this session, I'll compress 15 years of global community building (from organizing local Drupal meetups to scaling Appsmith's community from 3K to 20K+ developers worldwide) - into actionable insights you can implement immediately.\nWhat I'll Cover:\n\n- Why traditional community metrics mislead you (and which ones predict real growth)\n- The \"3-Touch Community Framework\" that transforms lurkers into advocates\n- How giving back strategically accelerated my career from local organizer to Google Developer Expert\n- Real case study: Growing a developer community 5x in 12 months with zero budget\n\nKey Takeaways:\n\n- Practical steps to add more value to your community efforts\n- The vital role communities play in developer tool adoption\n- How to become a change-maker in your developer ecosystem\n\nFor: DevRel professionals, community managers, and tech leaders who want to stop guessing about community strategy and start seeing measurable impact.","type":"talk","category":"community","level":"All","reason":"I've spent 15 years building developer communities from the ground up, starting with local Drupal meetups and scaling to global ecosystems. My credentials include Google Developer Expert, Google Champion, Google Innovator, and Google Certified Educator, earned through consistent community contribution rather than corporate appointment.\n\nProven Track Record:\n\n- Scaled Appsmith's developer community from 3K to 20K+ in just 12 months as DevRel Advocate\n- Organized and spoken at developer events across USA, Canada, and LATAM\n- Featured keynote speaker at major conferences: Google I/O 2023, All Things Open AI 2025, DrupalCon 2016\n- Active DevRel Uni Mentor helping shape the next generation of community builders\n\nReal-World Experience:\nI've built communities across diverse tech stacks, from open-source CMS platforms to cloud infrastructure to developer tools. This breadth gives me unique perspective on what works universally versus what's technology-specific.\n\nMore importantly, I've been on both sides: the community member seeking growth and the leader scaling engagement. I understand the developer mindset because I've lived it: coding for 10+ years, leading engineering teams for 5+, and now helping thousands of developers advance their careers through strategic community involvement.\n\nMy insights come from actual implementation, not theory: real metrics, real failures, real successes across multiple markets and cultural contexts.","coc":true,"record":true,"no_support":true,"user":"xqODFv2H0J","lang":"en","status":"Sent","cfp":"FVkLmDT7az","createdAt":"2025-06-17T17:10:11.623Z","updatedAt":"2025-07-27T12:16:12.340Z","is_enabled":true,"rating":4,"review":true,"ACL":"{\"xqODFv2H0J\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-08-03T12:16:12.337Z","key":"br8343v2cf8","responseStatus":"","slug":"kevinblanco","name":"","x_account":"kevinblanco","organization":"","speaker_url":"https://devrelkaigi.org/en/kevinblanco","interview_youtube":""},{"objectId":"AaGzNJ5k3U","title":"Developer-first Content Strategy ","summary":"Most developer content fails because it's marketing disguised as education. In this hands-on workshop, we'll flip the script and build content that developers actually want to consume, share, and act upon.\n\nTogether, we'll create a comprehensive content strategy playbook that aligns your developer education goals with GTM objectives and community growth—without compromising authenticity. This is not promotional content; it's about crafting developer-journey tailored guides that solve real problems while naturally driving adoption.","description":"Most developer content fails because it's marketing disguised as education. In this hands-on workshop, we'll flip the script and build content that developers actually want to consume, share, and act upon.\n\nWhat We'll Build Together:\n\n- A developer persona matrix mapped to their actual pain points and learning preferences\n- Content frameworks that serve developers first, business goals second\n- The \"3-Layer Content Strategy\" that simultaneously educates, engages, and converts\n- Practical templates for technical tutorials, guides, and documentation that scale\n\nHands-On Activities:\n\n- Collaborative playbook creation: Each participant contributes to a shared strategy document\n- Real-time content mapping: Match your product features to genuine developer needs\n- Template workshop: Build reusable frameworks you can implement immediately\n\nKey Takeaways:\n\n- A personalized content strategy playbook aligned with your GTM and community goals\n- Proven frameworks for creating authentic developer-focused content at scale\n- Templates and checklists for maintaining quality while increasing output\n- Strategies for measuring developer engagement beyond vanity metrics\n\nFor: DevRel professionals, product marketers, and technical content creators who want to stop guessing about content strategy and start creating material developers genuinely value.","type":"workshop","category":"marketing","level":"All","reason":"I'm uniquely positioned to lead this workshop because I've lived the entire spectrum, from developer struggling with poor documentation to creating 700+ videos that developers actually engage with, to scaling communities from 3K to 20K+ through authentic content strategy.\n\nProven Track Record:\n\n- Created content strategies that grew Appsmith's developer community 5x in 12 months\n- Produced 700+ developer-focused videos with measurable adoption impact \n- 15+ years as both content consumer (developer/engineering leader) and creator (DevRel advocate)\n\nMost content strategists understand marketing OR development—I understand both deeply. I've been the frustrated developer trying to implement poorly written tutorials, the engineering manager evaluating tools based on documentation quality, AND the DevRel professional responsible for driving adoption through content.","coc":true,"record":true,"no_support":true,"user":"xqODFv2H0J","lang":"en","status":"Sent","cfp":"FVkLmDT7az","createdAt":"2025-06-17T17:54:26.515Z","updatedAt":"2025-07-13T01:42:56.143Z","is_enabled":true,"rating":3,"review":"","ACL":"{\"xqODFv2H0J\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"kevinblanco","name":"","x_account":"kevinblanco","organization":"","speaker_url":"https://devrelkaigi.org/en/kevinblanco","interview_youtube":""},{"objectId":"yM6l143KPf","title":"Numbers Don't Lie: Uncovering the Metrics That Actually Matter","summary":"While vanity metrics like star counts and downloads may seem appealing, they often mask the true health of an open-source project. This talk reveals how to move beyond superficial numbers and identify the metrics that drive success.\n\nDrawing on the recent launch of Crawlee for Python, I'll demonstrate how to leverage vanity metrics as indicators of potential growth while focusing on core metrics that measure user engagement and project impact.\n\nDiscover how to set realistic goals, track progress effectively, and make data-driven decisions to propel your open-source project forward.\n\n","description":"While vanity metrics like star counts and downloads may seem appealing, they often mask the true health of an open-source project. This talk reveals how to move beyond superficial numbers and identify the metrics that drive success.\n\nDrawing on the recent launch of Crawlee for Python, I'll demonstrate how to leverage vanity metrics as indicators of potential growth while focusing on core metrics that measure user engagement and project impact.\n\nDiscover how to set realistic goals, track progress effectively, and make data-driven decisions to propel your open-source project forward.\n\n","type":"talk","category":"community","level":"All","reason":"I have launched multiple products and have insights.","coc":true,"record":true,"no_support":true,"user":"ZwGkuFxQOQ","lang":"en","status":"Sent","cfp":"FVkLmDT7az","createdAt":"2025-06-30T18:14:01.816Z","updatedAt":"2025-07-13T01:42:56.148Z","is_enabled":true,"rating":3.2,"review":"","ACL":"{\"ZwGkuFxQOQ\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"","co_speaker":true,"deadline":"","key":"","responseStatus":"","slug":"saurav","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/saurav","interview_youtube":""},{"objectId":"J5l0xjb77A","title":"Empowering Developers to Earn: Lessons from Apify’s DevRel Programs","summary":"In this talk, I will share how, as a Developer Relations Community Manager at Apify, I’ve helped thousands of developers build a living by creating software and publishing it on the Apify platform.\n\nWe’ll look at this journey by the numbers—covering metrics like the growing number of Actors published in the Apify Store, the volume of recurring revenue generated for independent developers, and the scale of the community engagement. I’ll break down the layered approach that makes this possible, from onboarding programs and educational content to personal support, public showcases, and incentive structures that reward technical creativity.\n\nI’ll also explain how these DevRel initiatives fit together to create an ecosystem where developers—from solo makers to established teams—can turn ideas into income, grow their reputation, and keep improving their products over time. Whether you’re starting a developer marketplace or scaling a mature platform, you’ll leave with practical examples of how intentional community building and thoughtful program design can unlock sustainable growth for your developer community.","description":"In this talk, I will share how, as a Developer Relations Community Manager at Apify, I’ve helped thousands of developers build a living by creating software and publishing it on the Apify platform.\n\nWe’ll look at this journey by the numbers—covering metrics like the growing number of Actors published in the Apify Store, the volume of recurring revenue generated for independent developers, and the scale of the community engagement. I’ll break down the layered approach that makes this possible, from onboarding programs and educational content to personal support, public showcases, and incentive structures that reward technical creativity.\n\nI’ll also explain how these DevRel initiatives fit together to create an ecosystem where developers—from solo makers to established teams—can turn ideas into income, grow their reputation, and keep improving their products over time. Whether you’re starting a developer marketplace or scaling a mature platform, you’ll leave with practical examples of how intentional community building and thoughtful program design can unlock sustainable growth for your developer community.","type":"talk","category":"experience","level":"All","reason":"I have led the DevRel and community programs at Apify from last 1.5 years and have a lot of learnings to share.","coc":true,"record":true,"no_support":true,"user":"ZwGkuFxQOQ","lang":"en","status":"Sent","cfp":"FVkLmDT7az","createdAt":"2025-06-30T18:27:55.638Z","updatedAt":"2025-07-27T12:16:30.819Z","is_enabled":true,"rating":4,"review":true,"ACL":"{\"ZwGkuFxQOQ\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:Admin\":{\"read\":true,\"write\":true}}","first_event":"","co_speaker":"","deadline":"2025-08-03T12:16:30.818Z","key":"3rrdd9459qo","responseStatus":"","slug":"saurav","name":"","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/en/saurav","interview_youtube":""},{"objectId":"pQrC6VPJDc","title":"Developers are Not Special Snowflakes: Lessons from DevRel for Enterprise Sales","summary":"It's not just developers: _no one_ likes to be marketed to. \n\nI've been transitioning my career lately, from developer advocacy to marketing in a more general sense for an enterprise sales-driven developer product. I'm new to marketing and working with sales, but I'm pleasantly surprised that my experience in DevRel has a lot of lessons to offer for marketing that targets non-developers—in my case, financial officers and senior management.\n\nI'm now convinced that the DevRel values of authenticity, established domain expertise, and clear communication are not a special sauce reserved for just developers, but are the key to _any_ successful marketing and sales motion and we've been underestimating our colleagues for far too long.","description":"I want to share some personal observations about how I've been able to bring my experience in devrel to a new, non-devrel role, as I think this would be helpful to folks who are in marketing (but not devrel), folks who might be contemplating a career shift, and to highlight some of the aspects of devrel that I think are bullshit.","type":"talk","category":"marketing","level":"Intermediate","reason":"This is a talk about my personal experience and observations working in marketing in a top-down, sales-driven startup, after spending a decade in DevRel.","coc":true,"record":true,"no_support":true,"user":"3MVRfO42CJ","lang":"en","status":"Sent","cfp":"ELGzJm5Ha5","createdAt":"2025-03-11T09:27:50.494Z","updatedAt":"2025-05-24T07:15:47.134Z","is_enabled":true,"rating":3.2857142857142856,"review":true,"ACL":"{\"3MVRfO42CJ\":{\"read\":true,\"write\":true},\"role:Voter2025\":{\"read\":true},\"role:admin\":{\"read\":true,\"write\":true}}","first_event":"This is a new talk for me.","co_speaker":"","deadline":"","key":"","responseStatus":"","slug":"uncannybingo","name":"","x_account":"","organization":"Formance","speaker_url":"https://devrelkaigi.org/en/uncannybingo","interview_youtube":"https://youtu.be/cyqY9h0oFdI"},{"objectId":"2025-keynote-004","title":"10年の共創が示す、これからの開発者と企業の関係 ～ Crossroad","summary":"ユーザーコミュニティ「SORACOM UG」を企業として支え続けた10年。その節目に立ち、単なるスポンサーや場の提供者を超えて長期的な関係を築くための役割と姿勢を見つめ直します。SORACOM UGの事例から得た知見と具体的な関わり方を振り返り、開発者と企業が互いに価値を育み、次の10年へとつなぐ関係性の在り方を展望します。","description":"","type":"keynote","category":"community","level":"All","reason":"","coc":true,"record":true,"no_support":true,"user":"BP4mppYozn","lang":"ja","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-08-15T05:25:45.3Z","updatedAt":"2025-08-15T05:25:45.3Z","is_enabled":true,"rating":"","review":true,"ACL":true,"first_event":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"ma2shita","name":"Kohei MATSUSHITA","x_account":"ma2shita","organization":"Soracom, Inc.","speaker_url":"https://devrelkaigi.org/ja/speakers/ma2shita","interview_youtube":""},{"objectId":"2025-keynote-003","title":"Next-Gen DevRel：AI時代のビジネス成長エンジン","summary":"この講演では、DevRelが製品検討から導入・活用に至るまでITエンジニアと伴走し、従来の枠を超えた価値を創り出す取り組みを解説します。加えて、ITエンジニア同士が学び、共創する場からどのように新しいナレッジやイノベーションが生まれるのか、そしてAI時代においてDevRelが持つビジネス的価値と可能性を明らかにします。","description":"この講演では、DevRelが製品検討から導入・活用に至るまでITエンジニアと伴走し、従来の枠を超えた価値を創り出す取り組みを解説します。加えて、ITエンジニア同士が学び、共創する場からどのように新しいナレッジやイノベーションが生まれるのか、そしてAI時代においてDevRelが持つビジネス的価値と可能性を明らかにします。","type":"keynote","category":"business","level":"All","reason":"","coc":true,"record":true,"no_support":true,"user":"b4FRxF0z2N","lang":"ja","status":"Sent","cfp":"OuZHfyGpJQ","createdAt":"2025-08-20T08:49:26.002Z","updatedAt":"2025-08-20T08:49:26.002Z","is_enabled":true,"rating":"","review":true,"ACL":true,"first_event":"{\"*\":{\"read\":true},\"role:Organizer2025\":{\"write\":true},\"role:Admin\":{\"write\":true},\"role:Speaker2025\":{\"write\":true}}","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"ayatokura","name":"Aya Tokura","x_account":"ayatokura","organization":"IBM Japan","speaker_url":"https://devrelkaigi.org/ja/speakers/ayatokura","interview_youtube":""},{"objectId":"berakout-1","title":"「発表する登壇」から「伝わる登壇」へ ─ 思いやりの「テクニック489」とは？","summary":"","description":"登壇（あるいは一般的なプレゼンでも）、みなさんどのような目的で臨みますか？\n\n「目立ちたい」から？　「仕方なく」？　いやいや、もっと熱い思いがありません？　「苦労の後に勝ち得た成功体験を共有したい」とか、「発見した新しいやり方（tips）」とか。\n\nでも、実は思いが熱ければ熱いほど、親切心があればあるほど、失敗する可能性が高くなるんです。もちろん、真逆で思いがなかったり、親切心がなければもっとその可能性は高いです。登壇（＝プレゼン）の目的は、相手（＝聴衆）の心に訴えて結果として行動を起こしてもらうこと。一方的に伝えること（＝吐き出すこと）ではないんです。\n\n本セッションでは、ほんの少し工夫するだけで、相手の心に届き、理解され、記憶に残り、結果として行動につながる「テクニック489」を紹介します。スピーカーの話し方とスライドの作り方、それぞれに取り入れられる実践的なテクニックを例とともに解説します。\n\n明日からでなく「今日から使える」テクニックを持ち帰ってください。","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"XPTDWeIGI9","lang":"ja","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"wataru","name":"Wataru Yamazaki","x_account":"wyamazak","organization":"OwlPay Japan Inc.","speaker_url":"https://devrelkaigi.org/ja/speakers/wataru","interview_youtube":""},{"objectId":"berakout-2","title":"エバンジェリスト9年生のリアル ― AI時代にどう生きるか","summary":"","description":"エバンジェリスト9年目の現実と理想。プロダクトの成長や時代の変化の中で、自分は何をしてきたのか、何を大事にしてきたのか。そしてこれからもエバンジェリストは必要なのか、AIに置き換えられるのか。9年目だからこそ話せる「リアル」と「問い」を共有し、プロのエバンジェリストとは何かを一緒に考えたいと思います。\n","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"9JvgN5WYp0","lang":"ja","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"mobilebiz","name":"高橋克己","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/speakers/mobilebiz","interview_youtube":""},{"objectId":"berakout-3","title":"関係を育てる場。ハッカソン×コミュニティの交差点","summary":"","description":"ハッカソンは短期間で共創を加速させる「実験の場」、コミュニティは関係を育み続ける「持続の場」。ワークショップデザイナー、ハッカソンファシリテーターとして数多くの現場に立ち会ってきた経験から、両者の交差点にある価値や可能性を探ります","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"XAtHCjJHZ7","lang":"ja","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"tomokibanno","name":"TomokiBanno","x_account":"","organization":" General Incorporated Association MA","speaker_url":"https://devrelkaigi.org/ja/speakers/tomokibanno","interview_youtube":""},{"objectId":"berakout-4","title":"経営にあなたのDevRelが評価されるには","summary":"","description":"DevRelや技術広報に全力で取り組んでいるのに、なかなか経営から評価されない――そんな悩みを抱える方はいませんか？\n\n本セッションでは、経営がDevRel/技術広報をどのように見ているのかを整理しつつ、単なる「イベントや記事数」ではなく、経営にどのようにして評価してもらうかを解説します。\n\nDevRelが「趣味の延長」や「コストセンター」と捉えられてしまうのではなく、事業に価値をもたらす投資活動として評価されるためのヒントを持ち帰っていただける内容です。","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"D3q75jE4Gr","lang":"ja","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"wslash","name":"Masatoshi Yokota","x_account":"","organization":"SAKURA internet Inc.","speaker_url":"https://devrelkaigi.org/ja/speakers/wslash","interview_youtube":""},{"objectId":"berakout-5","title":"大企業の壁を壊す「生成AI×コミュニティ」の力 〜1000人規模の熱量が創る、ソフトバンク流 新しい \"共創\" のカタチ〜","summary":"","description":"生成AIの登場は、ビジネスに好機をもたらすと同時に、多くの企業に「組織の壁」という根深い課題を改めて浮き彫りにしました。\n部門間の連携不足、ノウハウの属人化、生まれるはずのシナジーが生まれない――。この課題は、大企業だけのものではありません。本セッションでは、この根深い課題に、私たちソフトバンクが「コミュニティの力」でいかに挑んでいるかをお話しします。\n主役は、グループ30社以上、1000人超が参加する「生成AI Working Group」です。\nしかし、これは単なる成功事例の紹介ではありません。私たちが目指したのは、ボトムアップの熱量を起点に、組織の縦割りを乗り越え、具体的な「共創」を生み出す土壌そのものを育むことでした。講演では、そのリアルな軌跡を共有します。\n- 「知る→相談する→事例化」のサイクルが、いかにして部門間の壁を溶かしたか\n- 非エンジニアが1000人規模のコミュニティをスケールさせた、泥臭い試行錯誤の記録\n- 経営層を活動の「オーナー」に変え、活動を全社的なうねりに変えた\n戦略組織を変え、人を繋ぎ、新たな価値を創出したい。そう願う全てのDevRel担当者、コミュニティマネージャーに、私たちの挑戦の記録をお届けします。\n\n対象となる聴講者:\n- 大企業やグループ経営において、全社的なAI/DX活用を推進する立場の方\n- 部門や企業の壁を越えたコラボレーションの創出に課題を感じているマネージャー\n- 社内コミュニティの立ち上げ、活性化、効果測定の方法に関心のある方\n- 生成AIの導入・活用を検討しているが、最初の一歩が踏み出せない企画・推進担当者\n\n聴講者が得られること:\n- 大企業特有の「サイロ化」を打破し、ボトムアップで生成AI活用を推進するための具体的なアプローチ。\n- 参加者のエンゲージメントを高める「知る→相談する→事例化」の活動サイクルの設計と運用ノウハウ。\n- 初心者向けセミナーから経営層向け報告会まで、多様なターゲットに響くイベントの企画術と実践例。","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"5Uqne64gZk","lang":"ja","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"styamakami","name":"山上智志","x_account":"","organization":"ソフトバンク株式会社","speaker_url":"https://devrelkaigi.org/ja/speakers/styamakami","interview_youtube":""},{"objectId":"berakout-6","title":"外資4社でのレポーティングの実際","summary":"","description":"","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"i8G7XZIrt8","lang":"ja","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"shindoy","name":"Yosuke Shindo","x_account":"","organization":"GPUStack Japan","speaker_url":"https://devrelkaigi.org/ja/speakers/shindoy","interview_youtube":""},{"objectId":"berakout-7","title":"TechBLOGはじめました！ ― 社員と育てる、エンジニアコミュニティの舞台裏","summary":"NTTDATAでは、2025年4月からTechBLOGを始めました。\n立ち上げに際して、社内横断で「TechBLOGコミュニティ」を立ち上げ、\nエンジニアの発信をビジネスの力に変えることをより加速しようとしました。\n本講演では、\n・なぜ企業として技術者ブログに取り組むのか？\n・どのように社内のエンジニアを巻き込み、継続的な発信を仕組み化しているのか？\n・発信を通じて「信頼・共感」がどのようにビジネス価値に変わるのか？\nをお話しします。","description":"NTTDATAでは、2025年4月からTechBLOGを始めました。\n立ち上げに際して、社内横断で「TechBLOGコミュニティ」を立ち上げ、\nエンジニアの発信をビジネスの力に変えることをより加速しようとしました。\n本講演では、\n・なぜ企業として技術者ブログに取り組むのか？\n・どのように社内のエンジニアを巻き込み、継続的な発信を仕組み化しているのか？\n・発信を通じて「信頼・共感」がどのようにビジネス価値に変わるのか？\nをお話しします。","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"FslDgbLsSQ","lang":"ja","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"murayama","name":"murayama hiroki","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/speakers/murayama","interview_youtube":""},{"objectId":"berakout-8","title":"TBD","summary":"","description":"","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"GRNb61r42H","lang":"en","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"kazuhitoyokoi","name":"Kazuhito Yokoi","x_account":"","organization":"Hitachi Academy","speaker_url":"https://devrelkaigi.org/en/speakers/kazuhitoyokoi","interview_youtube":""},{"objectId":"berakout-9","title":"Developer Advocate/Community Managerになるには？スキル・ロール・キャリアをグローバルな文脈から考える","summary":"海外のテック企業では Developer Relations は Developer Advocate / Community Manager など複数のロールに分かれ、それぞれ異なるRole & Responsibilityを持っています。本セッションでは定義について議論することは避け、今後のよりよい理解に向けて、\n登壇者の外資系複数企業でのCommunity Manager, Developer Advocateの経験を踏まえて、Role & Responsibilityの一例を紹介します。\n話す予定の内容は\n- これらのロールの違いと連携関係\n- 開発者やビジネスに対して果たす役割\n- それぞれに必要なスキルセット\nを解説します。さらに「どうやってその職種になれるか」というキャリアの道筋やDeveloperから各ロールに求めること簡単ですが紹介する予定です。","description":"海外のテック企業では Developer Relations は Developer Advocate / Community Manager など複数のロールに分かれ、それぞれ異なるRole & Responsibilityを持っています。本セッションでは定義について議論することは避け、今後のよりよい理解に向けて、\n登壇者の外資系複数企業でのCommunity Manager, Developer Advocateの経験を踏まえて、Role & Responsibilityの一例を紹介します。\n話す予定の内容は\n- これらのロールの違いと連携関係\n- 開発者やビジネスに対して果たす役割\n- それぞれに必要なスキルセット\nを解説します。さらに「どうやってその職種になれるか」というキャリアの道筋やDeveloperから各ロールに求めること簡単ですが紹介する予定です。","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"3EEjk0B0MZ","lang":"ja","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"sho","name":"Sho Tanaka","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/speakers/sho","interview_youtube":""},{"objectId":"berakout-10","title":"ユーザーと一緒に育てる！1年半の実践で得たコミュニティ成長のヒント","summary":"","description":"コミュニティは企業だけで育てるものではなく、ユーザーと共に成長していくものです。本セッションでは、自社コミュニティを1年半運営する中で取り組んだ具体的な施策や成果、今後の展望についてお話します。既存ユーザー限定から未顧客やフリープランユーザーも参加可能な形に切り替え、リーダー候補との1on1を通じてリーダーに任命する取り組みや、リーダーを中心とした参加者のXでのポスト促進など、参加者と一緒にコミュニティを育ててきた実践を振り返り、成長を後押しするヒントをお伝えします。","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"39VQ3zODHE","lang":"ja","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"knuna-t","name":"北川佳奈","x_account":"","organization":"","speaker_url":"https://devrelkaigi.org/ja/speakers/knuna-t","interview_youtube":""},{"objectId":"berakout-11","title":"TBD","summary":"","description":"","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"2QyOolj5LN","lang":"ja","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"tshimmura","name":"Takeshi Shimmura","x_account":"","organization":"Atlassian K.K.","speaker_url":"https://devrelkaigi.org/ja/speakers/tshimmura","interview_youtube":""},{"objectId":"berakout-12","title":"Getting Started with the Linux Foundation: Pathways for DevRel Practitioners","summary":"","description":"The Linux Foundation (LF) is home to world-class projects like Kubernetes, PyTorch, and Linux itself. But beyond code, it also fosters an ecosystem of working groups, programs and open collaborative initiatives where DevRel practitioners can contribute, learn, and strengthen their profession.\n\nIn this talk, Ana Jiménez, Senior Project Manager at the Linux Foundation, will showcase some entry points for DevRel practitioners involved in domains such as security, AI/ML, or open source strategy. She will also introduce the LF DevRel Foundation, a new initiative where participants collaboratively create resources (definitions, frameworks, and shared artifacts) that help elevate the practice of Developer Relations.\n\nThis session is designed for newcomers who want to learn more about how their DevRel skills, whether in community engagement, product advocacy, education, or technical support, can fit within the Linux Foundation’s ecosystem and to discover communities where they can get involved.","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"EQPFGsdPZG","lang":"en","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"anajsana","name":"Ana Jimenez Santamaria","x_account":"","organization":"Linux Foundation (TODO Group,  PyTorch Foundation)","speaker_url":"https://devrelkaigi.org/en/speakers/anajsana","interview_youtube":""},{"objectId":"berakout-13","title":"From Static Docs to Dynamic Experiences: Rethinking Developer Enablement","summary":"","description":"Documentation has long been treated as a static, one-size-fits-all resource — something separate from the product itself. But developer expectations have evolved. They need speed, context, and self-serve experiences that feel as intuitive as the tools they’re using.\nIn this talk, we’ll explore how developer teams can shift from traditional, static documentation toward dynamic, adaptive experiences that reflect the user's context. We’ll cover practical use cases, emerging patterns in developer enablement, and how teams can make documentation feel like a true extension of the product — without overhauling everything at once.","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"2GXgw9ypSJ","lang":"en","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"addison","name":"Addison Schultz","x_account":"","organization":"GitBook","speaker_url":"https://devrelkaigi.org/en/speakers/addison","interview_youtube":""},{"objectId":"berakout-14","title":"Developer Communities Ship Products & Careers","summary":"","description":"How do you ship faster products and stronger careers at the same time? By investing in developer communities. I’ll share what we’ve learned building Dev Japan/Design Japan: how small, internal rituals (lightning talks, guilds, RFC clubs) compound into delivery wins, hiring flywheels, and retained talent—and how those communities can scale outward to the public, creating a feedback loop where external community engineers become future hires and contributors. Geared for both engineering leaders and individual contributors, this session shows the concrete practices that turn “community” into real product velocity and career growth.","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"gBlD1IVtJc","lang":"en","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"cavenmitchell","name":"Caven Cade Mitchell (ミッチー)","x_account":"","organization":"株式会社KATIX","speaker_url":"https://devrelkaigi.org/en/speakers/cavenmitchell","interview_youtube":""},{"objectId":"berakout-14","title":"Thank God it’s not LeetCode: Interviewing in the age of AI.","summary":"","description":"Too often, technical interviews feel like nightmare puzzles that measure how well someone has memorized algorithms instead of how they solve real problems. With Gilded Rose, we flipped the script: it’s messy legacy code with unclear rules, and the task is to bring order to that chaos. Candidates have to read, reason, and communicate, just like on the job, and that gives us a far clearer picture than a contrived brainteaser ever could.\n\nThis approach isn’t about evaluating coding ability, it’s about seeing how someone thinks under pressure, how they explain trade-offs in real time, and whether they can balance pragmatism with maintainability. It’s also resilient in an AI-heavy world; tools can suggest code, but they can’t articulate why a refactor matters or defend a design choice in front of a panel. After running this process many times, we’ve found it both fairer to candidates and more predictive for us as a company. By the end of this session, I hope you’ll see how a simple kata can evolve into a scalable, culture-aligned way of hiring that actually builds better teams.","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"O8H1xkUdz9","lang":"en","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"luigi","name":"Luigi Taira D.","x_account":"","organization":"KATIX Inc.","speaker_url":"https://devrelkaigi.org/en/speakers/luigi","interview_youtube":""},{"objectId":"berakout-14","title":"TBD","summary":"","description":"","type":"talk","category":"","level":"","reason":"","coc":"","record":"","no_support":"","user":"xEEYwCC6AK","lang":"ja","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"syoshidu","name":"Yoshizumi Shogo","x_account":"","organization":"LY Corporation","speaker_url":"https://devrelkaigi.org/ja/speakers/syoshidu","interview_youtube":""},{"objectId":"berakout-15","title":"Developerとの繋がりで拡がるエッジAIセンシングプラットフォームの可能性","summary":"エッジAIセンシングプラットフォーム：AITRIOSがローンチされて約3年。初めは法人向けサービスの性質上、ビジネス担当者に向けたメッセージが多かったのですが、徐々にDeveloperに向けた情報発信を増やしてきました。なぜ、Developerを重要視し始めたか、どのような施策を打ったか、それによってどのような変化があったかなどを若手＆DevRel初心者の目線からお話しします。","description":"エッジAIセンシングプラットフォーム：AITRIOSがローンチされて約3年。初めは法人向けサービスの性質上、ビジネス担当者に向けたメッセージが多かったのですが、徐々にDeveloperに向けた情報発信を増やしてきました。なぜ、Developerを重要視し始めたか、どのような施策を打ったか、それによってどのような変化があったかなどを若手＆DevRel初心者の目線からお話しします。","type":"talk","category":"business","level":"All","reason":"","coc":"","record":"","no_support":"","user":"81EZZqdTze","lang":"ja","status":"","cfp":"","createdAt":"","updatedAt":"","is_enabled":"","rating":"","review":true,"ACL":"","first_event":"","co_speaker":"","deadline":"","key":"","responseStatus":true,"slug":"yuta","name":"Yuta Nakazawa","x_account":"","organization":"Sony Semiconductor Solutions Corp.","speaker_url":"https://devrelkaigi.org/ja/speakers/yuta","interview_youtube":""}]