{
  "2": {
    "en": {
      "13:00": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Opening",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "13:10": [
        {
          "track": "A",
          "speaker_id": "3MVRfO42CJ",
          "title": "",
          "speaker": "Don Goodman",
          "profile_id": "Ez32KnWCMr",
          "session_title": "#N/A",
          "session_descirption": "I want to share some personal observations about how I've been able to bring my experience in devrel to a new, non-devrel role, as I think this would be helpful to folks who are in marketing (but not devrel), folks who might be contemplating a career shift, and to highlight some of the aspects of devrel that I think are bullshit.",
          "organization": "Formance"
        }
      ],
      "13:55": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "14:05": [
        {
          "track": "A",
          "speaker_id": "EQPFGsdPZG",
          "title": "",
          "speaker": "Ana Jimenez Santamaria",
          "profile_id": "RnyeckG5HQ",
          "session_title": "Getting Started with the Linux Foundation: Pathways for DevRel Practitioners",
          "session_descirption": "The Linux Foundation (LF) is home to world-class projects like Kubernetes, PyTorch, and Linux itself. But beyond code, it also fosters an ecosystem of working groups, programs and open collaborative initiatives where DevRel practitioners can contribute, learn, and strengthen their profession.\n\nIn this talk, Ana Jiménez, Senior Project Manager at the Linux Foundation, will showcase some entry points for DevRel practitioners involved in domains such as security, AI/ML, or open source strategy. She will also introduce the LF DevRel Foundation, a new initiative where participants collaboratively create resources (definitions, frameworks, and shared artifacts) that help elevate the practice of Developer Relations.\n\nThis session is designed for newcomers who want to learn more about how their DevRel skills, whether in community engagement, product advocacy, education, or technical support, can fit within the Linux Foundation’s ecosystem and to discover communities where they can get involved.",
          "organization": "Linux Foundation (TODO Group,  PyTorch Foundation)"
        },
        {
          "track": "B",
          "speaker_id": "GRNb61r42H",
          "title": "",
          "speaker": "Kazuhito Yokoi",
          "profile_id": "Dy4BTzVHAu",
          "session_title": "TBD",
          "session_descirption": "",
          "organization": "Hitachi Academy"
        }
      ],
      "14:35": [
        {
          "track": "A",
          "speaker_id": "2GXgw9ypSJ",
          "title": "",
          "speaker": "Addison Schultz",
          "profile_id": "oBYMqPuUKv",
          "session_title": "From Static Docs to Dynamic Experiences: Rethinking Developer Enablement",
          "session_descirption": "Documentation has long been treated as a static, one-size-fits-all resource — something separate from the product itself. But developer expectations have evolved. They need speed, context, and self-serve experiences that feel as intuitive as the tools they’re using.\nIn this talk, we’ll explore how developer teams can shift from traditional, static documentation toward dynamic, adaptive experiences that reflect the user's context. We’ll cover practical use cases, emerging patterns in developer enablement, and how teams can make documentation feel like a true extension of the product — without overhauling everything at once.",
          "organization": "GitBook"
        },
        {
          "track": "B",
          "speaker_id": "O8H1xkUdz9",
          "title": "",
          "speaker": "Luigi Taira D.",
          "profile_id": "adkE4tSf7v",
          "session_title": "Thank God it’s not LeetCode: Interviewing in the age of AI.",
          "session_descirption": "Too often, technical interviews feel like nightmare puzzles that measure how well someone has memorized algorithms instead of how they solve real problems. With Gilded Rose, we flipped the script: it’s messy legacy code with unclear rules, and the task is to bring order to that chaos. Candidates have to read, reason, and communicate, just like on the job, and that gives us a far clearer picture than a contrived brainteaser ever could.\n\nThis approach isn’t about evaluating coding ability, it’s about seeing how someone thinks under pressure, how they explain trade-offs in real time, and whether they can balance pragmatism with maintainability. It’s also resilient in an AI-heavy world; tools can suggest code, but they can’t articulate why a refactor matters or defend a design choice in front of a panel. After running this process many times, we’ve found it both fairer to candidates and more predictive for us as a company. By the end of this session, I hope you’ll see how a simple kata can evolve into a scalable, culture-aligned way of hiring that actually builds better teams.",
          "organization": "KATIX Inc."
        }
      ],
      "15:05": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "15:25": [
        {
          "track": "A",
          "speaker_id": "o0pqZMYSPo",
          "title": "",
          "speaker": "Avie Fukai",
          "profile_id": "Mt8wbgOHvq",
          "session_title": "Bridging the Culture Gap: Enabling Japan and Global Dev Teams to Thrive Together",
          "session_descirption": "Japan’s development culture values formality, hierarchy, and long-term trust. Global teams often prioritize speed, transparency, and async collaboration. These differences can cause tension, but they can also create opportunity.\n\nAs a Bridge Software Engineer and Internal Dev Advocate, I work closely with Japanese clients, managers, and offshore dev teams. I also mentor engineering managers and team leaders, supporting them in navigating and aligning with Japanese-style work practices to improve cross-cultural collaboration and team productivity.\n\nThrough this experience, I’ve learned how to translate not just language, but also expectations, priorities, and working styles—helping teams reduce friction and work more effectively together.\n\nIn this talk, I’ll share:\n\n- Real examples of where cultural gaps caused delays—or breakthroughs\n- How I support leaders in adapting to Japanese workflows without sacrificing their leadership style\n- Strategies to build psychological safety across borders\n- Communication tips for Japanese stakeholders and international developers\n-  Frameworks to align product, team, and customer goals despite cultural gaps\n\nIf you're involved in or planning cross-border dev projects, this session will offer practical strategies for making them work smoothly.",
          "organization": ""
        }
      ],
      "15:55": [
        {
          "track": "A",
          "speaker_id": "2IknnIHoVF",
          "title": "",
          "speaker": "Nimit Savant",
          "profile_id": "EGhKXgvYmn",
          "session_title": "The Uphill Battle: How Developer-Plus Companies Are Learning to Build Trust Through Education and Community",
          "session_descirption": "This session addresses the critical gap between traditional developer relations approaches and the realities of B2B business models. We'll explore how enterprise SaaS have successfully built developer communities and measured their impact on business growth.\n\nWhat Attendees Will Learn:\n\nFrameworks for measuring indirect developer influence on B2B sales cycles\n- How education is the pillar of a community \n- How to make developer trust your product with your developer community\n- Tactical approaches for content creation, event planning, and community building in B2B contexts\n- How to position developer evangelism as a strategic business function rather than a \"nice-to-have\"\n- How to leverage the community to become a continuous feedback for better developer experience of your product",
          "organization": "DevRev"
        }
      ],
      "16:25": [
        {
          "track": "A",
          "speaker_id": "LIbhUIhC31",
          "title": "",
          "speaker": "Siddhant Agarwal",
          "profile_id": "eandjkQGdM",
          "session_title": "Beyond Hello World: Designing DevRel for Real-World Impact",
          "session_descirption": "Too often, developer relations efforts stop at “Hello World”—introductory tutorials, launch blogs, and slick demos. While these are important entry points, they don’t guarantee lasting engagement or meaningful product adoption. So how do we move beyond the basics and design DevRel strategies that actually create impact?\n\nIn this talk, I’ll share practical frameworks and real-world stories on how to take developers from casual users to power contributors. From building feedback loops that influence product decisions, to running campaigns that spark sustained community involvement, we’ll walk through what it takes to build DevRel that’s not just visible—but valuable.\n\nWe’ll also explore the less glamorous but essential elements: internal advocacy, cross-functional alignment, and measuring the right outcomes. Whether you're part of a growing startup or a global org, this talk will equip you with strategies to create a DevRel flywheel that scales beyond swag and surface metrics—and starts delivering long-term developer success.",
          "organization": ""
        }
      ],
      "16:55": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "17:15": [
        {
          "track": "A",
          "speaker_id": "DG4aCsSYI2",
          "title": "",
          "speaker": "Animesh Pathak",
          "profile_id": "lAdYkutNk0",
          "session_title": "Boosting DevRel: Simple SEO, Scalable Programs, and Community Power",
          "session_descirption": "Developer Relations doesn’t have to require massive resources or overengineered initiatives. In this talk, I will break down how any team can:\n\n1. Leverage SEO to Attract Developers\n - Identify high-value keywords that align with real developer search behavior\n - Structure blog posts, tutorials, and documentation so search engines—and developers—can find your content effortlessly\n - Apply a simple SEO checklist to increase organic traffic within months\n\n2. Build Programs That Scale Like Lego\n - Design a “template” for hackathons, office hours, webinars, and workshops that can be reused globally\n - Automate invitation workflows, slide decks, and follow-up surveys so you can spin up new events in days rather than weeks\n- Optimize resource allocation so you don’t need to hire additional headcount to run a growing slate of DevRel initiatives\n\n3. Empower and Grow Your Community\n - Establish clear contribution guidelines, mentorship pairings, and small recognition programs (e.g., “Contributor of the Month”)\n - Align with local meetup organizers and open-source maintainers to co-create content and events\n - Leverage feedback loops—surveys, GitHub metrics, and direct outreach—to continuously refine programs and keep contributors engaged\n\n4. Measure, Iterate, and Improve\n - Track core metrics such as Monthly Active Developers (MAD), Pull-Request Velocity (PRV), and Event Feedback Scores (EFS)\n - Set up lightweight dashboards to monitor progress and identify bottlenecks\n - Iterate on program components (e.g., cadence, format, rewards) based on data, not intuition\n\nBy the end of this session, you will have a straightforward, repeatable playbook that leverages SEO, modular program design, and community collaboration to multiply your DevRel impact while maintaining operational efficiency.",
          "organization": "Harness Inc"
        }
      ],
      "17:45": [
        {
          "track": "A",
          "speaker_id": "LkpahEPGU7",
          "title": "",
          "speaker": "Taiji Hagino",
          "profile_id": "jAgvwNiLcx",
          "session_title": "Bridging the Gap: Why Developer Relations and Product Management Must Work Together",
          "session_descirption": "Developer Relations (DevRel) is often seen as a community-facing role focused on evangelism, education, and engagement. But what happens when DevRel is deeply integrated with Product Management (PM)? Magic.\n\nThis session will explore:\n\t•\tHow DevRel acts as a “real-time feedback loop” for product teams\n\t•\tWhy developer empathy is a strategic asset, not a soft skill\n\t•\tPractical collaboration models between DevRel and PM\n\t•\tReal-world examples of how developer feedback influenced product direction\n\t•\tHow to measure the joint impact of DevRel and PM initiatives\n\nBy the end, you’ll walk away with actionable ways to bring your DevRel and PM teams closer together—and make your products not only more developer-friendly, but more successful overall.",
          "organization": "HERE Technologies"
        }
      ],
      "18:15": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Closing",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ]
    },
    "ja": {
      "13:00": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Opening",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "13:10": [
        {
          "track": "C",
          "speaker_id": "b4FRxF0z2N",
          "title": "",
          "speaker": "戸倉彩",
          "profile_id": "lqLHc3rklx",
          "session_title": "Next-Gen DevRel：AI時代のビジネス成長エンジン",
          "session_descirption": "この講演では、DevRelが製品検討から導入・活用に至るまでITエンジニアと伴走し、従来の枠を超えた価値を創り出す取り組みを解説します。加えて、ITエンジニア同士が学び、共創する場からどのように新しいナレッジやイノベーションが生まれるのか、そしてAI時代においてDevRelが持つビジネス的価値と可能性を明らかにします。",
          "organization": "日本アイ・ビー・エム株式会社"
        }
      ],
      "13:55": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "14:05": [
        {
          "track": "A",
          "speaker_id": "D3q75jE4Gr",
          "title": "",
          "speaker": "横田真俊",
          "profile_id": "hABdd9zJgo",
          "session_title": "経営にあなたのDevRelが評価されるには",
          "session_descirption": "DevRelや技術広報に全力で取り組んでいるのに、なかなか経営から評価されない――そんな悩みを抱える方はいませんか？\n\n本セッションでは、経営がDevRel/技術広報をどのように見ているのかを整理しつつ、単なる「イベントや記事数」ではなく、経営にどのようにして評価してもらうかを解説します。\n\nDevRelが「趣味の延長」や「コストセンター」と捉えられてしまうのではなく、事業に価値をもたらす投資活動として評価されるためのヒントを持ち帰っていただける内容です。",
          "organization": "さくらインターネット"
        },
        {
          "track": "B",
          "speaker_id": "U3xB07K3OA",
          "title": "",
          "speaker": "Tetsuya Nakamura",
          "profile_id": "Vq6svdOdCP",
          "session_title": "エンタープライズエンジニアを変革する！マーケターが支えるDevRelの実践",
          "session_descirption": "社内で長年エンジニアとして専門性を発揮してきたメンバーが、最新技術に積極的に触れることなく業務を続けている中で、レガシーシステムの脱却やクラウド・AIの活用を求められると、何から始めればよいか戸惑うことや必要性を感じないことがあります。こうした状況において、社内で変革を推進する従業員や外部からの中途入社者が担う役割は非常に重要です。\n本セッションでは、社内での啓蒙活動を社内だけに留めず、外部に向けて発信することで、外部から自分たちの活動を知ってもらい、社外との関心や交流を生み出す方法をご説明します。また、社内外から変革を促すマーケターの役割についても紹介します。",
          "organization": "TOPPANデジタル株式会社"
        }
      ],
      "14:35": [
        {
          "track": "A",
          "speaker_id": "jrGfBpA0qG",
          "title": "",
          "speaker": "Hayato Miyazato",
          "profile_id": "LcoKT6JHja",
          "session_title": "テックブランディング戦略と実践",
          "session_descirption": "# セッション内容\n\n本セッションでは次の内容を含む予定です。\n1. テックブランディング強化を目的とした組織の立ち上げ\n2. 目標・目的管理\n3. 実施している取り組み\n4. 現時点での効果共有\n5. 今後の展望\n\n## 実施取り組み\n\n実施している取り組みとして、以下のような内容があります。\n- 並走の仕組み\n- 各チームの発信状況ヒアリング\n- ヒアリング結果を元にした発信催促\n- カンファレンス情報展開\n- 登壇ガイドラインまとめ\n\n## 並走の仕組み\n\nこの中でも並走の仕組みに力を入れています。\n「登壇に興味があるけど準備に不安を感じる人」「初めて登壇する人」「登壇準備にあたって他の人からの意見が欲しい人」などを中心にpf-techbrandingメンバーが登壇内容の案出しから登壇内容方針策定、資料レビューといった内容を登壇者と一緒になって実施します。  \n並走する中で、登壇する上でのアドバイスや諸注意を随時共有することで、登壇者の不安を取り除き登壇をより良いものにする一助になっています。  \n\n# 得られる学び\n\n本セッションで以下のような学びが得られるように努めます。\n1. テックブランディング戦略を立てるために必要な活動の一例\n2. 外部発信を促進するために必要なこと\n3. 発信慣れていない人がスムーズな外部発信をするためのサポート",
          "organization": ""
        },
        {
          "track": "B",
          "speaker_id": "5Uqne64gZk",
          "title": "",
          "speaker": "山上智志",
          "profile_id": "12OtY5yH7d",
          "session_title": "大企業の壁を壊す「生成AI×コミュニティ」の力 〜1000人規模の熱量が創る、ソフトバンク流 新しい \"共創\" のカタチ〜",
          "session_descirption": "生成AIの登場は、ビジネスに好機をもたらすと同時に、多くの企業に「組織の壁」という根深い課題を改めて浮き彫りにしました。\n部門間の連携不足、ノウハウの属人化、生まれるはずのシナジーが生まれない――。この課題は、大企業だけのものではありません。本セッションでは、この根深い課題に、私たちソフトバンクが「コミュニティの力」でいかに挑んでいるかをお話しします。\n主役は、グループ30社以上、1000人超が参加する「生成AI Working Group」です。\nしかし、これは単なる成功事例の紹介ではありません。私たちが目指したのは、ボトムアップの熱量を起点に、組織の縦割りを乗り越え、具体的な「共創」を生み出す土壌そのものを育むことでした。講演では、そのリアルな軌跡を共有します。\n- 「知る→相談する→事例化」のサイクルが、いかにして部門間の壁を溶かしたか\n- 非エンジニアが1000人規模のコミュニティをスケールさせた、泥臭い試行錯誤の記録\n- 経営層を活動の「オーナー」に変え、活動を全社的なうねりに変えた\n戦略組織を変え、人を繋ぎ、新たな価値を創出したい。そう願う全てのDevRel担当者、コミュニティマネージャーに、私たちの挑戦の記録をお届けします。\n\n対象となる聴講者:\n- 大企業やグループ経営において、全社的なAI/DX活用を推進する立場の方\n- 部門や企業の壁を越えたコラボレーションの創出に課題を感じているマネージャー\n- 社内コミュニティの立ち上げ、活性化、効果測定の方法に関心のある方\n- 生成AIの導入・活用を検討しているが、最初の一歩が踏み出せない企画・推進担当者\n\n聴講者が得られること:\n- 大企業特有の「サイロ化」を打破し、ボトムアップで生成AI活用を推進するための具体的なアプローチ。\n- 参加者のエンゲージメントを高める「知る→相談する→事例化」の活動サイクルの設計と運用ノウハウ。\n- 初心者向けセミナーから経営層向け報告会まで、多様なターゲットに響くイベントの企画術と実践例。",
          "organization": "ソフトバンク株式会社"
        }
      ],
      "15:05": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        },
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "15:25": [
        {
          "track": "A",
          "speaker_id": "FslDgbLsSQ",
          "title": "",
          "speaker": "村山弘城",
          "profile_id": "jKkcFCBorB",
          "session_title": "TechBLOGはじめました！ ― 社員と育てる、エンジニアコミュニティの舞台裏",
          "session_descirption": "NTTDATAでは、2025年4月からTechBLOGを始めました。\n立ち上げに際して、社内横断で「TechBLOGコミュニティ」を立ち上げ、\nエンジニアの発信をビジネスの力に変えることをより加速しようとしました。\n本講演では、\n・なぜ企業として技術者ブログに取り組むのか？\n・どのように社内のエンジニアを巻き込み、継続的な発信を仕組み化しているのか？\n・発信を通じて「信頼・共感」がどのようにビジネス価値に変わるのか？\nをお話しします。",
          "organization": "NTT DATA"
        },
        {
          "track": "B",
          "speaker_id": "2QyOolj5LN",
          "title": "",
          "speaker": "新村 剛史",
          "profile_id": "qjOY2nyDMe",
          "session_title": "TBD",
          "session_descirption": "",
          "organization": "アトラシアン株式会社"
        }
      ],
      "15:55": [
        {
          "track": "A",
          "speaker_id": "SCL6YoPqvX",
          "title": "",
          "speaker": "北川雅士",
          "profile_id": "sHmDLaFQAU",
          "session_title": "チームで行うDevRel活動 - 事業貢献をしながらユーザーに価値を届けるために",
          "session_descirption": "1.FindyのDevRelの取り組み \n- 組織規模 \n- 立ち上げの苦悩と課題\n- ミッション\n2.DevRelとMKの棲み分けと考え方\n-  海外と日本のDevRelの違いを、DevRelConferene NY参加から考える\n-  MKとの共同の仕方、CSやSalesとのつなぎ込み\n3. 個々人の特性を考えて組織マネジメントする\n- DevRelは総合力が求められる\n- プロフェッショナルな力を活かすことと、それをマネジメントすること\n- 開発組織の考え方と同じ組織づくり（チームトポロジーから考える）\n4. Findyのイベントやカンファレンスの取り組み\n5.まとめ",
          "organization": "ファインディ株式会社"
        },
        {
          "track": "B",
          "speaker_id": "81EZZqdTze",
          "title": "",
          "speaker": "仲澤悠太",
          "profile_id": "wdmjtqd9KA",
          "session_title": "Developerとの繋がりで拡がるエッジAIセンシングプラットフォームの可能性",
          "session_descirption": "エッジAIセンシングプラットフォーム：AITRIOSがローンチされて約3年。初めは法人向けサービスの性質上、ビジネス担当者に向けたメッセージが多かったのですが、徐々にDeveloperに向けた情報発信を増やしてきました。なぜ、Developerを重要視し始めたか、どのような施策を打ったか、それによってどのような変化があったかなどを若手＆DevRel初心者の目線からお話しします。",
          "organization": "ソニーセミコンダクタソリューションズ株式会社"
        }
      ],
      "16:25": [
        {
          "track": "A",
          "speaker_id": "i8G7XZIrt8",
          "title": "",
          "speaker": "新藤洋介",
          "profile_id": "HraU7XDFDv",
          "session_title": "外資4社でのレポーティングの実際",
          "session_descirption": "",
          "organization": "GPUStack Japan"
        },
        {
          "track": "B",
          "speaker_id": "XAtHCjJHZ7",
          "title": "",
          "speaker": "伴野智樹",
          "profile_id": "dBfheqGUqr",
          "session_title": "関係を育てる場。ハッカソン×コミュニティの交差点",
          "session_descirption": "ハッカソンは短期間で共創を加速させる「実験の場」、コミュニティは関係を育み続ける「持続の場」。ワークショップデザイナー、ハッカソンファシリテーターとして数多くの現場に立ち会ってきた経験から、両者の交差点にある価値や可能性を探ります",
          "organization": "一般社団法人MA"
        }
      ],
      "16:45": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "17:05": [
        {
          "track": "A",
          "speaker_id": "HaxzGHkVJr",
          "title": "",
          "speaker": "小田 祥平",
          "profile_id": "aZfCk7yZTX",
          "session_title": "成長フェーズで変わるDevRelの最適解 〜企業営利活動としてのDevRel戦略〜",
          "session_descirption": "DevRelは市場や企業の成長に合わせて変化する営利活動の一部であることは疑いようがありません。本セッションでは、企業規模別の最適なDevRel戦略を実践知に基づき解説します。\n\n小規模(特にスタートアップ)企業では、限られたリソースを考慮し、トップダウンセールスを優先すべき理由と、DevRelが不向きとなる状況を説明します。現場の技術者が製品の良さを理解しても、決裁権がなければ採用につながらない現実も踏まえ、例外的にDevRelが有効となるケースも紹介します。\n中規模企業においては、初期営業活動後の市場開拓フェーズで、トップダウンとボトムアップのハイブリッドアプローチが効果を発揮する仕組みを解説します。特に、意思決定者と現場のギャップを埋めるDevRelの役割と、既存顧客のノウハウを活用した複数チャネルでの情報発信の有効性について具体例を交えて紹介します。\n成熟企業では、深いユーザーコミュニティとの関係構築、チャンピオンプログラムの設計や外部とのコラボレーションによる活動の更なる促進など、エコシステム形成に向けた高度化するDevRel活動について解説します。\n\n各フェーズでの成功や失敗事例を交えながら、効果的にDevRelを開始・拡大するための実践的なフレームワークを提供します。",
          "organization": "mabl K.K."
        }
      ],
      "17:35": [
        {
          "track": "A",
          "speaker_id": "KE5MznFkl8",
          "title": "",
          "speaker": "中津川篤司",
          "profile_id": "zyYktDBcAB",
          "session_title": "リレーションからマーケティングへ。継続するDevRelのために行うべきこと",
          "session_descirption": "DevRelは、開発者との信頼関係を築き、製品やサービスへの理解と好感を深める役割として重要視されています。しかしその一方で、「関係構築」や「技術発信」に偏りすぎた活動は、ビジネスインパクトが見えにくくなり、結果として予算縮小や組織からの切り離しにつながるケースも少なくありません。\n\n本セッションでは、DevRel活動を長期的かつ安定的に継続するために欠かせない「ビジネスの視点」を取り上げます。売上や利益といった明確なKPIとの接続、DevRelのアウトプットとビジネスゴールの接続、他部門との連携、ROI（投資対効果）の可視化といった要素を通じて、DevRelの存在価値を社内に示す必要性を論じます。\n\n1. DevRelにおける「よくある誤解」：リレーション重視の限界  \n2. DevRelの活動とビジネスゴールのズレがもたらすリスク  \n3. 継続的な活動のための“マーケティング思考”の導入  \n4. 成果を示す指標設計と、他部門との連携方法  \n5. DevRelの「戦略的再定義」に向けた提案\n\n本セッションは、現場でDevRelに携わるエバンジェリストやアドボケイト、マーケター、またはマネジメント層の方に向けてお話しします。日々の活動をビジネスインパクトへと昇華させ、DevRelの継続可能性を高めるための視点とヒントを提供します。",
          "organization": "株式会社MOONGIFT"
        }
      ],
      "18:00": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Closing",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ]
    }
  },
  "3": {
    "en": {
      "11:00": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Opening",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "11:10": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Panel Discussion",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "11:55": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "12:10": [
        {
          "track": "A",
          "speaker_id": "a0dkE7vaBu",
          "title": "",
          "speaker": "Wassim SAMAD",
          "profile_id": "HCtx7Ur8VS",
          "session_title": "Scaling DevRel with AI: Smarter Workflows Using n8n & Open-Source Tools",
          "session_descirption": "Developer Relations is a dynamic field that requires managing content, engaging with communities, and providing support—all at scale. But as DevRel teams grow, so does the workload. How can we work smarter, not harder?  \n\nIn this session, we’ll explore how AI-powered automation can help DevRel professionals enhance their workflows using **n8n** and other open-source tools. You’ll learn how to:  \n\n- Automate community engagement with AI-driven responses  \n- Generate and repurpose content across platforms effortlessly  \n- Manage developer support with intelligent workflows  \n- Integrate AI tools seamlessly into your existing DevRel strategy  \n\nWhether you're a solo advocate or part of a growing DevRel team, this talk will equip you with practical automation techniques to **scale your impact without scaling your workload**. ",
          "organization": "Elestio"
        },
        {
          "track": "B",
          "speaker_id": "2Ih59qxbx1",
          "title": "",
          "speaker": "Siddharth Dayalwal",
          "profile_id": "yNXgJz7Tit",
          "session_title": "Scaling Impact, Not Burnout: Building Sustainable DevRel Programs that Empower Communities",
          "session_descirption": "As DevRel programs grow, many teams hit a wall—limited bandwidth, unclear KPIs, community fatigue, or internal misalignment. How can you design a DevRel strategy that scales with your community instead of on your community?\n\nIn this session, I’ll unpack:\n- How to design scalable ambassador and contributor programs\n- The systems and automations that support onboarding, engagement, and recognition\n- Aligning internal teams while keeping external community needs at the center\n- Practical frameworks for measuring success beyond vanity metrics\n- Real examples from managing Storyblok’s global ambassador program and DevRel campaigns\n\nI’ll share my learnings from building DevRel strategies for startups, open-source communities, and international programs—especially in APAC, India, and global ecosystems. Attendees will walk away with proven, repeatable frameworks they can immediately apply—whether they’re a solo DevRel or part of a growing team.",
          "organization": "Storyblok"
        }
      ],
      "12:40": [
        {
          "track": "A",
          "speaker_id": "e4pzCffXit",
          "title": "",
          "speaker": "Sumit Saurabh",
          "profile_id": "vrbR0fH9a4",
          "session_title": "Docs for the AI age",
          "session_descirption": "AI is transforming how developers discover, consume and use technical knowledge. \n\nGone are the days:\n- When developers would discover a niche tool on some Stack Overflow answer or a Reddit post,\n- When developers would spend hours going through your documentation to understand your product,\n- When developers would use your product even if the documentation wasn't good enough! (although it was never really the case anyway)\n\nMy talk focuses on how dev-tool companies must adapt to this changed landscape - one in which AI is an intermediary (between your product and developers) and a constant companion (of developers).\n\nI'll focus on strategies, tools and practical tips that I've used over the course of the past couple of years to ensure that your products remain discoverable, understandable, and effectively utilized in the AI age.\n\nI'll focus on the following key areas:\n1. Discoverability: Cut the noise, get to the point - Practical strategies to make tools and documentation findable among all the AI noise.\n2. Content optimization: Consumable by AI, understandable by devs - Your docs have to be accurately interpretable by AI as well as easily comprehensible by humans. Here's how you do that.\n3. AI sweet spots: Leave it to AI (if it does it well) - Opportunities for you to let AI do its thing.\n4. AI limitations: AI isn't magic. What now? - Handling the gaps created when AI struggles\n\nMy talk will deliver actionable insights for DevRel professionals, technical writers and product teams who want to ensure that their docs remain effective - even in the age of AI",
          "organization": "Lingo.dev"
        },
        {
          "track": "B",
          "speaker_id": "NyiE99KvnI",
          "title": "",
          "speaker": "Pratham Kumar",
          "profile_id": "PNUrudqaQC",
          "session_title": "Building API Experiences Your Developers Love",
          "session_descirption": "I have been in the API Developer Relations space since 2021. It's one of the most toughest Developer Relations field to manage. If you are a new React framework company, your DevRel efforts might be minial as everyone in the tech is general excited about the new frameworks or front-end technology. But API Developer Relations is hard to manage as API is the most boring technology. In this session, I want to present what are the some offerings along with the documentation that can help providing a standout API DX. This includes sandboxing, SDKs, Playground, clearer error messages, and beyond.\n\nI test a lot of API products so I want to show different API companies and how they are excelling in API DX space. Trust me, I am not going to be focused on my company for free promotion. I want this talk to be 100% organic and open.",
          "organization": "APILayer"
        }
      ],
      "13:10": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Lunch",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        },
        {
          "track": "C",
          "speaker_id": "",
          "title": "Lunch",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "14:40": [
        {
          "track": "A",
          "speaker_id": "mtAxEaTpkP",
          "title": "",
          "speaker": "Eeshaan Sawant",
          "profile_id": "eoPlSDPWCx",
          "session_title": "What if Your DevRel Could Also Write? PS: The Secret Weapon in DevRel",
          "session_descirption": "**What if your DevRel Engineer wasn’t just a speaker, demo builder, or community face, but also your strongest communicator on paper? **\n\nFor many developers, documentation is their first, and sometimes the only touchpoint with your product. It conveys your tone, your values, and your attention to detail. If your docs aren’t clear, accessible, and globally relevant, your community won’t be either. And yet, the people who craft this experience—the technical writers, are rarely acknowledged as part of the DevRel equation. \n\nThis talk shines a light on the overlooked role of technical writers in Developer Success. From first-touch onboarding to long-tail adoption, I’ll show how good docs are doing DevRel’s most critical work, quietly and at scale. I will also share how my experience as a technical writer organically led me to take on DevRel responsibilities, and why this hybrid model is more powerful (and sustainable) than most teams realise. \n\nThrough out this talk, we will dig into:\n* How technical writing impacts onboarding, adoption, and community health\n* Where and How DevRel teams are losing efficiency by not investing in writing\n* How to elevate technical writers as contributors in DevRel strategy, within the existing workflows, without changing your org chart.\n",
          "organization": "ONLYOFFICE"
        },
        {
          "track": "B",
          "speaker_id": "",
          "title": "LFX Workshop",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "15:10": [
        {
          "track": "A",
          "speaker_id": "Hml6XJCdZH",
          "title": "",
          "speaker": "Hrittik Roy",
          "profile_id": "iyDbjXcYmn",
          "session_title": "Beyond Documentation: Creating Immersive Learning Journeys for Developer Success",
          "session_descirption": "Static documentation isn’t broken, but it’s not enough. Developers don’t struggle because they can’t read docs; they struggle because docs don’t reflect how people actually learn.\n\nThis session is for DevRel professionals ready to rethink developer education through immersive, context-rich experiences. Drawing from real-world experience building learning environments in the CNCF community, we’ll explore how techniques like cognitive flow design, audience-journey mapping, and sandbox-based training can significantly improve how developers onboard, explore, and master complex technologies.\n\nWe’ll share patterns that go far beyond traditional tutorials: Kubernetes escape rooms, failure-forward labs, and scaffolded hands-on environments that have improved time to proficiency by up to 40 percent. These methods also help reinforce secure development practices and increase certification success. The result is learning that feels like play, builds confidence, and drives real adoption.\n\nThis talk is more than a case study. It offers a vision for how DevRel teams can lead the shift from passive documentation to active, measurable education. Attendees will learn how to design for developer flow, map learning journeys, and track outcomes that matter.\n\nYou’ll leave with practical blueprints and examples to make developer education more engaging, effective, and accessible so your docs don’t just explain, they truly teach.",
          "organization": ""
        },
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "15:40": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "16:00": [
        {
          "track": "A",
          "speaker_id": "gBlD1IVtJc",
          "title": "",
          "speaker": "Caven Cade Mitchell (ミッチー)",
          "profile_id": "xaFu8Ilyia",
          "session_title": "Developer Communities Ship Products & Careers",
          "session_descirption": "How do you ship faster products and stronger careers at the same time? By investing in developer communities. I’ll share what we’ve learned building Dev Japan/Design Japan: how small, internal rituals (lightning talks, guilds, RFC clubs) compound into delivery wins, hiring flywheels, and retained talent—and how those communities can scale outward to the public, creating a feedback loop where external community engineers become future hires and contributors. Geared for both engineering leaders and individual contributors, this session shows the concrete practices that turn “community” into real product velocity and career growth.",
          "organization": "株式会社KATIX"
        },
        {
          "track": "B",
          "speaker_id": "",
          "title": "LFX Workshop",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "16:30": [
        {
          "track": "A",
          "speaker_id": "LTw6TCG6Fl",
          "title": "",
          "speaker": "Juhi Singh",
          "profile_id": "kZNx0YjCAb",
          "session_title": "Managing Hybrid Communities: Balancing Local & Global Engagement",
          "session_descirption": "Building and managing a hybrid community—where some members meet in person while others engage online—is a big challenge in Developer Relations. The key is to ensure that both groups feel equally valued and connected.\nAt Freshworks, BrowserStack, and now Kong, I have worked on growing communities that are active both locally and globally. Through these experiences, I’ve learned:\nHow to support local community leaders while keeping a global approach.\nThe best mix of in-person events and online activities to keep engagement high.\nWays to scale community programs across different regions without losing authenticity.\nHow to measure success and keep improving the hybrid model.\nI’ll share real examples, including:\nBrowserStack's Testing Community – Running meetups while keeping a strong online presence.\nKong’s Global Community Strategy – Expanding local meetups in APAC while staying connected to the global developer network.\nFreshworks Developer Community – Engaging local developer advocates while ensuring a unified global experience.\n\nHow to support local communities while keeping them connected globally.\nThe right balance between in-person and online engagement.\nHow to measure and improve hybrid community strategies over time.",
          "organization": ""
        }
      ],
      "17:00": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "17:20": [
        {
          "track": "A",
          "speaker_id": "5wc6otH8XJ",
          "title": "",
          "speaker": "Ankita Saloni",
          "profile_id": "ibfoNSZbKO",
          "session_title": "Community Guide 2.0 - How communities are redefining DevRel and beyond.",
          "session_descirption": "Written from the lens of a community builder who has build and scaled some of the India's top tech communities, I've been a part of many coveted Tech programs that deal with student communities through DevRel with companies like The Hack Club, GitHub, Google and Microsoft. \n\nThis is a beginner friendly talk that will cover -\n\n• Why communities play an integral role in DevRel?\n\n• How to build a Inclusive and Diverse community.\n\n• Building a community from scratch and leading it.\n\n• Impact of communities on DevRel and Business success.\n\n• Accessibility and why it isn't just a buzzword.\n\n• The roadmap to become a community manager in DevRel \n\nKey takeaways from this talk -\n\n• How to build a community from scratch and scaling it further.\n\n• The shared interests and pain points of a community that defines its goals.\n\n• Challenges that arise while managing a community and how to deal with it\n\n• How to find resources to help your community.\n\n• How you define your community is how it defines you.\n\n• How to build trust and reliability in the community.\n\n• How to make your community a safe space for everyone.\n\n• Code of conduct and why it's necessary.\n\n• Are you a community Ninja? - Career options as a DevRel advocate and Community Manager.\n\n• Testimonials of some community builders and how communities shaped their life and careers.\n\nSo, whether you're a seasoned community builder or just starting out, this talk will give you a perspective of redefining communities through DevRel and some actionable tips to turn your community into a inclusive space for harbouring growth, creativity and innovation.",
          "organization": "Chegg"
        }
      ],
      "17:50": [
        {
          "track": "A",
          "speaker_id": "X2mAwBcx8H",
          "title": "",
          "speaker": "Awantika Nigam",
          "profile_id": "K92lPHcE0l",
          "session_title": "Creating the Human Face of Your Community",
          "session_descirption": "A community isn’t just about users interacting with your product —it’s about real people forming real connections. Too often, community engagement is reduced to metrics, feature requests, support tickets, and announcements, leaving little room for genuine relationships. In Community Management, the real challenge isn’t just attracting users but turning them into active, invested participants who feel like they belong.  \n\nThis session is about humanizing your community—making it a space where people don’t just follow updates but engage, contribute, and grow together. We’ll explore practical, actionable strategies to build transparency, encourage meaningful discussions, and foster a sense of ownership among your users. From open development roadmaps and interactive Q&A sessions to celebrating community contributions and sharing both wins and failures, this session will cover how to build trust, strengthen engagement, and create an ecosystem where developers feel valued.  \n\nWhat Attendees Will Learn: \n✅ Building Transparency & Trust – How sharing your product’s journey, challenges, and priorities makes users feel like true stakeholders.  \n✅Beyond Feature Requests– Moving past one-way feedback loops and fostering co-creation by involving users in product evolution.  \n✅ Engaging Developers Authentically – How to structure Q&A sessions, post-release discussions, and technical deep dives that go beyond just updates.  \n✅  Celebrating Community Contributions – Practical ways to highlight active members, showcase community-driven projects, and recognize meaningful engagement.  \n✅ Learning From Your Users – Encouraging discussions on workflows, tools, and challenges beyond your product to build a culture of shared knowledge.  \n✅ Building Real Conversations – Why open-ended discussions, thought-provoking questions, and transparent conversations help build lasting connections.  \n✅ The Role of Storytelling in Community Building – How to make your community feel more personal and relatable by sharing the human side of development.  \n\n",
          "organization": "Refact.ai"
        }
      ],
      "18:20": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Closing",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "15:30": [
        {
          "track": "B",
          "speaker_id": "",
          "title": "LFX Workshop",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ]
    },
    "ja": {
      "11:00": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Opening",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "11:10": [
        {
          "track": "A",
          "speaker_id": "BP4mppYozn",
          "title": "",
          "speaker": "松下 享平",
          "profile_id": "VblOGnUf9F",
          "session_title": "10年の共創が示す、これからの開発者と企業の関係 ～ Crossroad",
          "session_descirption": "",
          "organization": "株式会社ソラコム"
        }
      ],
      "11:55": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "12:10": [
        {
          "track": "A",
          "speaker_id": "DGn6Uu62kU",
          "title": "",
          "speaker": "大森裕介",
          "profile_id": "oIJ5C3fMPL",
          "session_title": "勉強会から始まった僕のDevRel~新卒エンジニアがつないだ2年間の軌跡~",
          "session_descirption": "2023年に新卒で入社し、フルリモート・複数チーム所属という環境の中で、私は孤独感と向き合っていました。自分の存在や価値をどうやってチームに示していけばいいのか。その問いの答えとしてたどり着いたのが、「自分が場をつくること」でした。\n\n私は社内勉強会を立ち上げ、社内での技術交流の場を増やし、少しずつ仲間とのつながりを築いていきました。やがてそれは社外勉強会への登壇、他社エンジニアとの交流へと発展していきます。\n\n活動を続ける中で、周囲のメンバーにも変化が現れました。「登壇してみたい」「他社の人と話してみたい」といった声が増え、私自身が直接つながるだけでなく、他のメンバーが社外との関係を築く後押しにもつながっていきました。\n\nこのセッションでは、\n\n- 入社直後に直面したコミュニケーションの壁\n- 社内勉強会をどのように立ち上げ、継続してきたか\n- 勉強会を通じて得られた関係性とその広がり\n- 社外発信へつながったきっかけと工夫\n- 現場エンジニア視点で見たDevRelの実践\n\nを、具体的なエピソードを交えてお話しします。",
          "organization": "株式会社ゆめみ"
        },
        {
          "track": "B",
          "speaker_id": "imJxVDHEB7",
          "title": "",
          "speaker": "Takeki Oizumi",
          "profile_id": "vbANw4ixZl",
          "session_title": "東京育ちの移住者が地域支部を飛び回ってコミュニティ過疎県で地元コミュニティを立ち上げた話し",
          "session_descirption": "東京育ちで東京勤務している中で、東京から2時間の郊外に移住しました。そんな中、コミュニティとの出会いが日本全国の各地域との繋がりを作るきっかけになりました。そんな日本全国の地域を飛び回る中、地元での繋がれる世界を夢見るようになりました。一方、地元は東京に比べると100分の1の規模のITコミュニティしかない砂漠のような「コミュニティ過疎県」でした。「なければ自分で作る」しかありません。覚悟、仲間との奇跡的な出会い、立ち上げ、そして、運営して見えたリアルな課題をお話しし、みなさんと地域コミュニティの未来について考えたいと思います。(日本語での登壇を予定しています)",
          "organization": "JAWS-UG栃木支部"
        }
      ],
      "12:40": [
        {
          "track": "A",
          "speaker_id": "9JvgN5WYp0",
          "title": "",
          "speaker": "高橋克己",
          "profile_id": "60knPeWfAv",
          "session_title": "エバンジェリスト9年生のリアル ― AI時代にどう生きるか",
          "session_descirption": "エバンジェリスト9年目の現実と理想。プロダクトの成長や時代の変化の中で、自分は何をしてきたのか、何を大事にしてきたのか。そしてこれからもエバンジェリストは必要なのか、AIに置き換えられるのか。9年目だからこそ話せる「リアル」と「問い」を共有し、プロのエバンジェリストとは何かを一緒に考えたいと思います。\n",
          "organization": "株式会社KDDIウェブコミュニケーションズ"
        },
        {
          "track": "B",
          "speaker_id": "3EEjk0B0MZ",
          "title": "",
          "speaker": "田中 翔",
          "profile_id": "Ba52PmagM8",
          "session_title": "Developer Advocate/Community Managerになるには？スキル・ロール・キャリアをグローバルな文脈から考える",
          "session_descirption": "海外のテック企業では Developer Relations は Developer Advocate / Community Manager など複数のロールに分かれ、それぞれ異なるRole & Responsibilityを持っています。本セッションでは定義について議論することは避け、今後のよりよい理解に向けて、\n登壇者の外資系複数企業でのCommunity Manager, Developer Advocateの経験を踏まえて、Role & Responsibilityの一例を紹介します。\n話す予定の内容は\n- これらのロールの違いと連携関係\n- 開発者やビジネスに対して果たす役割\n- それぞれに必要なスキルセット\nを解説します。さらに「どうやってその職種になれるか」というキャリアの道筋やDeveloperから各ロールに求めること簡単ですが紹介する予定です。",
          "organization": "Snowflake"
        }
      ],
      "13:10": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Lunch",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        },
        {
          "track": "B",
          "speaker_id": "",
          "title": "",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "14:40": [
        {
          "track": "A",
          "speaker_id": "xEEYwCC6AK",
          "title": "",
          "speaker": "善積 正伍",
          "profile_id": "A6E78ZYCgv",
          "session_title": "TBD",
          "session_descirption": "",
          "organization": "LINEヤフー株式会社"
        },
        {
          "track": "B",
          "speaker_id": "mVxEUaSX3W",
          "title": "",
          "speaker": "内田　太志",
          "profile_id": "xwU668H1xr",
          "session_title": "ゼロから始めるOSSプロダクト――国産ノーコード開発ツール『プリザンター』の共創と拡張",
          "session_descirption": "OSSとして公開された国産ノーコード・ローコード開発ツール「プリザンター」は、当初は一人の開発者の手によって始まりました。多くの国産OSSが趣味や副業レベルにとどまるなかで、プリザンターは事業化に成功し、現在では120社を超える企業とのパートナー契約を持つ商用サービスへと成長しています。\n\n本セッションでは、OSSプロダクトを立ち上げてマネタイズを実現するまでの道のり、コミュニティの支援を得るための工夫、そしてユーザがファンとなって開発チームに加わるというDevRelの理想的な形について紹介します。\n\nまた、プリザンターの特徴である「ノーコード・ローコード」による開発体験が、ユーザの拡張性やコミュニティ貢献をどのように後押ししたのかにも触れ、プロダクトを通じたエンジニアとユーザの共創の可能性を共有します。\n\n今後は、多言語化対応や海外ユーザへの普及も見据えており、DevRelの視点からグローバル展開に向けた戦略や課題についてもあわせてお話しします。",
          "organization": "株式会社インプリム"
        }
      ],
      "15:10": [
        {
          "track": "A",
          "speaker_id": "39VQ3zODHE",
          "title": "",
          "speaker": "北川 佳奈",
          "profile_id": "GfjbtLM8HA",
          "session_title": "ユーザーと一緒に育てる！1年半の実践で得たコミュニティ成長のヒント",
          "session_descirption": "コミュニティは企業だけで育てるものではなく、ユーザーと共に成長していくものです。本セッションでは、自社コミュニティを1年半運営する中で取り組んだ具体的な施策や成果、今後の展望についてお話します。既存ユーザー限定から未顧客やフリープランユーザーも参加可能な形に切り替え、リーダー候補との1on1を通じてリーダーに任命する取り組みや、リーダーを中心とした参加者のXでのポスト促進など、参加者と一緒にコミュニティを育ててきた実践を振り返り、成長を後押しするヒントをお伝えします。",
          "organization": "株式会社primeNumber"
        }
      ],
      "15:40": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "16:00": [
        {
          "track": "A",
          "speaker_id": "XPTDWeIGI9",
          "title": "",
          "speaker": "山﨑　亘",
          "profile_id": "qs8sidHvnZ",
          "session_title": "「発表する登壇」から「伝わる登壇」へ ─ 思いやりの「テクニック489」とは？",
          "session_descirption": "製品ベンダーのコミュニティ運営担当として「濃い参加者がなかなか増えない」とか「自走化しない」というのが悩みでした。そんな悩みが解決しないまま、縁あってIT製品ベンダーから離れ、別業界へ。\n\nプライベートで一参加者として飛び込んだのは、「クラフトビール」のコミュニティ。ITとは関係ないと思いきや、その名も「Crypto Beer Punks」でWeb3のDAOを目指して運営されている。コミュニティ運営も10年くらいやって来ているけど、この分野は全くの初心者。このDAO（分散自立型組織）というのがかつて抱えていたコミュニティの悩みの解決に繋がるのでは？と思い、NFTとか買ったことなかったけど、無謀にも運営にも飛び込んでみた。Decentralizedとか、Autonomousとか、これからのコミュニティ運営としてどう効果的な手法になっていくのか、自ら飛び込んでいった体験記を語ります。",
          "organization": "OwlPay Japan"
        }
      ],
      "16:30": [
        {
          "track": "A",
          "speaker_id": "SQb19MCemo",
          "title": "",
          "speaker": "nrs",
          "profile_id": "Rr5mh9YzHP",
          "session_title": "なぜあの開発者はDevRelに伴走し続けるのか――5年超の兼務経験からひも解く求められる環境と資質",
          "session_descirption": "# DevRelKaigi\n\n- はじめに\n    - 略歴\n        - 5年超のDevRel兼務\n        - 具体的なロール\n    - セッション趣旨\n        - 開発者の協力の重要性\n        - 求められる環境と本人の資質\n- 環境\n    - 組織の理解\n    - 業務調整\n    - 評価\n- 資質\n    - マインド\n    - スターになりうる要素\n- まとめ\n\n# はじめに\n\n開発者としてのDevRel兼務経験と、それを通じて見えてきた課題について説明します。\nまた、本セッションで取り上げる「組織が整備すべき環境」と「求められる開発者の資質」という2つの重要な要素について概説します。\n\n# 環境\n\n開発者がDevRel活動を継続するために必要な環境要件について、実体験を基に解説します。\n組織の理解、業務時間の確保、評価制度など、5年以上の兼務を通じて重要だと実感した組織的なサポートについて説明します。\n\n# 資質\n\n私自身の経験や、周囲の開発者の例を基に、DevRel活動を長期的に続けられる開発者の特徴について掘り下げます。\n技術的な深さやマインドセットはもちろん、活動を継続するために必要な考え方や行動様式について、具体例を交えながら解説します\n\n# まとめ\n\n本セッションで取り上げた環境面と資質面の両方の要素を踏まえ、DevRelチームと開発者の持続可能な協力関係を構築するためのポイントを整理します。",
          "organization": "株式会社コドモン"
        }
      ],
      "17:00": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Break",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ],
      "17:20": [
        {
          "track": "A",
          "speaker_id": "RrcCRQzGw2",
          "title": "",
          "speaker": "西馬一郎",
          "profile_id": "iC1FodbxKk",
          "session_title": "職種別ミートアップで社内から盛り上げる　アウトプット文化の醸成と関係強化",
          "session_descirption": "「職種別ミートアップ」とは、社内で異なる部門に所属する同じ職種のエンジニアが集まり、LT発表や情報交換、意見交換を行う場である。このミートアップの目的は、社内のエンジニア同士の関係を深め、知見の共有を行うことだ。\n\n50〜100人規模のエンジニアを抱える企業では、事業や職種単位に組織が形成されエンジニア同士の横の繋がりや関係性が希薄になる傾向がある。コロナ禍で在宅勤務が進み、対面で会う機会や集まる機会が失われたため、積極的な関わりが必要になった。そこで、筆者は職種別ミートアップを社内で定期的に開催、職種を変えフロントエンドやデザイナー、データサイエンス、セキュリティなどのミートアップを展開している。\n\n発表内容は、技術的な内容や開発、プロジェクトで得られた経験、チームの取り組みまで多様だ。個々の社員が自分の知識や経験を積極的に共有し、組織全体の成長を促進するアウトプット文化が醸成されてきている。\nまた、運営面でも最初はプロデューサー的な立場で企画し、運営メンバーを募り自走できるよう働きかけてきた。社内コミュニティも形成されつつある。\n\n副次的な効果として、社内のミートアップで発表したことを社外向けに話すメンバーも現れ始めた。社内でのアウトプットや関係強化が盛り上がりに繋がり、回り回って外部への発信やエンジニアの成長機会創出に発展している点を解説したい。",
          "organization": "日本経済新聞社"
        }
      ],
      "17:50": [
        {
          "track": "A",
          "speaker_id": "yKIQDHxj1L",
          "title": "",
          "speaker": "鈴木 章太郎",
          "profile_id": "mhyTDyamIa",
          "session_title": "越境するテック情熱：AI ツールとの出会いが導いた海外スタートアップとの協働",
          "session_descirption": "このセッションでは、デザインからコードを生成する革新的なAIツールとの出会いから始まり、海外スタートアップの日本市場展開の一翼を担うまでの軌跡を具体的に解説します。\n\n### お話しする内容\n1. **出会いのきっかけ**\n   - 業務でのモバイルアプリ開発における課題と海外AIツールの発見\n   - 技術的な興味から始まったフィードバックとCEOとの対話プロセス\n2. **関係性の変化と深化**\n   - 単なるユーザーから潜在顧客紹介者へのシフト\n   - 東証プライム上場企業を含む商談機会の創出手法\n   - 代理店契約から地域デベロッパーアドボケイトへの進化\n3. **実践的活動と成果**\n   - 技術セッションでの自発的なプロダクト紹介とその効果\n   - CEOの来日講演サポートの裏側\n   - 顧客ミーティングでの技術デモと通訳における工夫\n4. **得られた知見と教訓**\n   - 技術コミュニティ活動が国際的なビジネス機会につながるメカニズム\n   - 本業のスキル（Microsoftから現職までの20年のエバンジェリスト経験）を活かした副業展開の秘訣\n   - 海外スタートアップと日本企業の文化ギャップを埋める際の実践的アプローチ\n5. **これからの可能性**\n   - テクノロジストが「国際的な架け橋」となる新しいキャリアパスの展望\n   - 副業として技術アドボカシーを展開するための具体的なステップ\n### このセッションから得られるもの\n- 技術への情熱を副業やキャリア拡張につなげる実践的なヒント\n- 海外テックスタートアップとの関係構築における日本特有の課題と解決策\n- テクノロジストが持つ「説明力」「翻訳力」の新たな価値創造の可能性\n- 本業で培ったスキルを別の文脈で活かすためのマインドセットと行動パターン\n\n個人的な実体験に基づく具体的なストーリーを通じて、聴講者自身も自分の技術的関心から新たなキャリアチャンスを見出すきっかけとなるセッションを目指します。技術と人、国と国を「越境」することで生まれる新たな可能性について、共に考える場としたいと思います。",
          "organization": "FPTジャパンホールディングス"
        }
      ],
      "18:20": [
        {
          "track": "C",
          "speaker_id": "",
          "title": "Closing",
          "speaker": "",
          "profile_id": "",
          "session_title": "",
          "session_descirption": "",
          "organization": ""
        }
      ]
    }
  }
}