[
  {
    "title": "リレーションからマーケティングへ。継続するDevRelのために行うべきこと",
    "summary": "DevRelは「関係構築」「認知拡大」に重きが置かれがちですが、ビジネス視点が欠けると、継続的な投資は難しくなります。本セッションでは、活動初期からビジネスゴールを意識し、DevRelを“マーケティング”として捉える重要性と、その実践方法について考察します。",
    "description": "DevRelは、開発者との信頼関係を築き、製品やサービスへの理解と好感を深める役割として重要視されています。しかしその一方で、「関係構築」や「技術発信」に偏りすぎた活動は、ビジネスインパクトが見えにくくなり、結果として予算縮小や組織からの切り離しにつながるケースも少なくありません。\n\n本セッションでは、DevRel活動を長期的かつ安定的に継続するために欠かせない「ビジネスの視点」を取り上げます。売上や利益といった明確なKPIとの接続、DevRelのアウトプットとビジネスゴールの接続、他部門との連携、ROI（投資対効果）の可視化といった要素を通じて、DevRelの存在価値を社内に示す必要性を論じます。\n\n1. DevRelにおける「よくある誤解」：リレーション重視の限界  \n2. DevRelの活動とビジネスゴールのズレがもたらすリスク  \n3. 継続的な活動のための“マーケティング思考”の導入  \n4. 成果を示す指標設計と、他部門との連携方法  \n5. DevRelの「戦略的再定義」に向けた提案\n\n本セッションは、現場でDevRelに携わるエバンジェリストやアドボケイト、マーケター、またはマネジメント層の方に向けてお話しします。日々の活動をビジネスインパクトへと昇華させ、DevRelの継続可能性を高めるための視点とヒントを提供します。",
    "type": "talk",
    "level": "All",
    "category": "business",
    "reason": "中津川篤司は、2014年からDevRelのアウトソースサービスを提供し、これまで50社以上のDevRelをサポートしてきました。その活動を通じて見えてきたDevRelの限界と継続性を含んだお話ができるはずです。",
    "first_event": "",
    "co_speaker": false,
    "coc": true,
    "record": true,
    "no_support": true,
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "KE5MznFkl8"
    },
    "lang": "ja",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "ELGzJm5Ha5"
    },
    "createdAt": "2025-01-04T00:51:51.512Z",
    "updatedAt": "2025-05-24T06:56:09.838Z",
    "is_enabled": true,
    "rating": 4.666666666666667,
    "deadline": {
      "__type": "Date",
      "iso": "2025-05-31T06:55:33.304Z"
    },
    "key": "",
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "uR46pMpSpv"
  },
  {
    "title": "なぜあの開発者はDevRelに伴走し続けるのか――5年超の兼務経験からひも解く求められる環境と資質",
    "summary": "DevRelチームにとって、技術的な深さと信頼性を担保するため開発者との協力は不可欠です。\nしかし多くの場合、開発者の協力は一時的なものに留まり、継続的な関係を築くことが困難となっています。\n\n本セッションでは５年以上に渡って開発者としてDevRelを兼務してきた経験から、長期的にDevRelに関わり続けることができた要因について解説します。\nセッションでは大きく２つの事柄を取り扱います。\n\nひとつ目は組織が整備すべき環境面についてです。\nDevRelに協力する開発者に対してどのような支援が必要であったか、またどのような困難に直面するかについてをお話します。\n\nふたつ目は開発者自身の資質です。\n長期的な協力関係を築くためには、開発者自身の意識や取り組みも重要です。\nDevRelに関わる開発者に求められる資質やマインド、そしてスターになりうる開発者の要素についてお話します。\n\nDevRelチームと開発者との間に持続可能な協力関係を構築したい方、あるいは開発者の協力を得られてもすぐに関係が途切れてしまう、という課題を抱える方にとって、実践的な示唆を提供します。",
    "type": "talk",
    "level": "beginner",
    "category": "experience",
    "coc": true,
    "record": true,
    "no_support": true,
    "reason": "GMOインターネットグループのDevRelチーム立ち上げ時から参画し、5年以上に渡って開発者としての職務と両立しながらDevRel活動を継続してきました。\nその間、企業のDevRel戦略立案から実行まで幅広く関与し、特にカンファレンスにおけるプレゼンスの構築では中心的な役割を担ってきました。\n\n単なる登壇者としてだけでなく、コミュニティスタッフとしての活動や、カンファレンスの企画・運営まで手がけることで、DevRelの送り手と受け手の双方の視点を持っています。\nさらに、現役の開発者としての技術的な深さを保ちながら、これだけの期間DevRelに深く関わり続けている事例は極めて稀少です。\n\nこのような多面的な経験を通じて得られた知見は、開発者との継続的な協力関係を模索するDevRelチームにとって、実践的で具体的な示唆となるはずです。",
    "description": "# DevRelKaigi\n\n- はじめに\n    - 略歴\n        - 5年超のDevRel兼務\n        - 具体的なロール\n    - セッション趣旨\n        - 開発者の協力の重要性\n        - 求められる環境と本人の資質\n- 環境\n    - 組織の理解\n    - 業務調整\n    - 評価\n- 資質\n    - マインド\n    - スターになりうる要素\n- まとめ\n\n# はじめに\n\n開発者としてのDevRel兼務経験と、それを通じて見えてきた課題について説明します。\nまた、本セッションで取り上げる「組織が整備すべき環境」と「求められる開発者の資質」という2つの重要な要素について概説します。\n\n# 環境\n\n開発者がDevRel活動を継続するために必要な環境要件について、実体験を基に解説します。\n組織の理解、業務時間の確保、評価制度など、5年以上の兼務を通じて重要だと実感した組織的なサポートについて説明します。\n\n# 資質\n\n私自身の経験や、周囲の開発者の例を基に、DevRel活動を長期的に続けられる開発者の特徴について掘り下げます。\n技術的な深さやマインドセットはもちろん、活動を継続するために必要な考え方や行動様式について、具体例を交えながら解説します\n\n# まとめ\n\n本セッションで取り上げた環境面と資質面の両方の要素を踏まえ、DevRelチームと開発者の持続可能な協力関係を構築するためのポイントを整理します。",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "SQb19MCemo"
    },
    "lang": "ja",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "ELGzJm5Ha5"
    },
    "createdAt": "2025-02-10T13:28:38.797Z",
    "updatedAt": "2025-05-24T08:55:33.755Z",
    "is_enabled": true,
    "rating": 3.8333333333333335,
    "deadline": {
      "__type": "Date",
      "iso": "2025-05-31T07:24:13.258Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "PAUiFNTlj6"
  },
  {
    "title": "Scaling DevRel with AI: Smarter Workflows Using n8n & Open-Source Tools",
    "type": "talk",
    "level": "Intermediate",
    "category": "devrel",
    "summary": "As DevRel scales, so does the workload. In this session, we’ll dive into practical ways AI and automation can help—from handling community queries with AI chatbots to automating personalized responses for developer outreach. See how open-source solutions like n8n can supercharge your DevRel strategy.",
    "description": "Developer Relations is a dynamic field that requires managing content, engaging with communities, and providing support—all at scale. But as DevRel teams grow, so does the workload. How can we work smarter, not harder?  \n\nIn this session, we’ll explore how AI-powered automation can help DevRel professionals enhance their workflows using **n8n** and other open-source tools. You’ll learn how to:  \n\n- Automate community engagement with AI-driven responses  \n- Generate and repurpose content across platforms effortlessly  \n- Manage developer support with intelligent workflows  \n- Integrate AI tools seamlessly into your existing DevRel strategy  \n\nWhether you're a solo advocate or part of a growing DevRel team, this talk will equip you with practical automation techniques to **scale your impact without scaling your workload**. ",
    "reason": "I'm actively using automation, AI, and n8n to improve my DevRel work, from managing community engagement to automating content distribution and support tasks. I’ve built real-world workflows that help scale interactions and reduce repetitive work using open-source tools.\n\nFor Elestio I run a weekly open-source platform overview on YouTube, where I introduce new technologies to developers. Made it grow into 19,000 subscribers, giving me experience in explaining technical topics in an engaging and practical way.\n\nWith my hands-on experience, I can show DevRel professionals how to use AI and automation to save time, boost efficiency, and focus on what really matters—engaging with developers.",
    "coc": true,
    "record": true,
    "no_support": true,
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "a0dkE7vaBu"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "ELGzJm5Ha5"
    },
    "createdAt": "2025-03-24T11:08:24.289Z",
    "updatedAt": "2025-05-26T07:31:23.764Z",
    "is_enabled": true,
    "rating": 4,
    "deadline": {
      "__type": "Date",
      "iso": "2025-05-31T07:46:46.261Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      },
      "role:Speaker2025": {
        "write": true
      }
    },
    "objectId": "0GlJlAPMaL"
  },
  {
    "title": "Creating the Human Face of Your Community",
    "type": "talk",
    "level": "All",
    "category": "community",
    "reason": "With over four years of hands-on experience in community building in EdTech and AI Industry and my role as a chapter moderator for CMX Connect Delhi, I’ve spent years working closely with developers, open-source contributors, and tech communities—figuring out what truly makes people stay, engage, and feel like they belong.  \n\nThis talk comes from real, lived experience, not just theory. I’ve seen communities thrive when they feel human, and I’ve also seen them struggle when engagement is reduced to just numbers and updates. Through trial, error, and countless conversations, I’ve learned what actually works—how to build trust, create spaces where people genuinely want to participate, and turn passive users into active collaborators.  \n\nThis session is about sharing those hard-earned lessons so that you can build a community that isn’t just active, but deeply connected and invested in what you’re creating.",
    "first_event": "I’ve spoken on community leadership and engagement at events like CMX Connect Delhi : https://events.cmxhub.com/events/details/cmx-delhi-presents-inspire-amp-connect-stories-of-community-leadership/ ",
    "coc": true,
    "record": true,
    "no_support": true,
    "summary": "A true community isn’t built on announcements and support tickets—it’s built on genuine connections. Too often, engagement is reduced to numbers, while the real challenge is making people feel like they belong.  \n\nThis session is about making your community feel human, turning passive users into active contributors. We’ll explore open development, real conversations, and celebrating the people who shape your ecosystem. Walk away with actionable strategies to  build trust, foster meaningful participation, and create a space where developers aren’t just users—they’re part of the journey.\n",
    "description": "A community isn’t just about users interacting with your product —it’s about real people forming real connections. Too often, community engagement is reduced to metrics, feature requests, support tickets, and announcements, leaving little room for genuine relationships. In Community Management, the real challenge isn’t just attracting users but turning them into active, invested participants who feel like they belong.  \n\nThis session is about humanizing your community—making it a space where people don’t just follow updates but engage, contribute, and grow together. We’ll explore practical, actionable strategies to build transparency, encourage meaningful discussions, and foster a sense of ownership among your users. From open development roadmaps and interactive Q&A sessions to celebrating community contributions and sharing both wins and failures, this session will cover how to build trust, strengthen engagement, and create an ecosystem where developers feel valued.  \n\nWhat Attendees Will Learn: \n✅ Building Transparency & Trust – How sharing your product’s journey, challenges, and priorities makes users feel like true stakeholders.  \n✅Beyond Feature Requests– Moving past one-way feedback loops and fostering co-creation by involving users in product evolution.  \n✅ Engaging Developers Authentically – How to structure Q&A sessions, post-release discussions, and technical deep dives that go beyond just updates.  \n✅  Celebrating Community Contributions – Practical ways to highlight active members, showcase community-driven projects, and recognize meaningful engagement.  \n✅ Learning From Your Users – Encouraging discussions on workflows, tools, and challenges beyond your product to build a culture of shared knowledge.  \n✅ Building Real Conversations – Why open-ended discussions, thought-provoking questions, and transparent conversations help build lasting connections.  \n✅ The Role of Storytelling in Community Building – How to make your community feel more personal and relatable by sharing the human side of development.  \n\n",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "X2mAwBcx8H"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "ELGzJm5Ha5"
    },
    "createdAt": "2025-03-26T19:40:30.045Z",
    "updatedAt": "2025-05-24T08:54:53.692Z",
    "is_enabled": true,
    "rating": 4.285714285714286,
    "deadline": {
      "__type": "Date",
      "iso": "2025-05-31T07:29:18.953Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "h50apSumgr"
  },
  {
    "record": true,
    "no_support": true,
    "coc": true,
    "type": "talk",
    "level": "beginner",
    "category": "community",
    "title": "職種別ミートアップで社内から盛り上げる　アウトプット文化の醸成と関係強化",
    "summary": "「職種別ミートアップ」とは、異なる部門に所属する同じ職種のエンジニアが集まり、LT発表や情報交換、意見交換を行う場である。このミートアップの目的は、エンジニア同士の関係を深め、知見を共有することだ。筆者は職種別ミートアップを定期的に開催し、フロントエンドやデザイナー、セキュリティなどのミートアップを展開している。発表内容は技術的な内容やプロジェクトで得られた経験など多岐にわたり、アウトプット文化が醸成されている。\n\n運営面ではプロデューサー的な立場で企画し、運営メンバーを募り、自走できるよう働きかけている。社内コミュニティも形成されつつあり、副次的な効果として、社内のミートアップで発表した内容を社外向けに話すメンバーも現れ始めた。社内でのアウトプットや関係強化がベースとなり、外部発信やエンジニアの成長機会創出に発展している。",
    "description": "「職種別ミートアップ」とは、社内で異なる部門に所属する同じ職種のエンジニアが集まり、LT発表や情報交換、意見交換を行う場である。このミートアップの目的は、社内のエンジニア同士の関係を深め、知見の共有を行うことだ。\n\n50〜100人規模のエンジニアを抱える企業では、事業や職種単位に組織が形成されエンジニア同士の横の繋がりや関係性が希薄になる傾向がある。コロナ禍で在宅勤務が進み、対面で会う機会や集まる機会が失われたため、積極的な関わりが必要になった。そこで、筆者は職種別ミートアップを社内で定期的に開催、職種を変えフロントエンドやデザイナー、データサイエンス、セキュリティなどのミートアップを展開している。\n\n発表内容は、技術的な内容や開発、プロジェクトで得られた経験、チームの取り組みまで多様だ。個々の社員が自分の知識や経験を積極的に共有し、組織全体の成長を促進するアウトプット文化が醸成されてきている。\nまた、運営面でも最初はプロデューサー的な立場で企画し、運営メンバーを募り自走できるよう働きかけてきた。社内コミュニティも形成されつつある。\n\n副次的な効果として、社内のミートアップで発表したことを社外向けに話すメンバーも現れ始めた。社内でのアウトプットや関係強化が盛り上がりに繋がり、回り回って外部への発信やエンジニアの成長機会創出に発展している点を解説したい。",
    "reason": "私は西馬一郎と申します。Developer Relations の考え方を学び実践するDevRel/Tokyo に継続的に参加しDevRelについて学んできた。参加回数は220回以上。自身の発表を通じたアウトプットやミートアップ参加者と積極的に意見交換を行っている。",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "RrcCRQzGw2"
    },
    "lang": "ja",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "ELGzJm5Ha5"
    },
    "createdAt": "2025-03-30T08:20:51.708Z",
    "updatedAt": "2025-05-24T07:36:51.832Z",
    "is_enabled": true,
    "rating": 4.166666666666667,
    "deadline": {
      "__type": "Date",
      "iso": "2025-05-31T07:06:53.928Z"
    },
    "review": true,
    "key": null,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "fKzurzPHWW"
  },
  {
    "title": "エンタープライズエンジニアを変革する！マーケターが支えるDevRelの実践",
    "summary": "新しい技術やトレンドを追い求めることは、エンジニアにとって必要不可欠です。また自社の技術力をアピールするために、エンジニアが情報発信することは効果的な方法です。そのためにエンジニアが情報収集や発信を自ら行なっていくのは、日常業務だけでは得られない刺激が必要だと考えます。\n本セッションでは、エンタープライズ企業のエンジニアがいかにして社外の情報を効果的にキャッチアップし、自ら情報発信を行ってもらうために、社内での啓蒙活動以外に効果的な施策とマーケターが支援できるDevRel活動を具体的に紹介します。エンジニアがイベントでの登壇や情報発信を積極的に行うための実践的なアプローチを学び、企業内のDevRel活動を次のレベルへと引き上げましょう。",
    "description": "社内で長年エンジニアとして専門性を発揮してきたメンバーが、最新技術に積極的に触れることなく業務を続けている中で、レガシーシステムの脱却やクラウド・AIの活用を求められると、何から始めればよいか戸惑うことや必要性を感じないことがあります。こうした状況において、社内で変革を推進する従業員や外部からの中途入社者が担う役割は非常に重要です。\n本セッションでは、社内での啓蒙活動を社内だけに留めず、外部に向けて発信することで、外部から自分たちの活動を知ってもらい、社外との関心や交流を生み出す方法をご説明します。また、社内外から変革を促すマーケターの役割についても紹介します。",
    "type": "talk",
    "level": "All",
    "category": "marketing",
    "coc": true,
    "record": true,
    "no_support": true,
    "first_event": "",
    "reason": "家具屋からエンジニアに転身し、その後マーケティング・広報に従事。前職では、クラウド利用をユーザーに推進するトレーニング部門拡大として業務を行なっておりましたが、社内社外を関わらず自社のサービスを知ってもらうために自らエンジニアとして再始動し、マーケティングに加えてAWSの資格取得や技術本の執筆などチームのブランディングを向上した経験を合わせてお話ししたいと考えております。",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "U3xB07K3OA"
    },
    "lang": "ja",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "ELGzJm5Ha5"
    },
    "createdAt": "2025-03-31T00:38:33.211Z",
    "updatedAt": "2025-05-26T04:36:27.865Z",
    "is_enabled": true,
    "rating": 3.6666666666666665,
    "deadline": {
      "__type": "Date",
      "iso": "2025-05-31T07:06:48.042Z"
    },
    "review": true,
    "key": null,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      },
      "role:Speaker2025": {
        "write": true
      }
    },
    "objectId": "C3zRd7gwCS"
  },
  {
    "title": "成長フェーズで変わるDevRelの最適解 〜企業営利活動としてのDevRel戦略〜",
    "type": "talk",
    "level": "All",
    "category": "devrel",
    "coc": true,
    "record": true,
    "no_support": true,
    "description": "DevRelは市場や企業の成長に合わせて変化する営利活動の一部であることは疑いようがありません。本セッションでは、企業規模別の最適なDevRel戦略を実践知に基づき解説します。\n\n小規模(特にスタートアップ)企業では、限られたリソースを考慮し、トップダウンセールスを優先すべき理由と、DevRelが不向きとなる状況を説明します。現場の技術者が製品の良さを理解しても、決裁権がなければ採用につながらない現実も踏まえ、例外的にDevRelが有効となるケースも紹介します。\n中規模企業においては、初期営業活動後の市場開拓フェーズで、トップダウンとボトムアップのハイブリッドアプローチが効果を発揮する仕組みを解説します。特に、意思決定者と現場のギャップを埋めるDevRelの役割と、既存顧客のノウハウを活用した複数チャネルでの情報発信の有効性について具体例を交えて紹介します。\n成熟企業では、深いユーザーコミュニティとの関係構築、チャンピオンプログラムの設計や外部とのコラボレーションによる活動の更なる促進など、エコシステム形成に向けた高度化するDevRel活動について解説します。\n\n各フェーズでの成功や失敗事例を交えながら、効果的にDevRelを開始・拡大するための実践的なフレームワークを提供します。",
    "summary": "DevRelは万能ではなく、企業の成長段階によって効果と実施すべき方法が大きく異なります。本セッションでは、スタートアップから成熟した企業まで各フェーズにおけるDevRelの位置づけと最適なアプローチを解説します。\n特に企業の営利活動としてのDevRelに焦点を当て、トップダウン・ボトムアップの使い分け、リソース配分、外部とのコラボレーション戦略などの現場で培った知見を共有します。成功するDevRelを始める「最適なタイミング」を見極める視点を提供します。",
    "reason": "日系システムインテグレータに所属していた時からDevRelに関わりを持ち、大規模外資ITツールベンダ、スタートアップ外資ITツールベンダとDevRelを中心に添えてキャリアを変遷してきました。様々な視点でDevRelを捉える機会に恵まれ、思考しながら都度トライアンドエラーを繰り返しています。その間にはDevRel以外の企業活動を行うことも多くありました。それらのノウハウをまとめ、企業活動全体におけるDevRelの立ち位置やその最適化について、過去の経験やTipsを共有することができます。",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "HaxzGHkVJr"
    },
    "lang": "ja",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "ELGzJm5Ha5"
    },
    "createdAt": "2025-03-31T07:46:36.102Z",
    "updatedAt": "2025-05-24T10:03:05.945Z",
    "is_enabled": true,
    "rating": 4.6,
    "deadline": {
      "__type": "Date",
      "iso": "2025-05-31T10:01:44.117Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "fDa0wIb3f3"
  },
  {
    "summary": "DMMのプラットフォーム開発本部ではコミュニティ運営や発信活動を積極的に実施するメンバーが少なく、専任でもないため個人のやる気や業務状況に大きく依存しているという問題がありました。\nその状況の中、テックブランディング強化の必要性を感じたメンバーでpf-techbranding組織が結成されました。\n本セッションでは、pf-techbrandingの立ち上げ時の目標・目的整理から実際にテックブランディング強化を目的とした取り組み、それらの取り組みによる効果と今後の展望を紹介します。",
    "title": "テックブランディング戦略と実践",
    "type": "talk",
    "description": "# セッション内容\n\n本セッションでは次の内容を含む予定です。\n1. テックブランディング強化を目的とした組織の立ち上げ\n2. 目標・目的管理\n3. 実施している取り組み\n4. 現時点での効果共有\n5. 今後の展望\n\n## 実施取り組み\n\n実施している取り組みとして、以下のような内容があります。\n- 並走の仕組み\n- 各チームの発信状況ヒアリング\n- ヒアリング結果を元にした発信催促\n- カンファレンス情報展開\n- 登壇ガイドラインまとめ\n\n## 並走の仕組み\n\nこの中でも並走の仕組みに力を入れています。\n「登壇に興味があるけど準備に不安を感じる人」「初めて登壇する人」「登壇準備にあたって他の人からの意見が欲しい人」などを中心にpf-techbrandingメンバーが登壇内容の案出しから登壇内容方針策定、資料レビューといった内容を登壇者と一緒になって実施します。  \n並走する中で、登壇する上でのアドバイスや諸注意を随時共有することで、登壇者の不安を取り除き登壇をより良いものにする一助になっています。  \n\n# 得られる学び\n\n本セッションで以下のような学びが得られるように努めます。\n1. テックブランディング戦略を立てるために必要な活動の一例\n2. 外部発信を促進するために必要なこと\n3. 発信慣れていない人がスムーズな外部発信をするためのサポート",
    "level": "All",
    "category": "community",
    "coc": true,
    "record": true,
    "no_support": true,
    "reason": "pf-techbrandingの立ち上げ者の一人であり、以前から発信者を増やすにはどうしたら良いかを考えていました。\nテックブランディング強化に向けて必要なことを考え、実施してきたからこそ話せる内容があると考えています。",
    "co_speaker": true,
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "jrGfBpA0qG"
    },
    "lang": "ja",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "ELGzJm5Ha5"
    },
    "createdAt": "2025-03-31T12:44:20.726Z",
    "updatedAt": "2025-05-24T07:44:49.726Z",
    "is_enabled": true,
    "rating": 3.6666666666666665,
    "deadline": {
      "__type": "Date",
      "iso": "2025-05-31T07:23:02.778Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "wbgvvV4VXJ"
  },
  {
    "type": "talk",
    "level": "Intermediate",
    "category": "devrel",
    "first_event": "No",
    "coc": true,
    "record": true,
    "no_support": true,
    "title": "Docs for the AI age",
    "summary": "Like most aspects of our lives, AI is also transforming how developers consume docs. My talk will focus on how dev-tool companies can leverage this transition to ensure that their target customers (developers) use their products effectively.\n\nI'll touch upon the following:\n- Key areas where AI delivers well\n- The human factor (Make AI work for you while maintaining the human touch)\n- What to do when AI struggles (how to deal with problems like misinformation, context loss, hallucinations etc)\n\nAll in all, I feel like this talk can deliver tremendous value to my fellow devrel professionals who will create documentation that technocrats around the world will use, in an AI-assisted fashion, of course!",
    "description": "AI is transforming how developers discover, consume and use technical knowledge. \n\nGone are the days:\n- When developers would discover a niche tool on some Stack Overflow answer or a Reddit post,\n- When developers would spend hours going through your documentation to understand your product,\n- When developers would use your product even if the documentation wasn't good enough! (although it was never really the case anyway)\n\nMy talk focuses on how dev-tool companies must adapt to this changed landscape - one in which AI is an intermediary (between your product and developers) and a constant companion (of developers).\n\nI'll focus on strategies, tools and practical tips that I've used over the course of the past couple of years to ensure that your products remain discoverable, understandable, and effectively utilized in the AI age.\n\nI'll focus on the following key areas:\n1. Discoverability: Cut the noise, get to the point - Practical strategies to make tools and documentation findable among all the AI noise.\n2. Content optimization: Consumable by AI, understandable by devs - Your docs have to be accurately interpretable by AI as well as easily comprehensible by humans. Here's how you do that.\n3. AI sweet spots: Leave it to AI (if it does it well) - Opportunities for you to let AI do its thing.\n4. AI limitations: AI isn't magic. What now? - Handling the gaps created when AI struggles\n\nMy talk will deliver actionable insights for DevRel professionals, technical writers and product teams who want to ensure that their docs remain effective - even in the age of AI",
    "reason": "In my career of 3 years as a DevRel professional, documentation has been one of my core areas of expertise!\n\nI've worked at 3 startups so far and have crafted documentation for two of them - once as a contributor and once as the project leader.\n\nThe documentation I've created has been read by hundreds of thousands of technocrats, not to mention the AI agents who have been trained on these resources to deliver contextual results to user queries.\n\nIn my unique experience in both the pre-AI documentation era and the current transition phase, gives me firsthand insight into this transformation, and how to make the most of it.\n\nI've witnessed how developer journeys have evolved from manual searching through docs to AI-assisted knowledge acquisition and armed with this knowledge, I've created docs that have been praised by our customers, our CTO, various engineering teams and our sales teams (Pro tip: Good docs make the lives of sales team easier).\n\nI've also previously collaborated with the minds behind some popular AI agent teams to understand how content is processed, indexed and served, giving me practical knowledge of what works and what's fluff.\n\nThis blend of practical experiences at the intersection of documentation and AI, gives me a unique vantage point to guide my fellow DevRel professionals through this pivotal transition, helping them navigate and harness the transformative potential of AI-enhanced documentation!",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "e4pzCffXit"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "ELGzJm5Ha5"
    },
    "createdAt": "2025-03-31T16:41:00.083Z",
    "updatedAt": "2025-05-26T11:20:56.235Z",
    "is_enabled": true,
    "rating": 4.166666666666667,
    "deadline": {
      "__type": "Date",
      "iso": "2025-05-31T07:25:25.055Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      },
      "role:Speaker2025": {
        "write": true
      }
    },
    "objectId": "R1zHmCWRTm"
  },
  {
    "title": "Community Guide 2.0 - How communities are redefining DevRel and beyond.",
    "summary": "This talk explores the 'why' and 'how' of developer communities and why they are crucial for DevRel success. From dealing with the challenges that comes with managing the communities to bridging the gap between companies and developers through DevRel, a community builder often has to wear multiple hats, juggling between planning, execution and management in-between.\nWe will talk about the micro-details that culminate to form a bigger picture of community and some actionable strategies to cultivate inclusive, engaged, and diverse communities. By the end of the talk, the attendees will get key takeaways, along with the tools and confidence to build, or rebuild a community that thrives—not just survives. ",
    "type": "talk",
    "level": "All",
    "category": "community",
    "reason": "I have been a part of community based student partner programs of multiple tech giants including Microsoft, GitHub, Google, The Hack Club and a few others. I have 4+ years of experience building and managing communities, and I've mentored more than 10k+ students and professionals so far, be it through hackathons, workshops, webinars or hands-on sessions. I've managed and scaled some of the most popular tech communities in India and I'm constantly working towards building inclusive and diverse communities. I've also worked with some NGOs in my city that work for the upliftment and empowerment of under-represented communities, with an aim to make technology more accessible for them. With a diverse experience in building and scaling multiple tech and non-tech communities, I am willing to share my journey and learnings as a community builder with other members of the DevRel ecosystem through this session and I feel that it could be useful for people who are willing to step into community building and management as DevRel enthusiasts.",
    "coc": true,
    "record": true,
    "no_support": true,
    "description": "Written from the lens of a community builder who has build and scaled some of the India's top tech communities, I've been a part of many coveted Tech programs that deal with student communities through DevRel with companies like The Hack Club, GitHub, Google and Microsoft. \n\nThis is a beginner friendly talk that will cover -\n• Why communities play an integral role in DevRel?\n• How to build a Inclusive and Diverse community.\n• Building a community from scratch and leading it.\n• Bridging the gap between companies and communities.\n• Impact of communities in DevRel and buisness success.\n• Accessibility and why it isn't just a buzzword.\n• The roadmap to become a community manager in DevRel.\n\nKey takeaways from this talk -\n• How to build a community from scratch and scaling it further.\n• The shared interests and pain points of a community that defines its goals.\n• Challenges that arise while managing a community and how to deal with it.\n• How to find resources to help your community.\n• How you define your community is how it defines you.\n• How to build trust and reliability in the community.\n• How to make your community a safe space for everyone.\n• Code of conduct and why it's necessary.\n• Are you a community Ninja? - Career options as a DevRel advocate and Community Manager.\n• Testimonials of some community builders and how communities shaped their life and careers.\n\nSo, whether you're a seasoned community builder or just starting out, this talk will give you a perspective of redefining communities through DevRel and some actionable tips to turn your community into a inclusive space for harbouring growth, creativity and innovation.",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "5wc6otH8XJ"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "ELGzJm5Ha5"
    },
    "createdAt": "2025-03-31T20:26:11.800Z",
    "updatedAt": "2025-05-24T07:40:11.743Z",
    "is_enabled": true,
    "rating": 4.166666666666667,
    "deadline": {
      "__type": "Date",
      "iso": "2025-05-31T07:26:24.211Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "FOsAEMOcCa"
  },
  {
    "title": "Community Guide 2.0 - How communities are redefining DevRel and beyond.",
    "summary": "This talk explores the 'why' and 'how' of developer communities and why they are crucial for DevRel success. From dealing with the challenges that comes with managing the communities to bridging the gap between companies and developers through DevRel, a community builder often has to wear multiple hats, juggling between planning, execution and management in-between.\n\nWe will talk about the micro-details that culminate to form a bigger picture of community and some actionable strategies to cultivate inclusive, engaged, and diverse communities. By the end, the attendees will get key takeaways, along with the tools and confidence to build, or rebuild a community that thrives—not just survives. ",
    "description": "Written from the lens of a community builder who has build and scaled some of the India's top tech communities, I've been a part of many coveted Tech programs that deal with student communities through DevRel with companies like The Hack Club, GitHub, Google and Microsoft. \n\nThis is a beginner friendly talk that will cover -\n\n• Why communities play an integral role in DevRel?\n\n• How to build a Inclusive and Diverse community.\n\n• Building a community from scratch and leading it.\n\n• Impact of communities on DevRel and Business success.\n\n• Accessibility and why it isn't just a buzzword.\n\n• The roadmap to become a community manager in DevRel \n\nKey takeaways from this talk -\n\n• How to build a community from scratch and scaling it further.\n\n• The shared interests and pain points of a community that defines its goals.\n\n• Challenges that arise while managing a community and how to deal with it\n\n• How to find resources to help your community.\n\n• How you define your community is how it defines you.\n\n• How to build trust and reliability in the community.\n\n• How to make your community a safe space for everyone.\n\n• Code of conduct and why it's necessary.\n\n• Are you a community Ninja? - Career options as a DevRel advocate and Community Manager.\n\n• Testimonials of some community builders and how communities shaped their life and careers.\n\nSo, whether you're a seasoned community builder or just starting out, this talk will give you a perspective of redefining communities through DevRel and some actionable tips to turn your community into a inclusive space for harbouring growth, creativity and innovation.",
    "type": "talk",
    "level": "All",
    "category": "community",
    "coc": true,
    "record": true,
    "no_support": true,
    "reason": "I'm a community builder with 4+ years of experience in community management and I've build and scaled some of the India's top tech communities, I've been a part of many coveted Tech programs that deal with student communities through DevRel with companies like The Hack Club, GitHub, Google and Microsoft. I aim to make technology more accessible for under-represented communities and working towards building diverse and inclusive communities.",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "5wc6otH8XJ"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "ELGzJm5Ha5"
    },
    "createdAt": "2025-03-31T20:30:55.997Z",
    "updatedAt": "2025-05-24T08:08:48.923Z",
    "is_enabled": true,
    "rating": 3.8,
    "deadline": {
      "__type": "Date",
      "iso": "2025-05-31T07:46:48.121Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "OiYUoXsOc9"
  },
  {
    "type": "talk",
    "level": "beginner",
    "category": "devrel",
    "title": "Beyond Hello World: Designing DevRel for Real-World Impact",
    "summary": "Many DevRel programs succeed at capturing attention—but struggle to deliver long-term value. In this talk, we’ll explore how to evolve DevRel from surface-level engagement to impactful developer experiences that drive real adoption, feedback, and community-led momentum.",
    "description": "Too often, developer relations efforts stop at “Hello World”—introductory tutorials, launch blogs, and slick demos. While these are important entry points, they don’t guarantee lasting engagement or meaningful product adoption. So how do we move beyond the basics and design DevRel strategies that actually create impact?\n\nIn this talk, I’ll share practical frameworks and real-world stories on how to take developers from casual users to power contributors. From building feedback loops that influence product decisions, to running campaigns that spark sustained community involvement, we’ll walk through what it takes to build DevRel that’s not just visible—but valuable.\n\nWe’ll also explore the less glamorous but essential elements: internal advocacy, cross-functional alignment, and measuring the right outcomes. Whether you're part of a growing startup or a global org, this talk will equip you with strategies to create a DevRel flywheel that scales beyond swag and surface metrics—and starts delivering long-term developer success.",
    "first_event": "Not the same but was Keynote Speaker at DevRelCon Bengaluru - https://blr24.devrelcon.dev/speaker/siddhant-agarwal/",
    "coc": true,
    "record": true,
    "no_support": true,
    "reason": "I’ve spent over a decade building and scaling developer communities—from student ecosystems to global developer programs across APAC. In my current role, I lead Developer Relations for a graph database company where I’ve transformed DevRel from a support function into a growth engine. I’ve designed and executed initiatives that go beyond surface-level engagement—like content-driven campaigns, community contests, technical workshops, and field marketing partnerships that have generated thousands of opt-in leads and real product feedback.\n\nHaving spoken at global conferences like DevRelCon Bengaluru, The Fifth Elephant, and DataHack Summit, I bring both hands-on tactical knowledge and strategic clarity. My work spans diverse markets, so I understand how to drive real-world impact while adapting DevRel strategies to varied developer cultures and maturity levels. This session is rooted in real experiments, real wins—and real lessons learned.",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "LIbhUIhC31"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "OuZHfyGpJQ"
    },
    "createdAt": "2025-04-01T08:58:08.431Z",
    "updatedAt": "2025-05-24T12:37:35.729Z",
    "is_enabled": true,
    "rating": 4.166666666666667,
    "deadline": {
      "__type": "Date",
      "iso": "2025-05-31T07:27:54.405Z"
    },
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "read": true,
        "write": true
      },
      "role:admin": {
        "read": true,
        "write": true
      }
    },
    "objectId": "yxH2MLGs8m"
  },
  {
    "title": "Bridging the Culture Gap: Enabling Japan and Global Dev Teams to Thrive Together",
    "summary": "How can Japanese companies and international dev teams collaborate without cultural friction? This session explores real practices and mindsets to bridge communication gaps, foster mutual understanding, and create truly productive cross-cultural developer teams.",
    "description": "Japan’s development culture values formality, hierarchy, and long-term trust. Global teams often prioritize speed, transparency, and async collaboration. These differences can cause tension, but they can also create opportunity.\n\nAs a Bridge Software Engineer and Internal Dev Advocate, I work closely with Japanese clients, managers, and offshore dev teams. I also mentor engineering managers and team leaders, supporting them in navigating and aligning with Japanese-style work practices to improve cross-cultural collaboration and team productivity.\n\nThrough this experience, I’ve learned how to translate not just language, but also expectations, priorities, and working styles—helping teams reduce friction and work more effectively together.\n\nIn this talk, I’ll share:\n\n- Real examples of where cultural gaps caused delays—or breakthroughs\n- How I support leaders in adapting to Japanese workflows without sacrificing their leadership style\n- Strategies to build psychological safety across borders\n- Communication tips for Japanese stakeholders and international developers\n-  Frameworks to align product, team, and customer goals despite cultural gaps\n\nIf you're involved in or planning cross-border dev projects, this session will offer practical strategies for making them work smoothly.",
    "type": "talk",
    "level": "All",
    "category": "team",
    "reason": "I’ve lived in Japan for over 15 years and currently serve as a Bridge Software Engineer and Internal Dev Advocate, facilitating collaboration between Japanese clients and offshore teams in the Philippines. I mentor engineering managers and team leaders, helping them align their leadership and workflow with the expectations of Japanese businesses.\n\nMy role puts me at the intersection of engineering, communication, and culture, making me well-positioned to speak on how to bridge these gaps productively.",
    "coc": true,
    "record": true,
    "no_support": true,
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "o0pqZMYSPo"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "OuZHfyGpJQ"
    },
    "rating": 4.25,
    "is_enabled": true,
    "createdAt": "2025-05-24T16:43:51.065Z",
    "updatedAt": "2025-06-17T03:35:48.632Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-06-24T02:31:52.181Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      },
      "role:Speaker2025": {
        "write": true
      }
    },
    "objectId": "MFliCb3HM1"
  },
  {
    "title": "ゼロから始めるOSSプロダクト――国産ノーコード開発ツール『プリザンター』の共創と拡張",
    "type": "talk",
    "level": "beginner",
    "category": "business",
    "coc": true,
    "record": true,
    "no_support": true,
    "summary": "国産OSSのノーコード開発ツール「プリザンター」は、ゼロから開発を始め、企業とのパートナーシップやユーザコミュニティの力によって事業化に成功しました。本セッションでは、OSSとしての展開、DevRelによる共創の形、そして今後の海外展開に向けたチャレンジを紹介します。",
    "description": "OSSとして公開された国産ノーコード・ローコード開発ツール「プリザンター」は、当初は一人の開発者の手によって始まりました。多くの国産OSSが趣味や副業レベルにとどまるなかで、プリザンターは事業化に成功し、現在では120社を超える企業とのパートナー契約を持つ商用サービスへと成長しています。\n\n本セッションでは、OSSプロダクトを立ち上げてマネタイズを実現するまでの道のり、コミュニティの支援を得るための工夫、そしてユーザがファンとなって開発チームに加わるというDevRelの理想的な形について紹介します。\n\nまた、プリザンターの特徴である「ノーコード・ローコード」による開発体験が、ユーザの拡張性やコミュニティ貢献をどのように後押ししたのかにも触れ、プロダクトを通じたエンジニアとユーザの共創の可能性を共有します。\n\n今後は、多言語化対応や海外ユーザへの普及も見据えており、DevRelの視点からグローバル展開に向けた戦略や課題についてもあわせてお話しします。",
    "reason": "私は、一人の開発者として国産OSS「プリザンター」を立ち上げ、少しずつ仲間やユーザの共感を得ながら、ここまで育ててきました。開発・公開・普及・マネタイズといった一連の経験を通じて、DevRelの重要性を実感しています。同じように何かを広げようとしている方の参考になればと思い、この場でお話しさせていただきます。",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "mVxEUaSX3W"
    },
    "lang": "ja",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "OuZHfyGpJQ"
    },
    "rating": 4,
    "is_enabled": true,
    "createdAt": "2025-05-26T00:34:02.083Z",
    "updatedAt": "2025-07-03T06:53:09.857Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-06-24T02:31:57.043Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "LS2kqNKs5J"
  },
  {
    "summary": "Developer relations has traditionally thrived in companies building developer-first products, but what happens when B2B companies without direct developer tools want to engage the developer community? This session explores the unique challenges and opportunities of developer evangelism in B2B environments, where traditional metrics fall short and stakeholder buy-in requires creative approaches. Through real-world case studies and practical frameworks, we'll demonstrate how developer advocates can create measurable impact and build sustainable programs in companies where developers aren't the primary customer - but are crucial influencers in the buying process.",
    "description": "This session addresses the critical gap between traditional developer relations approaches and the realities of B2B business models. We'll explore how enterprise SaaS have successfully built developer communities and measured their impact on business growth.\n\nWhat Attendees Will Learn:\n\nFrameworks for measuring indirect developer influence on B2B sales cycles\n- How education is the pillar of a community \n- How to make developer trust your product with your developer community\n- Tactical approaches for content creation, event planning, and community building in B2B contexts\n- How to position developer evangelism as a strategic business function rather than a \"nice-to-have\"\n- How to leverage the community to become a continuous feedback for better developer experience of your product",
    "type": "talk",
    "level": "Intermediate",
    "category": "devrel",
    "reason": "I've lived the exact challenge this talk addresses. As a developer advocate across DevRev, DevAssure, and DevRel Squad, I've experienced firsthand how dramatically different DevRel success looks when you're not building developer tools directly.\n\nThe transition to developer-plus companies forced me to completely rethink how we measure success. When GitHub stars and API adoption metrics became irrelevant, I had to develop new frameworks for demonstrating value. I leaned heavily on the DevRel community during this learning process, collaborating with other practitioners facing similar challenges, testing different approaches, and documenting what actually worked versus what sounded good in theory.\n\nThis session isn't based on theoretical frameworks, it's built from real experiments, failed attempts, breakthrough moments, and the collective wisdom I've gathered from both my own experience and the broader DevRel community.",
    "first_event": "NA",
    "coc": true,
    "record": true,
    "no_support": true,
    "title": "The Uphill Battle: How Developer-Plus Companies Are Learning to Build Trust Through Education and Community",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "2IknnIHoVF"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "OuZHfyGpJQ"
    },
    "rating": 3.5,
    "is_enabled": true,
    "createdAt": "2025-05-26T17:57:27.695Z",
    "updatedAt": "2025-07-03T06:52:51.133Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-07-04T09:32:20.426Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "QLeCWXwJPd"
  },
  {
    "title": "勉強会から始まった僕のDevRel~新卒エンジニアがつないだ2年間の軌跡~",
    "summary": "新卒で入社してからの約2年、私は開発者としての成長と並行して、勉強会を起点に社内外の関係構築に取り組んできました。本セッションでは、チームや組織を越えたつながりを築きながら、DevRel的な価値をどう実践してきたのかを、現場エンジニアの視点からお話しします。",
    "description": "2023年に新卒で入社し、フルリモート・複数チーム所属という環境の中で、私は孤独感と向き合っていました。自分の存在や価値をどうやってチームに示していけばいいのか。その問いの答えとしてたどり着いたのが、「自分が場をつくること」でした。\n\n私は社内勉強会を立ち上げ、社内での技術交流の場を増やし、少しずつ仲間とのつながりを築いていきました。やがてそれは社外勉強会への登壇、他社エンジニアとの交流へと発展していきます。\n\n活動を続ける中で、周囲のメンバーにも変化が現れました。「登壇してみたい」「他社の人と話してみたい」といった声が増え、私自身が直接つながるだけでなく、他のメンバーが社外との関係を築く後押しにもつながっていきました。\n\nこのセッションでは、\n\n- 入社直後に直面したコミュニケーションの壁\n- 社内勉強会をどのように立ち上げ、継続してきたか\n- 勉強会を通じて得られた関係性とその広がり\n- 社外発信へつながったきっかけと工夫\n- 現場エンジニア視点で見たDevRelの実践\n\nを、具体的なエピソードを交えてお話しします。",
    "type": "talk",
    "level": "beginner",
    "category": "community",
    "reason": "私は株式会社ゆめみに新卒で入社し、サーバーサイドエンジニアとして約2年半にわたり、勉強会を軸に社内外の開発者との関係構築に取り組んできました。\n\nDevRelを専門とする職種ではない立場から、自然発生的に関係を築いてきた経験は、「自分もやってみよう」と思えるリアルな実例として、参加者に勇気と具体的なヒントを提供できると考えています。",
    "coc": true,
    "record": true,
    "no_support": true,
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "DGn6Uu62kU"
    },
    "lang": "ja",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "OuZHfyGpJQ"
    },
    "rating": 4.25,
    "is_enabled": true,
    "createdAt": "2025-05-26T18:10:12.913Z",
    "updatedAt": "2025-07-03T06:53:13.731Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-06-24T02:31:53.916Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "3cnCg96LRr"
  },
  {
    "title": "Bridging the Gap: Why Developer Relations and Product Management Must Work Together",
    "summary": "Discover how tight collaboration between Developer Relations and Product Management can turn community insights into product impact. This session explores why DevRel is not just an external-facing role—but a strategic partner in shaping what gets built and why it matters.",
    "description": "Developer Relations (DevRel) is often seen as a community-facing role focused on evangelism, education, and engagement. But what happens when DevRel is deeply integrated with Product Management (PM)? Magic.\n\nThis session will explore:\n\t•\tHow DevRel acts as a “real-time feedback loop” for product teams\n\t•\tWhy developer empathy is a strategic asset, not a soft skill\n\t•\tPractical collaboration models between DevRel and PM\n\t•\tReal-world examples of how developer feedback influenced product direction\n\t•\tHow to measure the joint impact of DevRel and PM initiatives\n\nBy the end, you’ll walk away with actionable ways to bring your DevRel and PM teams closer together—and make your products not only more developer-friendly, but more successful overall.",
    "type": "talk",
    "level": "Intermediate",
    "category": "business",
    "reason": "Taiji Hagino brings a unique perspective to the intersection of Developer Relations and Product Management, drawn from his extensive experience in both technical and strategic roles. As a developer advocacy expert, and a former product developer, he has worked closely with product teams to translate real-world developer needs into actionable product feedback.\n\nHis background spans product development, technical evangelism, and developer education. In addition to his industry roles, he teaches university courses on cloud architecture and developer experience, giving him a systems-level understanding of what developers value—and what products must deliver.\n\nTaiji is also a founder and board member of multiple industry associations in Japan. This blend of grassroots developer insight, product collaboration, and strategic community leadership makes him especially qualified to speak about how DevRel and PM can—and must—work hand in hand to drive developer-first innovation.\n",
    "coc": true,
    "record": true,
    "no_support": true,
    "first_event": "I have spoken a similar story at ProductTank Kyoto, but this session is slightly difference story what modified to the DevRelKaigi. ",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "LkpahEPGU7"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "OuZHfyGpJQ"
    },
    "rating": 5,
    "is_enabled": true,
    "createdAt": "2025-05-29T23:48:19.740Z",
    "updatedAt": "2025-06-17T05:30:26.140Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-06-24T02:29:40.244Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      },
      "role:Speaker2025": {
        "write": true
      }
    },
    "objectId": "dD6E2Xb19W"
  },
  {
    "title": "東京育ちの移住者が地域支部を飛び回ってコミュニティ過疎県で地元コミュニティを立ち上げた話し",
    "type": "talk",
    "level": "beginner",
    "category": "community",
    "coc": true,
    "record": true,
    "no_support": true,
    "reason": "広い日本の中でも数少ないITコミュニティ過疎県で、勉強会を立ち上げ継続し、満員御礼の参加登録をいただき運営できているノウハウがあるから。",
    "summary": "都会育ちの移住者がコミュニティに出会ってから、地域支部を飛び回って学び繋がりながら、コミュニティ過疎県の地元で、一念発起してコミュニティを立ち上げた話しとこれからについてお話しします。",
    "description": "東京育ちで東京勤務している中で、東京から2時間の郊外に移住しました。そんな中、コミュニティとの出会いが日本全国の各地域との繋がりを作るきっかけになりました。そんな日本全国の地域を飛び回る中、地元での繋がれる世界を夢見るようになりました。一方、地元は東京に比べると100分の1の規模のITコミュニティしかない砂漠のような「コミュニティ過疎県」でした。「なければ自分で作る」しかありません。覚悟、仲間との奇跡的な出会い、立ち上げ、そして、運営して見えたリアルな課題をお話しし、みなさんと地域コミュニティの未来について考えたいと思います。(日本語での登壇を予定しています)",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "imJxVDHEB7"
    },
    "lang": "ja",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "OuZHfyGpJQ"
    },
    "rating": 3.75,
    "is_enabled": true,
    "createdAt": "2025-05-31T01:42:06.401Z",
    "updatedAt": "2025-06-17T03:18:31.510Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-06-24T02:32:10.079Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      },
      "role:Speaker2025": {
        "write": true
      }
    },
    "objectId": "3WkxkgYkD4"
  },
  {
    "title": "Managing Hybrid Communities: Balancing Local & Global Engagement",
    "description": "Building and managing a hybrid community—where some members meet in person while others engage online—is a big challenge in Developer Relations. The key is to ensure that both groups feel equally valued and connected.\nAt Freshworks, BrowserStack, and now Kong, I have worked on growing communities that are active both locally and globally. Through these experiences, I’ve learned:\nHow to support local community leaders while keeping a global approach.\nThe best mix of in-person events and online activities to keep engagement high.\nWays to scale community programs across different regions without losing authenticity.\nHow to measure success and keep improving the hybrid model.\nI’ll share real examples, including:\nBrowserStack's Testing Community – Running meetups while keeping a strong online presence.\nKong’s Global Community Strategy – Expanding local meetups in APAC while staying connected to the global developer network.\nFreshworks Developer Community – Engaging local developer advocates while ensuring a unified global experience.\n\nHow to support local communities while keeping them connected globally.\nThe right balance between in-person and online engagement.\nHow to measure and improve hybrid community strategies over time.",
    "type": "talk",
    "level": "All",
    "category": "community",
    "first_event": "No",
    "coc": true,
    "record": true,
    "no_support": true,
    "reason": "That’s a tough one to answer, so I’ll let you be the judge of that! But here’s why I want to to deliver this talk: I’ve had the unique opportunity to work in Developer Relations roles across three very different companies—Developer Plus (Freshworks), a Developer-first B2B company (BrowserStack), and an open-source developer first with a B2B offering (Kong).\nIn these roles, I’ve been  involved in supporting and enabling developers to use our platforms effectively. But my work didn’t stop there—I also collaborated closely with various stakeholders to demonstrate how DevRel contributes to business success. Whether it was helping beginners get started by attracting enterprise end users. bringing valuable user feedback to the product team, or tracking community activities at the account level to guide business decisions, I’ve seen and experienced how DevRel can build stronger relationships with developers and drive business growth.\nI want to share these experiences and insights with others in the hope that they can apply them to their own work and see the real impact that DevRel can have on a company’s success.\n",
    "summary": "Building hybrid communities—blending local meetups with global online engagement—is a key challenge in Developer Relations. Drawing from my work at Freshworks, BrowserStack, and Kong, I’ll share strategies to support local leaders, scale programs globally, and measure success. Real examples and takeaways will help you build a thriving, connected hybrid community.\n\n",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "LTw6TCG6Fl"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "OuZHfyGpJQ"
    },
    "rating": 4,
    "is_enabled": true,
    "createdAt": "2025-05-31T05:27:13.967Z",
    "updatedAt": "2025-07-03T06:52:38.597Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-07-07T12:20:39.622Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "B5BFGjBT5n"
  },
  {
    "title": "チームで行うDevRel活動 - 事業貢献をしながらユーザーに価値を届けるために",
    "summary": "DevRel活動は、イベント、メディア、コミュニティ活動、ワークショップと多岐にわたります。\nそれらを一人でまかない切るのではなく、プロフェッショナルとして個人の力を活かした方が、より大きな効果が期待できます。\nそして、それは事業やプロダクトの思想や目標、数字と紐づいてなければなりません。\n本セッションでは、ファインディが立ち上げから20名規模の組織になり、事業価値とユーザーへの価値を両立している考え方や取り組みを紹介します",
    "description": "1.FindyのDevRelの取り組み \n- 組織規模 \n- 立ち上げの苦悩と課題\n- ミッション\n2.DevRelとMKの棲み分けと考え方\n-  海外と日本のDevRelの違いを、DevRelConferene NY参加から考える\n-  MKとの共同の仕方、CSやSalesとのつなぎ込み\n3. 個々人の特性を考えて組織マネジメントする\n- DevRelは総合力が求められる\n- プロフェッショナルな力を活かすことと、それをマネジメントすること\n- 開発組織の考え方と同じ組織づくり（チームトポロジーから考える）\n4. Findyのイベントやカンファレンスの取り組み\n5.まとめ",
    "type": "talk",
    "level": "Intermediate",
    "category": "business",
    "reason": "ファインディ株式会社で、DevRelの立ち上げから20名まで組織を拡大し、事業にとってなくてはならない存在にしたため",
    "first_event": "なし",
    "co_speaker": false,
    "coc": true,
    "record": true,
    "no_support": true,
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "SCL6YoPqvX"
    },
    "lang": "ja",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "OuZHfyGpJQ"
    },
    "rating": 3.6666666666666665,
    "is_enabled": true,
    "createdAt": "2025-05-31T07:48:02.840Z",
    "updatedAt": "2025-07-14T08:39:38.266Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-07-20T01:50:12.988Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      },
      "role:Speaker2025": {
        "write": true
      }
    },
    "objectId": "V0WoratQQL"
  },
  {
    "type": "talk",
    "level": "All",
    "category": "devrel",
    "no_support": true,
    "record": true,
    "coc": true,
    "summary": "業務でのアプリ開発中に出会った海外AIツールとの偶然の縁。単なるユーザーフィードバックから始まったCEOとの対話が、いつしか日本市場進出の架け橋役へと発展しました。\n大手企業との商談機会創出、自発的な技術啓蒙活動を経て、正式な日本地域デベロッパーアドボケイトに。好きな技術を語るだけだった活動が、国際的な企業と日本市場を繋ぐキャリアへと変化した実体験をお話しします。\nテクノロジーへの純粋な情熱が、予想外のキャリアパスを切り拓くことがある—そんな可能性と学びを共有します。",
    "title": "越境するテック情熱：AI ツールとの出会いが導いた海外スタートアップとの協働",
    "description": "このセッションでは、デザインからコードを生成する革新的なAIツールとの出会いから始まり、海外スタートアップの日本市場展開の一翼を担うまでの軌跡を具体的に解説します。\n\n### お話しする内容\n1. **出会いのきっかけ**\n   - 業務でのモバイルアプリ開発における課題と海外AIツールの発見\n   - 技術的な興味から始まったフィードバックとCEOとの対話プロセス\n2. **関係性の変化と深化**\n   - 単なるユーザーから潜在顧客紹介者へのシフト\n   - 東証プライム上場企業を含む商談機会の創出手法\n   - 代理店契約から地域デベロッパーアドボケイトへの進化\n3. **実践的活動と成果**\n   - 技術セッションでの自発的なプロダクト紹介とその効果\n   - CEOの来日講演サポートの裏側\n   - 顧客ミーティングでの技術デモと通訳における工夫\n4. **得られた知見と教訓**\n   - 技術コミュニティ活動が国際的なビジネス機会につながるメカニズム\n   - 本業のスキル（Microsoftから現職までの20年のエバンジェリスト経験）を活かした副業展開の秘訣\n   - 海外スタートアップと日本企業の文化ギャップを埋める際の実践的アプローチ\n5. **これからの可能性**\n   - テクノロジストが「国際的な架け橋」となる新しいキャリアパスの展望\n   - 副業として技術アドボカシーを展開するための具体的なステップ\n### このセッションから得られるもの\n- 技術への情熱を副業やキャリア拡張につなげる実践的なヒント\n- 海外テックスタートアップとの関係構築における日本特有の課題と解決策\n- テクノロジストが持つ「説明力」「翻訳力」の新たな価値創造の可能性\n- 本業で培ったスキルを別の文脈で活かすためのマインドセットと行動パターン\n\n個人的な実体験に基づく具体的なストーリーを通じて、聴講者自身も自分の技術的関心から新たなキャリアチャンスを見出すきっかけとなるセッションを目指します。技術と人、国と国を「越境」することで生まれる新たな可能性について、共に考える場としたいと思います。",
    "reason": "実体験として自分自身がこの1年リアルタイムに経験していることであり、副業という意味でも新しい形だと思います。",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "yKIQDHxj1L"
    },
    "lang": "ja",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "OuZHfyGpJQ"
    },
    "rating": 4.666666666666667,
    "is_enabled": true,
    "createdAt": "2025-05-31T08:15:54.847Z",
    "updatedAt": "2025-07-03T06:53:05.537Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-06-24T02:31:47.079Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      }
    },
    "objectId": "CJAlmg5Quh"
  },
  {
    "title": "Boosting DevRel: Simple SEO, Scalable Programs, and Community Power",
    "summary": "In this session, I will outline three actionable pillars - SEO optimization, modular program frameworks, and community engagement tactics, that enable DevRel teams to amplify their impact without proportionally increasing headcount or budget. Attendees will walk away with a clear, step-by-step playbook they can implement immediately to generate more organic reach, launch repeatable programs, and foster a vibrant developer community.",
    "category": "experience",
    "level": "All",
    "type": "talk",
    "description": "Developer Relations doesn’t have to require massive resources or overengineered initiatives. In this talk, I will break down how any team can:\n\n1. Leverage SEO to Attract Developers\n - Identify high-value keywords that align with real developer search behavior\n - Structure blog posts, tutorials, and documentation so search engines—and developers—can find your content effortlessly\n - Apply a simple SEO checklist to increase organic traffic within months\n\n2. Build Programs That Scale Like Lego\n - Design a “template” for hackathons, office hours, webinars, and workshops that can be reused globally\n - Automate invitation workflows, slide decks, and follow-up surveys so you can spin up new events in days rather than weeks\n- Optimize resource allocation so you don’t need to hire additional headcount to run a growing slate of DevRel initiatives\n\n3. Empower and Grow Your Community\n - Establish clear contribution guidelines, mentorship pairings, and small recognition programs (e.g., “Contributor of the Month”)\n - Align with local meetup organizers and open-source maintainers to co-create content and events\n - Leverage feedback loops—surveys, GitHub metrics, and direct outreach—to continuously refine programs and keep contributors engaged\n\n4. Measure, Iterate, and Improve\n - Track core metrics such as Monthly Active Developers (MAD), Pull-Request Velocity (PRV), and Event Feedback Scores (EFS)\n - Set up lightweight dashboards to monitor progress and identify bottlenecks\n - Iterate on program components (e.g., cadence, format, rewards) based on data, not intuition\n\nBy the end of this session, you will have a straightforward, repeatable playbook that leverages SEO, modular program design, and community collaboration to multiply your DevRel impact while maintaining operational efficiency.",
    "coc": true,
    "record": true,
    "no_support": true,
    "reason": "I’ll explain how clear contribution guides, mentorship matchups, and small rewards (like “Contributor of the Month”) keep people engaged. These simple tactics have helped me run over 40 events across India, and bring in audiences from across APAC, EU. I also  regularly track key DevRel KPIs  and iterate on program components based on data. This discipline has enabled continuous improvement and demonstrable ROI for my DevRel initiatives.",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "DG4aCsSYI2"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "OuZHfyGpJQ"
    },
    "rating": 4.333333333333333,
    "is_enabled": true,
    "createdAt": "2025-05-31T09:41:04.897Z",
    "updatedAt": "2025-06-17T08:57:20.612Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-06-24T02:46:14.755Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      },
      "role:Speaker2025": {
        "write": true
      }
    },
    "objectId": "UUSftDFfal"
  },
  {
    "type": "talk",
    "level": "All",
    "category": "education",
    "title": "Beyond Documentation: Creating Immersive Learning Journeys for Developer Success",
    "first_event": "n/a",
    "coc": true,
    "no_support": true,
    "record": true,
    "summary": "Despite a thriving Kubernetes ecosystem, one challenge continues to undermine developer onboarding and proficiency: static documentation doesn’t teach context. Most developers don’t fail because they can’t read docs they fail because docs don’t match how people actually learn. \n\nSo how do we fix this?\n\nDrawing from our experience building and curating learning platforms within the CNCF community, we’ll explore how cognitive flow design, audience-journey mapping, and metrics-driven sandboxing can dramatically accelerate learning. We’ll walk through real-world patterns like “Kubernetes escape rooms,” failure-forward environments, and scaffolded labs that have improved time-to-proficiency by up to 40%—all while reinforcing better security practices and increasing adoption rates.\n\nAttendees will leave with blueprints to build playful, progressive, and purpose-built learning experiences in their own ecosystems whether for internal teams, open source contributors, or external customers.\n\nThis talk isn’t about docs. It’s about changing the way we teach, learn, and thrive our developers in our ecosystem with immersive education. ",
    "description": "Static documentation isn’t broken, but it’s not enough. Developers don’t struggle because they can’t read docs; they struggle because docs don’t reflect how people actually learn.\n\nThis session is for DevRel professionals ready to rethink developer education through immersive, context-rich experiences. Drawing from real-world experience building learning environments in the CNCF community, we’ll explore how techniques like cognitive flow design, audience-journey mapping, and sandbox-based training can significantly improve how developers onboard, explore, and master complex technologies.\n\nWe’ll share patterns that go far beyond traditional tutorials: Kubernetes escape rooms, failure-forward labs, and scaffolded hands-on environments that have improved time to proficiency by up to 40 percent. These methods also help reinforce secure development practices and increase certification success. The result is learning that feels like play, builds confidence, and drives real adoption.\n\nThis talk is more than a case study. It offers a vision for how DevRel teams can lead the shift from passive documentation to active, measurable education. Attendees will learn how to design for developer flow, map learning journeys, and track outcomes that matter.\n\nYou’ll leave with practical blueprints and examples to make developer education more engaging, effective, and accessible so your docs don’t just explain, they truly teach.",
    "reason": "As a CNCF Ambassador with a strong focus on developer education, I’ve spent the past few years designing and delivering highly rated technical workshops at conferences like NDC Oslo, AWS Community Days Singapore, and others (see [Sessionize](https://sessionize.com/hrittikhere)). These sessions consistently receive positive feedback for being practical, hands-on, and thoughtfully structured.\n\nBeyond conferences, I’ve led workshops tailored to both the community and enterprise customers, working closely with solution engineering teams. This dual perspective has helped me understand what resonates with open source contributors versus what drives adoption and confidence in customer settings.\n\nThrough my ongoing mentorship and contributions in the CNCF ecosystem (see [Credly](https://credly.com/users/hrittikhere)), I’ve helped developers go from feeling overwhelmed to certification-ready by focusing on what truly works in real learning environments.\n\nI also write regularly to refine and share my approach to structuring educational content (see [GitHub blogs](https://github.com/hrittikhere/blogs)). These writings are not just tutorials—they’re frameworks to help others teach better and learn faster.\n\nThis session draws directly from these experiences and lessons. I’ve seen firsthand how immersive, play-driven, and cognitively aligned education makes a measurable difference and I’m passionate about helping others bring that transformation to their own developer communities with targeted education. ",
    "co_speaker": true,
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "Hml6XJCdZH"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "OuZHfyGpJQ"
    },
    "rating": 4,
    "is_enabled": true,
    "createdAt": "2025-05-31T10:15:08.586Z",
    "updatedAt": "2025-06-17T04:29:17.214Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-06-24T02:32:00.918Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      },
      "role:Speaker2025": {
        "write": true
      }
    },
    "objectId": "nCUVs27nsb"
  },
  {
    "title": "Building API Experiences Your Developers Love",
    "description": "I have been in the API Developer Relations space since 2021. It's one of the most toughest Developer Relations field to manage. If you are a new React framework company, your DevRel efforts might be minial as everyone in the tech is general excited about the new frameworks or front-end technology. But API Developer Relations is hard to manage as API is the most boring technology. In this session, I want to present what are the some offerings along with the documentation that can help providing a standout API DX. This includes sandboxing, SDKs, Playground, clearer error messages, and beyond.\n\nI test a lot of API products so I want to show different API companies and how they are excelling in API DX space. Trust me, I am not going to be focused on my company for free promotion. I want this talk to be 100% organic and open.",
    "summary": "Developer Relations field is not like a software engineering where everything is pretty standard and consistent. DevRel has to be tailored for each type of technology. My session will focus on API Developer Relations and how to do it well. ",
    "type": "talk",
    "level": "Intermediate",
    "category": "devrel",
    "reason": "Because ever since I started working professionally, I have been around APIs. ",
    "coc": true,
    "record": true,
    "no_support": true,
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "NyiE99KvnI"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "FVkLmDT7az"
    },
    "rating": 4.166666666666667,
    "is_enabled": true,
    "createdAt": "2025-06-17T13:56:46.976Z",
    "updatedAt": "2025-07-14T11:26:49.113Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-07-21T01:42:14.373Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      },
      "role:Speaker2025": {
        "write": true
      }
    },
    "objectId": "jsraBiDheG"
  },
  {
    "title": "What if Your DevRel Could Also Write? PS: The Secret Weapon in DevRel",
    "summary": "DevRel teams love their demos, talks, and Twitter threads, but often overlook the most clicked, most trusted, and most silently powerful piece of the puzzle: The Docs.\n\nBehind every great developer experience is a great document, but we rarely talk about WHO wrote it. \nIn this talk, I’ll explore how combining writing skills with DevRel responsibilities supercharges everything from onboarding and API adoption to community trust and content strategy. I’ll share the lessons I have learned from my own journey of growing into a Developer Advocate, working across open-source ecosystems and developer tools, and outline how DevRel teams can better recognize, collaborate with, and grow from technical writing. If you're still treating writing as “support work,” you're leaving developer success behind. Let’s rethink DevRel, not just as a speaker’s role, but as a writer’s platform too.\n",
    "description": "**What if your DevRel Engineer wasn’t just a speaker, demo builder, or community face, but also your strongest communicator on paper? **\n\nFor many developers, documentation is their first, and sometimes the only touchpoint with your product. It conveys your tone, your values, and your attention to detail. If your docs aren’t clear, accessible, and globally relevant, your community won’t be either. And yet, the people who craft this experience—the technical writers, are rarely acknowledged as part of the DevRel equation. \n\nThis talk shines a light on the overlooked role of technical writers in Developer Success. From first-touch onboarding to long-tail adoption, I’ll show how good docs are doing DevRel’s most critical work, quietly and at scale. I will also share how my experience as a technical writer organically led me to take on DevRel responsibilities, and why this hybrid model is more powerful (and sustainable) than most teams realise. \n\nThrough out this talk, we will dig into:\n* How technical writing impacts onboarding, adoption, and community health\n* Where and How DevRel teams are losing efficiency by not investing in writing\n* How to elevate technical writers as contributors in DevRel strategy, within the existing workflows, without changing your org chart.\n",
    "coc": true,
    "record": true,
    "no_support": true,
    "category": "devrel",
    "level": "Intermediate",
    "type": "talk",
    "reason": "I’ve been a technical writer at ONLYOFFICE for the past two years, but in reality, I’ve also been quietly doing the work of a DevRel all along. From speaking at conferences to helping community developers troubleshoot integrations and improve onboarding flows, I’ve been sitting at the intersection of writing, developer support, and community engagement.\n\nThis undercover, hybrid DevRel X Technical Writer role has worked us wonders and this approach has allowed us to scale support, reduce onboarding friction, and build a global community of contributors without relying heavily on traditional evangelism.\n\nAs the first technical writer on our team to step into the shoes of a DevRel Engineer, I’m in a unique position to share not just the “why,” but also the “how” with practical examples, workflows, and lessons from a team that’s been doing DevRel through technical writing for long.",
    "user": {
      "__type": "Pointer",
      "className": "_User",
      "objectId": "mtAxEaTpkP"
    },
    "lang": "en",
    "status": "Sent",
    "cfp": {
      "__type": "Pointer",
      "className": "CFP",
      "objectId": "FVkLmDT7az"
    },
    "rating": 4.666666666666667,
    "is_enabled": true,
    "createdAt": "2025-07-02T13:14:00.113Z",
    "updatedAt": "2025-07-13T05:08:39.144Z",
    "deadline": {
      "__type": "Date",
      "iso": "2025-07-20T01:43:02.677Z"
    },
    "key": null,
    "review": true,
    "responseStatus": true,
    "ACL": {
      "*": {
        "read": true
      },
      "role:Organizer2025": {
        "write": true
      },
      "role:Admin": {
        "write": true
      },
      "role:Speaker2025": {
        "write": true
      }
    },
    "objectId": "RApcsqldBo"
  }
]