[{"id":"workshop-1","name":"中津川篤司","company":"MOONGIFT","session_title":"DevRelの基本と実践的施策","description":"本ワークショップでは、DevRelの基本と実践的な施策について解説します。チェックリストに基づいて、自社の過不足を発見し、明日から取り組むべき施策について洗い出します。","audiences":"","points":"- DevRelとは何か、何をするものか\n- 代表的なマーケティング手法の考え方\n- 開発者マーケティングで使えるテクニック\n- 代表的なDevRel施策と、その予算感","timeline":"- DevRelの基本（15分）\n  - DevRelがどういったもので、何をゴールにするかを学びます\n- 代表的マーケティング手法と開発者マーケティング（15分）\n  - SWOT、ペルソナ分析など代表的なマーケティング手法と、開発者特有のマーケティング手法の相違を学びます\n- 予算別。実践的DevRel施策（20分）\n  - DevRel、マーケティング予算に分けて実際に行える施策を紹介します。予算が低い中でもできること、予算があればできることを学びます。\n- 質疑応答（10分）\n  - 途中で質問して問題ありませんが、残った質問についてお答えする時間です。","category":"DevRel","start_at":"13:00","time":"01:15","user":"KE5MznFkl8"},{"id":"workshop-2","name":"小田祥平","company":"mabl","session_title":"事業貢献につながる技術コミュニティ戦略策定ワークショップ","description":"本ワークショップは、技術コミュニティを単なる活動で終わらせず、事業成長に結びつけたいと考えている担当者やマネージャー向けです。コミュニティの目的と、それがビジネスゴールにどう貢献するかを明確に定義することに焦点を当てます。まず「共感」のステップで、社内外のステークホルダーがコミュニティに何を期待しているかを分析します 。次に「定義」のステップで、「コミュニティを通じてどのように事業課題を解決できるか？ (How Might We)」を問いとして設定し、コミュニティの戦略的な役割を言語化します 。最終的に、その戦略を実現するための具体的なアクションプランを策定し、インパクトの大きさに基づいて優先順位を決定します。","audiences":"- 技術コミュニティ運営を担当しており、その活動のROI (投資対効果) を高めたい方\n- コミュニティの活動内容を、事業目標やプロダクト戦略と連動させたいDevRel、プロダクトマネージャー、事業開発担当者\n- コミュニティの価値や貢献度を、経営層や他部門に説明する必要がある方","points":"","timeline":"- 00:00 - 10:00 (10分) イントロダクション  \n  - 技術コミュニティについての基礎知識\n  - ワークショップの目的とゴール、なぜコミュニティに戦略が必要かの説明\n- 10:00 - 25:00 (15分)フェーズ1: 共感 (Empathize)\n  - ワーク: ステークホルダー分析 \n  - コミュニティに関わるステークホルダー (マネージャー、開発チーム、主催/運営者、参加者など) を洗い出し、それぞれの期待や要望を書き出します。\n- 25:00 - 45:00 (20分) フェーズ2: 定義 (Define)\n  - ワーク: 戦略的HMW (How Might We...?) の設定 \n  - 事業課題とステークホルダーの期待を踏まえ、「どうすれば私たちのコミュニティは、事業課題の解決に貢献できるだろうか？」という戦略的な問いを立て、コミュニティの役割を定義します。\n- 45:00 - 55:00 (10分) フェーズ3: 創造 (Ideate)\n  - ワーク: 戦略的アクションの選定\n  - 定義した戦略的HMWを達成するためのアクションを短時間でアイデア出しし、最もインパクトの大きいものを1つ選び、初手として具体化します。\n- 55:00 - 60:00 (5分) ラップアップ\n  - 策定したコミュニティ戦略とアクションを共有し、今後の活動への接続を確認します","category":"開発者コミュニティ","start_at":"14:15","time":"01:15","user":"HaxzGHkVJr"},{"id":"workshop-3","name":"田中正吾","company":"ワンフットシーバス","session_title":"明日から使える！DevRel のコミュニケーションにプラスする生成 AI のスパイス！ ～DevRel + 生成 AI 活用術ワークショップ～","description":"本ワークショップでは、生成 AI と DevRel の効果的な活用について、講師自身の経験を交えて生成 AI と DevRel の組み合わせ方をトークとリアルタイムデモでお伝えします。参加者のみなさんに明日から使える Tips を持ち帰っていただくワークショップです。\n\n内容は以下を予定しています。開発者からの一期一会の技術相談をより良い体験にできる生成 AI のスパイスを知りたくないですか？ぜひご参加ください\n","audiences":"","points":"- 技術アドバイスに図表生成追加デモ  \nテキストベースの技術アドバイスに、生成 AI で目に見える視覚的な図表アドバイスをプラスして相談いただいた開発者への実装解像度を向上させる手法\n- 技術相談への AI 議事録ツール活用デモ  \nAI 議事録ツールを開発者の技術相談へ応用することで、相談者は議論に集中でき、後にテキストでの議事録ができることによるサポートの質を向上させる手法\n- コード生成のサポートテクニック  \nハッカソンや技術サポート時に開発者自身のコード生成自体を向上させるテクニックとして、テンプレートとなるコード提供や、プロンプトの書き方のサポート、サンプルコードでの注意点\n- 生成 AI チャットのまとめ技  \nチャット単位で実施した内容のまとめを都度作成させてナレッジとして蓄積する手法から、後日議論を再開したり、他の生成AIにも聞いたりと継続的なフォローが行える手法","timeline":"- 10分 オープニング  \n概要説明と効果の紹介\n- 40分 メイン部分  \nデモと詳細解説\n- 10分 クロージング・質疑応答  \n参加者からの質問対応\n","category":"生成AI","start_at":"15:30","time":"01:15","user":"on3JX8y3BE"},{"id":"workshop-4","name":"小山正博","company":"クラスメソッド","session_title":"チームで運営するテックブログ～その始め方と続け方","description":"本ワークショップでは、企業や部門がテックブログを開設し、継続していくための各ステップをご紹介します。ワークを通じてタスクや具体化すべき点を把握できる実りある60分です。","audiences":"","points":"- 多くの企業がテックブログを運営する理由・ブログ運営の効果\n- ブログ開設準備の重要ポイント\n- ブログ投稿前後のプロセス\n- ブログ継続のための工夫\n- その他、運営・ファンづくりに成功しているブログの特徴","timeline":"- テックブログをなぜ開設するのか（20分）  \n　テックブログを通じた発信の目的・便益や、具体的なブログのあり方を学べます。\n- ブログ開設までのステップ（15分）\n  運営担当者が、ブログ開設までに検討すべき事項をご紹介し、シートへの記述作業を通じて、今後解像度を上げるべき部分を見出します。\n- ブログ投稿～継続のステップ（15分）  \n  ブログ投稿前と投稿後に運営担当者がやるべきことのほか、その他運営継続に必要な事項もご紹介します。\n質疑応答（10分）","category":"テックブログ","start_at":"16:45","time":"01:15","user":"Jn701A7EU0"}]